{
    "currentWord": {
        "wordRoot": "admire",
        "id": 19910,
        "phonemic": "ədˈmaɪə(r)|ədˈmaɪər\r",
        "bigId": "18ebcde4-8e85-4eaa-bd14-b0bcb8d9b317",
        "wordForms": [
            "admires",
            "admiring",
            "admired",
            "admirers",
            "admirer",
            "admire"
        ]
    },
    "senses": [
        {
            "id": "18ebcde4-8e85-4eaa-bd14-b0bcb8d9b317",
            "de": "To look at something or somebody with pleasure",
            "ty": "verb",
            "ex": "I really admire your bravery.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "admire someone's courage",
                " admire the view",
                " admire the artwork"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/18ebcde4-8e85-4eaa-bd14-b0bcb8d9b317.webp",
            "Tips": [
                {
                    "title": "Positive Emotion",
                    "description": "Shows you have positive feelings about someone's actions or qualities.",
                    "example": "Watching the kids play, I admired their simple joy.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/YBLUmvjSf2JyEGSamvTrS7Sp9HY.webp"
                },
                {
                    "title": "Visual Pleasure",
                    "description": "Used when something is visually pleasing and you appreciate looking at it.",
                    "example": "We admired the colorful sunset from the balcony.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/TCQtCtF6eY1wyEiaIB6R7Zg7Y.webp"
                },
                {
                    "title": "No Envy",
                    "description": "Admiring doesn't mean you're jealous, it's a form of respect.",
                    "example": "I admire her style, but I'm content with my own.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/yIUFF0IP2AvgziH1Ht0IOSoo.webp"
                }
            ]
        },
        {
            "id": "387a459f-8ab5-4030-8da0-20552eb27994",
            "de": "To respect or think highly of someone or something",
            "ty": "verb",
            "ex": "Everyone admires her for her honesty.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "admire someone's dedication",
                " admire someone's commitment",
                " admire someone's talent"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/387a459f-8ab5-4030-8da0-20552eb27994.webp",
            "Tips": [
                {
                    "title": "Genuine Esteem",
                    "description": "Implies sincerity when you have a high opinion of someone's attributes.",
                    "example": "She admired her teacher's patience with all her students.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Acknowledging Skills",
                    "description": "To recognize and respect a person's skills or achievements.",
                    "example": "He admired her ability to resolve conflicts with ease.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Vocal Praise",
                    "description": "You often express your admiration of someone aloud to others.",
                    "example": "The community openly admired the mayor's dedication.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "15cdd6a4-88f4-422d-abbd-a10fa76011b5",
            "de": "To feel or express admiration",
            "ty": "verb",
            "ex": "She stood back to admire her handwork.",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                "admire the beauty",
                " admire the design",
                " admire the achievement"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/15cdd6a4-88f4-422d-abbd-a10fa76011b5.webp",
            "Tips": [
                {
                    "title": "Personal Achievement",
                    "description": "When you admire something you've done yourself, it shows pride in your work.",
                    "example": "After redecorating, I took a moment to admire my handiwork.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Response",
                    "description": "It's a feeling that combines respect and pleasure.",
                    "example": "I admire your dedication to volunteering; it warms my heart.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Adore": {
            "wordRoot": "Adore",
            "wordDefinition": "Adore is used when we have a strong feeling of love and admiration towards someone or something. For example, you might adore your partner for their kindness and thoughtfulness.\n\nAdmire is used to express appreciation, while adore is for expressing a strong feeling of love and admiration.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f95eb14e-91d4-4683-bb48-17153daddc49.webp"
        },
        "Applaud": {
            "wordRoot": "Applaud",
            "wordDefinition": "Applaud means to show approval or praise by clapping hands. It is applicable when we want to express our appreciation for someone's performance, speech, or achievement.\n\nFor example, we may applaud a musician's concert, a politician's speech, or an athlete's victory.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7f02b703-5335-4f94-903e-813c50a3be61.webp"
        },
        "Appreciate": {
            "wordRoot": "Appreciate",
            "wordDefinition": "Appreciate means recognizing the value or worth of something or someone. It involves the idea of being grateful for or enjoying something.\n\nWe use the word appreciate when we want to express how much we like or understand something.\n\nAdmire is used when we want to express respect for someone or something they have achieved, while appreciate is used when we want to express gratitude or enjoyment for something or someone that we like.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f4aba09c-a6e1-4456-bb59-9cf9236d3bef.webp"
        },
        "Esteem": {
            "wordRoot": "Esteem",
            "wordDefinition": "Esteem means to hold someone in high regard and respect for their inner qualities, like their principles or character.\n\nEsteem goes beyond the external display of actions or talent and focuses on the inner qualities of a person. For example, a person may esteem their friend for their loyalty and honesty.\n\nHowever, admire is more commonly used to describe admiration of someone's external qualities, while esteem is more commonly used to describe the admiration of someone's inner qualities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/caec7e06-36eb-4ff0-bf04-af2991b969b0.webp"
        },
        "Glorify": {
            "wordRoot": "Glorify",
            "wordDefinition": "Glorify means to praise or honor someone or something.\n\nExample: Some people glorify celebrities for their fame and fortune.\n\nIn simpler terms, admire is about respect and fondness, while glorify is about praise and honor.\n\nAdmire can be applied in everyday life when we appreciate a person or thing, whereas glorify is usually used in a more formal or religious context to elevate someone or something to a higher status.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/12a0d956-b7ec-4b97-9788-8d323d472f49.webp"
        },
        "Honour": {
            "wordRoot": "Honour",
            "wordDefinition": "Honour is used when we show respect and recognition to someone for their achievements, contributions, or special qualities.\n\nFor example, we can honour a war veteran for their bravery and sacrifice for their country.\n\nAdmire is used when we feel positive emotions towards someone, while honour is used when we want to show respect to someone for their accomplishments or qualities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dfacdcdf-7111-41ce-bfc1-2d66e994f438.webp"
        },
        "Idolize": {
            "wordRoot": "Idolize",
            "wordDefinition": "Idolize means to have an excessive or unhealthy admiration or worship for someone or something. It is when you elevate someone to a level where they can do no wrong, even if they have flaws or make mistakes.\n\nFor example, if someone idolizes a celebrity, they may ignore any negative behavior or actions of that celebrity.\n\nIn general, it is good to admire people for positive traits and actions, but idolizing someone too much can be unhealthy and potentially problematic.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b96243ca-6801-4f45-baef-52eb8fa3a680.webp"
        },
        "Respect": {
            "wordRoot": "Respect",
            "wordDefinition": "Respect means to have a feeling of deep admiration or esteem towards someone or something based on their achievements, actions, or qualities.\n\nIt can also mean to behave in a polite and courteous way towards others. For instance: \"I respect what he has accomplished in his life.\".\n\nIt is sometimes used as a synonym for \"like.\" Respect is used more to describe how we hold people or things in high esteem based on their deeds, achievements, or position in society.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3ad93369-2dc4-406e-b587-3ef22d2a896d.webp"
        }
    },
    "videos": [
        {
            "Text": " where the snake is just trying to send a message without actually killing you. You see, venom takes energy and resources for the snake to make, and they don't want to waste it on a warning shot. When it comes to poison, on the other hand, there's no warning shot. If you pick up a poisonous dart frog to admire its beautiful colors,",
            "Title": "Poison vs. venom: What's...",
            "VideoId": "KnJ4_xRfxpA",
            "Controls": "start=44"
        },
        {
            "Text": " we have defined beauty not just as health and youth and symmetry that we're biologically programmed to admire, but also as tall, slender figures, and femininity and white skin. And this is a legacy that was built for me,",
            "Title": "Looks aren't everything....",
            "VideoId": "KM4Xe6Dlp0Y",
            "Controls": "start=177"
        },
        {
            "Text": " To persuade females the come close and admire his plumes, he sings the most complex song he can manage and he does that by copying the songs of all the other birds he hears around him, such as the kookaburra.",
            "Title": "Attenborough: the...",
            "VideoId": "mSB71jNq-yQ",
            "Controls": "start=59"
        },
        {
            "Text": " to platform females to come close and admire his plumes he sings the most complex song he can manage and he does that by copying the songs of all the other birds he hears around him such as the kookaburra",
            "Title": "Sir David Attenborough...",
            "VideoId": "leDm_-nfr2w",
            "Controls": "start=1231"
        },
        {
            "Text": " everything but after her flight she's too occupied in preening to care but her admirer has ways to get himself noticed she sees more subtleties of color than",
            "Title": "Budgie Courtship Ritual...",
            "VideoId": "1g4Kbe8VSI8",
            "Controls": "start=78"
        },
        {
            "Text": " with her warmth and kindness. I admired and respected her for her energy and commitment to others. I hope that tomorrow we can all, wherever we are, join",
            "Title": "Princess Diana's Funeral...",
            "VideoId": "5w0U_igM_hE",
            "Controls": "start=138"
        },
        {
            "Text": " But it's only for a moment. A large crowd has gathered, all trying to adopt the chick. She's soon overwhelmed by doting admirers.",
            "Title": "Penguins Kidnapping...",
            "VideoId": "MLdLyzoj1Uc",
            "Controls": "start=128"
        },
        {
            "Text": " the player who I admired and I respected so much and I learned so much from his games it gave me inspiration and gave me",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=257"
        },
        {
            "Text": " to persuade females to come close and admire his plumes he sings the most complex song he can manage and he does",
            "Title": "10 TOP Natural History...",
            "VideoId": "FeJKJ5MoCHY",
            "Controls": "start=612"
        },
        {
            "Text": " they block the father's path at every turn as his chick gets smothered by admirers there's nothing he can do",
            "Title": "Baby Penguin Escapes...",
            "VideoId": "ZhjEEe5KfcI",
            "Controls": "start=55"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/taylor-swift.webp",
            "Text": "When I look at acting careers that I really admire, I see that it's been a precise decision-making process for these people. They make decisions based on what they love, and they do only the things that they are passionate about. They play only characters that they can't stop thinking about.",
            "Title": "American Singer",
            "Name": "Taylor Swift"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oscar-wilde.webp",
            "Text": "I think it is perfectly natural for any artist to admire intensely and love a young man. It is an incident in the life of almost every artist.",
            "Title": "Irish Poet",
            "Name": "Oscar Wilde"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/francois-de-la-rochefoucauld.webp",
            "Text": "We always love those who admire us, but we do not always love those whom we admire.",
            "Title": "French Writer",
            "Name": "Francois de La Rochefoucauld"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lewis-hamilton.webp",
            "Text": "Ayrton Senna was an incredible legend who will be remembered and admired forever.",
            "Title": "British Driver",
            "Name": "Lewis Hamilton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/antoine-de-saint-exupery.webp",
            "Text": "Tell me who admires and loves you, and I will tell you who you are.",
            "Title": "French Writer",
            "Name": "Antoine de Saint-Exupery"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dwayne-johnson.webp",
            "Text": "The successful men I admired all built their bodies.",
            "Title": "American Actor",
            "Name": "Dwayne Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/blaise-pascal.webp",
            "Text": "You always admire what you really don't understand.",
            "Title": "French Philosopher",
            "Name": "Blaise Pascal"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michel-de-montaigne.webp",
            "Text": "Few men have been admired of their familiars.",
            "Title": "French Philosopher",
            "Name": "Michel de Montaigne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/aeschylus.webp",
            "Text": "He who goes unenvied shall not be admired.",
            "Title": "Greek Poet",
            "Name": "Aeschylus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-barkley.webp",
            "Text": "I respect and admire what cops do.",
            "Title": "American Baseball Player",
            "Name": "Charles Barkley"
        }
    ]
}