{
    "currentWord": {
        "wordRoot": "afford",
        "id": 2851,
        "phonemic": "əˈfɔːd|əˈfɔːrd\r",
        "bigId": "cddcf79e-81de-453c-aa0a-339b9453f3f6",
        "wordForms": [
            "affords",
            "affording",
            "afforded",
            "affordable",
            "afford"
        ]
    },
    "senses": [
        {
            "id": "cddcf79e-81de-453c-aa0a-339b9453f3f6",
            "de": "To have enough money to buy or pay for something",
            "ty": "verb",
            "ex": "I can't afford to buy a new car.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "can't afford",
                " afford to buy",
                " afford to pay"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cddcf79e-81de-453c-aa0a-339b9453f3f6.webp",
            "Tips": [
                {
                    "title": "Financial Capability",
                    "description": "Stress the aspect of having enough resources before making a purchase or commitment.",
                    "example": "Even though it's on sale, I still can't afford that designer jacket.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tr1VINBK9CwPplUyZ1a2R7FuM.webp"
                },
                {
                    "title": "Emotional Stress",
                    "description": "Implies emotional stress or difficulty when saying what you can't buy or do.",
                    "example": "I'd love to join you on vacation, but I just can't afford it right now.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/qHXm2SfvcTZyATRoGSxSYRdtBZk.webp"
                },
                {
                    "title": "Prioritizing Expenses",
                    "description": "Helps in discussing budgeting priorities or financial planning.",
                    "example": "We should prioritize our bills; we can't afford a new TV this month.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/9mWg6VerjAi4t90ZnkKgWp2MY0.webp"
                }
            ]
        },
        {
            "id": "025f3811-fba9-486b-bb03-bc1ea3f2410e",
            "de": "To have enough time or ability for something",
            "ty": "verb",
            "ex": "I can't afford to waste time on this.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "can't afford",
                " afford to waste",
                " afford to miss"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/025f3811-fba9-486b-bb03-bc1ea3f2410e.webp",
            "Tips": [
                {
                    "title": "Time Management",
                    "description": "Highlights the importance of time allocation to activities.",
                    "example": "We can't afford to delay our project submission any longer.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Opportunity Costs",
                    "description": "Mentions what you might need to give up to do something else.",
                    "example": "I can't afford to take a break; I might miss an important call.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ability Implications",
                    "description": "Implies whether something is within one's skill or capability to do.",
                    "example": "Can you afford to edit the video by yourself, or should we hire someone?",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "9db8075b-a125-47df-b34a-3e14a5038bf2",
            "de": "To provide or supply something",
            "ty": "verb",
            "ex": "The forest affords shelter to many animals.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "afford shelter",
                " afford protection",
                " afford comfort"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9db8075b-a125-47df-b34a-3e14a5038bf2.webp",
            "Tips": [
                {
                    "title": "Providing Resources",
                    "description": "Relates to making resources available or accessible.",
                    "example": "Our community center affords a safe space for teens to socialize.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Beyond Money",
                    "description": "Shifts the focus from financial to other forms of provision.",
                    "example": "These thick walls afford us protection from the cold winds.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Availability Indication",
                    "description": "Suggests the presence or availability of something beneficial.",
                    "example": "This program affords children the opportunity to learn a second language.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Allow": {
            "wordRoot": "Allow",
            "wordDefinition": "Allow is used when talking about permission or giving someone the ability to do something. For example, \"My parents allow me to stay out until midnight.\" It means that your parents have given you permission to stay out until a certain time.\n\nAfford is used when talking about having enough money or means to do something, while allow is used when talking about permission or giving someone the ability to do something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4bde3628-7655-4742-a49f-2b4ffd7328d6.webp"
        },
        "Endure": {
            "wordRoot": "Endure",
            "wordDefinition": "Endure means to be able to handle or tolerate a difficult or unpleasant situation. For example, if you are able to withstand the pain of a strenuous workout, you can endure it.\n\nAfford is applicable when you talk about your finances and whether you have enough money to buy something, while endure is applicable when you talk about your ability to tolerate or handle a difficult situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/40ebae8f-7454-4294-90a5-7609b5ce23c3.webp"
        },
        "Grant": {
            "wordRoot": "Grant",
            "wordDefinition": "Grant is used when someone else gives us something either as a favor or as a reward for something we have done.\n\nFor example, a scholarship or a financial aid could be considered a grant because someone else is giving us the money to pay for school.\n\nAfford means having enough money to pay for something on our own, while grant means someone else giving us something (usually money) for a specific purpose.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d9c21956-69ab-4b65-8822-7d50a8da0389.webp"
        },
        "Offer": {
            "wordRoot": "Offer",
            "wordDefinition": "Offer means to present something for someone else to take or accept, such as a proposal, suggestion, or opportunity.\n\nFor example: \"The company is offering a discount on their products.\"\n\nSo, while afford is used to talk about being able to pay for something, offer is used to talk about presenting something for others to take or accept.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5c1e662c-501d-4f76-9c09-a87453c02ada.webp"
        },
        "Permit": {
            "wordRoot": "Permit",
            "wordDefinition": "Permit means that you have permission or allowance to do something. For example, \"My parents permit me to stay up until midnight on weekends.\".\n\nAfford is about money, while permit is about permission.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3b308e0a-6f60-40ad-8907-0913004efaff.webp"
        },
        "Provide": {
            "wordRoot": "Provide",
            "wordDefinition": "Provide means to give or supply something that is needed or wanted. For example, \"The restaurant will provide free water for their customers.\".\n\nAfford is used when talking about having enough money or resources, while provide is used when talking about giving or supplying something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d71cc57f-96fe-4745-96ed-b60c61cf682b.webp"
        },
        "Sustain": {
            "wordRoot": "Sustain",
            "wordDefinition": "Afford refers to the ability to pay for something, whereas sustain refers to the ability to keep something going or maintain it.\n\nFor example, you may be able to afford to buy a new phone, but you need to sustain it by keeping it charged and taking care of it.\n\nIn terms of more serious issues, a community may be able to afford to plant trees, but they need to sustain them by providing consistent care and support.\n\nAfford refers to the ability to initiate something, while sustain refers to the ability to maintain it over time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/daac1394-d0f1-429d-8c42-f41773b09132.webp"
        },
        "Withstand": {
            "wordRoot": "Withstand",
            "wordDefinition": "Withstand means to endure or resist the force or pressure of something. For example, if a building can withstand an earthquake, it means the building can survive the shaking and remain standing without collapsing.\n\nBoth words are applicable in different situations. Afford is used when talking about finances and resources, while withstand is used when talking about strength and durability.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/85e489e9-1c35-442c-abe6-152c8f7d168e.webp"
        }
    },
    "videos": [
        {
            "Text": " and specifically, who in this world is afforded the privilege of being perceived as fully human. Over the course of the past several months, the world has watched as unarmed black men, and women, have had their lives taken at the hands of police and vigilante. These events and all that has transpired after them",
            "Title": "How to raise a Black son...",
            "VideoId": "Us70DN2XSfM",
            "Controls": "start=81"
        },
        {
            "Text": " the liver is an extremely efficient industrial site, performing multiple tasks that support each other. But such a complex system needs to be kept running smoothly by keeping it healthy and not overloading it with more toxins than it can handle. This is one factory we simply can't afford to shut down.",
            "Title": "What does the liver do?...",
            "VideoId": "wbh3SjzydnQ",
            "Controls": "start=169"
        },
        {
            "Text": " were home to every kind of starving artist. It was all they could afford. These painters, writers, and intellectuals, united in their artistic passion and counterculture beliefs, made up France's bohemian subculture. And their works of art, literature, and intellect would shake up the world.",
            "Title": "The poet who painted...",
            "VideoId": "YJ0x1YOuMwQ",
            "Controls": "start=45"
        },
        {
            "Text": " These days, with suitable burial land running out in high-population areas, purchasing private gravesites can be costly, and many people can't afford simple burials. Even cremation, the second most common burial practice in the world, comes with a high cost.",
            "Title": "What happens to our...",
            "VideoId": "mRsa2wb0aTs",
            "Controls": "start=160"
        },
        {
            "Text": " also emphasizes the worldliness of the merchant class, and the pearl itself, a symbol of wealth, is actually an exaggeration. Vermeer couldn't have afforded a real pearl of its size. It was likely just a glass or tin drop varnished to look like a pearl.",
            "Title": "Why is Vermeer's \"Girl...",
            "VideoId": "pM_IzEAv5d4",
            "Controls": "start=196"
        },
        {
            "Text": " an extra pair of hands like a runner who can help me get around and lend a hand with the physical stuff how does the production afford these extra costs working with a researcher in a wheelchair doesn't actually cost the production any more money",
            "Title": "Can you make a wildlife...",
            "VideoId": "y1_m7sDvsFY",
            "Controls": "start=68"
        },
        {
            "Text": " And we just can't afford that missed opportunity, because children with autism become adults with autism. And we feel that those things we can do for these children, for those families, early on, will have lifetime consequences --",
            "Title": "Ami Klin: A new way to...",
            "VideoId": "JcJ3MfJNm6g",
            "Controls": "start=621"
        },
        {
            "Text": " of food may increase so much that the poor may not be able to afford it a hungry child cannot think about anything other than the desire to eat another of my worries is more war and rivalry look at the world around us",
            "Title": "A message from the next...",
            "VideoId": "-QIi_MPo0b0",
            "Controls": "start=279"
        },
        {
            "Text": " sometimes twice a day, when pest pressure is high. But we know that some insecticides are very harmful to human health, especially when farmers and their families cannot afford proper protection, like these children.",
            "Title": "Pamela Ronald: The case...",
            "VideoId": "wZ2TF8-PGQ4",
            "Controls": "start=565"
        },
        {
            "Text": " friendly alternative to the greenhouse gas emissions and pollution of fossil fuels and as advances in technology make renewable energy more accessible affordable and efficient an end to",
            "Title": "Renewable Energy 101 PIPE...",
            "VideoId": "1kUE0BZtTRc",
            "Controls": "start=154"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-crook.webp",
            "Text": "It has been my aim throughout present operations to afford the greatest amount of protection to life and property interests, and troops have been stationed accordingly.",
            "Title": "American Soldier",
            "Name": "George Crook"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/samuel-johnson.webp",
            "Text": "When a man is tired of London, he is tired of life; for there is in London all that life can afford.",
            "Title": "English Writer",
            "Name": "Samuel Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zach-braff.webp",
            "Text": "I always encourage over-tipping if you can afford it because... share the wealth.",
            "Title": "American Actor",
            "Name": "Zach Braff"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-braeden.webp",
            "Text": "Not too many people can afford for the wife to stay home and raise the kids.",
            "Title": "American Actor",
            "Name": "Eric Braeden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/redman.webp",
            "Text": "I definitely want to help the youth, people who can't afford medicine.",
            "Title": "American Musician",
            "Name": "Redman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kay-bailey-hutchison.webp",
            "Text": "We cannot afford to lose the Medicaid funding for low-income women.",
            "Title": "American Politician",
            "Name": "Kay Bailey Hutchison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vikram-bhatt.webp",
            "Text": "You can't afford to be afraid of failure in this business.",
            "Title": "Indian Director",
            "Name": "Vikram Bhatt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jose-andres.webp",
            "Text": "All my life, I've had restaurants that were affordable.",
            "Title": "Spanish Chef",
            "Name": "Jose Andres"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shane-warne.webp",
            "Text": "You can't afford to live your life with regrets.",
            "Title": "Australian Athlete",
            "Name": "Shane Warne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tzipi-livni.webp",
            "Text": "The world cannot afford a nuclear Iran.",
            "Title": "Israeli Politician",
            "Name": "Tzipi Livni"
        }
    ]
}