{
    "currentWord": {
        "wordRoot": "agenda",
        "id": 7812,
        "phonemic": "əˈdʒendə|əˈdʒendə\r",
        "bigId": "45169f1a-fbcb-488e-b05d-04b752cf348c",
        "wordForms": [
            "agendas",
            "agenda"
        ]
    },
    "senses": [
        {
            "id": "45169f1a-fbcb-488e-b05d-04b752cf348c",
            "de": "A list of topics or tasks that need to be done or talked about, typically for a meeting.",
            "ty": "noun",
            "ex": "He wanted to discuss his new business ideas in the next meeting so he added it to the agenda.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "set the agenda",
                " according to the agenda",
                " add to the agenda"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/45169f1a-fbcb-488e-b05d-04b752cf348c.webp",
            "Tips": [
                {
                    "title": "Meeting Context",
                    "description": "Use 'agenda' for the items to be discussed in formal gatherings, such as business or committee meetings.",
                    "example": "Your point will be fifth on tomorrow's meeting agenda.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/o2KsVGHLXxwERUABLyHTHU0Smw.webp"
                },
                {
                    "title": "Preparation Importance",
                    "description": "Knowing the agenda in advance can help participants prepare for the discussions.",
                    "example": "Please review the agenda prior to the conference call.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/U5qlFSKwXGeuW9XkcdICZCmLJgQ.webp"
                },
                {
                    "title": "Action Item",
                    "description": "Agendas often end with 'action items' or tasks that need to be completed after the meeting.",
                    "example": "The meeting agenda included several action items for the team.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/mrqjtTSHuGiBwHUijlWhhd0FnzM.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "b822f41c-d1bb-44df-99bc-bd1aff19384b",
            "de": "A secret objective or set of objectives either personal or collectively agreed upon by a group.",
            "ty": "noun",
            "ex": "Many people believe that the destruction of the old building was not an accident, but part of a larger agenda.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "hidden agenda",
                " political agenda",
                " secret agenda"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b822f41c-d1bb-44df-99bc-bd1aff19384b.webp",
            "Tips": [
                {
                    "title": "Concealed Motives",
                    "description": "'Agenda' suggests a plan or motive that is not revealed openly, often with a negative connotation.",
                    "example": "He seems helpful, but I suspect he has his own agenda.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Political Use",
                    "description": "In politics or business, 'agenda' often refers to a group's goals that might be hidden from the public.",
                    "example": "The candidate was accused of having a hidden agenda.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Figurative Meaning",
                    "description": "Use 'agenda' figuratively to imply that someone's actions are driven by personal goals.",
                    "example": "Despite her friendly facade, she had a competitive agenda.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Calendar": {
            "wordRoot": "Calendar",
            "wordDefinition": "A calendar is a tool used to track dates and events over a period of time, such as days, weeks, or months.\n\nAn agenda is a list of tasks or plans for a specific meeting or event, while a calendar is a tool used to organize and keep track of dates and events over a period of time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/991e8fc3-b747-4944-8183-5debcde662dc.webp"
        },
        "Itinerary": {
            "wordRoot": "Itinerary",
            "wordDefinition": "An itinerary is a schedule of planned activities, events, or places to be visited during a trip or vacation. It provides a detailed plan of when and where each activity will take place and allows travelers to plan their time and make the most of their trip.\n\nAn agenda is applicable to meetings or events where a plan of discussion is needed, while an itinerary is applicable to trips or vacations that require planning and scheduling of activities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e7b9a8b2-916e-4f0e-b419-83adec948252.webp"
        },
        "List": {
            "wordRoot": "List",
            "wordDefinition": "List is a collection of items or things that are enumerated or written down.\n\nIt can be used to organize tasks or make a record of things that need to be done or purchased. For example, a grocery list may include items such as eggs, bread, and milk.\n\nAgenda is usually used in the context of meetings or events while list is a general term that can be used for various purposes such as organizing, keeping track, or reminding oneself of things to do or items to purchase.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b2715178-90a7-45be-8be3-37a2033682e7.webp"
        },
        "Menu": {
            "wordRoot": "Menu",
            "wordDefinition": "Menu refers to a list of available dishes or food items to be ordered in a restaurant or food establishment.\n\nAgenda is related to discussing topics, while menu is related to ordering food.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2c723dcf-87dd-4471-a59b-c44ff6dd7459.webp"
        },
        "Plan": {
            "wordRoot": "Plan",
            "wordDefinition": "A plan is a detailed strategy for achieving a particular goal.\n\nIt's a set of steps or actions that need to be taken to make something happen. You might create a plan for launching a startup, achieving a fitness goal, or renovating your home.\n\nSo, agendas are typically used for organizing meetings or events, while plans are used for organizing projects or achieving goals.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9400d7b7-c746-474a-9b35-7ea1c6436540.webp"
        },
        "Programme": {
            "wordRoot": "Programme",
            "wordDefinition": "A program is a plan of action or a list of events that will take place during an event.\n\nIt is used to inform attendees about what will be happening and when. For example, a music festival may have a program that includes the names of the bands performing, the times they will perform, and any other activities or events happening at the festival.\n\nOverall, while both agenda and program have overlap in their functionality, the former tends to focus on the topics discussed in a meeting while the latter refers more broadly to the events that will take place during an event.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/919d9ae3-dc1f-410e-bd00-e4fe082d4b0e.webp"
        },
        "Schedule": {
            "wordRoot": "Schedule",
            "wordDefinition": "Schedule refers to a timeline of events or appointments that have been planned, with specific times and dates. It is a more structured plan than an agenda.\n\nAn agenda is a list of things that need to be talked about, while a schedule is a planned timeline of events. An agenda is applicable in meetings or personal planning, while a schedule is applicable in events or appointments.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d83185bc-c648-42d4-9464-9bdc1e310654.webp"
        },
        "Timetable": {
            "wordRoot": "Timetable",
            "wordDefinition": "Timetable is a schedule of events or activities with specific times allotted for each one. It is commonly used in a school or transportation setting.\n\nAn agenda is used for outlining topics that need to be covered or discussed, while a timetable is used for scheduling events or activities with specific times.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/53a01b90-0189-4f33-8635-13f89fda3d2c.webp"
        }
    },
    "videos": [
        {
            "Text": " like we needed to know if the story is true okay so that's my efficient you know agenda but what if we inspired by this rabbi talking about Passover created a new dinner that everyone in the world participated in but what does my not funny chunk so don't worry about",
            "Title": "What I learned at...",
            "VideoId": "vdgmV7FyCy0",
            "Controls": "start=478"
        },
        {
            "Text": " This was the focus of our whole lives. This was the only way for me to do good in a world that sits in Satan's lap. And like the rest of my 10 siblings, I believed what I was taught with all my heart, and I pursued Westboro's agenda with a special sort of zeal.",
            "Title": "I grew up in the...",
            "VideoId": "bVV2Zk88beY",
            "Controls": "start=93"
        },
        {
            "Text": " on streets and social media, protesters around the world are challenging the status quo. Protest can thrust issues onto the national or global agenda, it can force out tyrants, it can activate people who have long been on the sidelines of civic life.",
            "Title": "How to turn protest into...",
            "VideoId": "c_g1BMVFcuw",
            "Controls": "start=9"
        },
        {
            "Text": " Part of that is true, there aren't as many prominent women in technology. Here's my problem with that Media tells us every day what's important, by the stories they choose and where they place them; it's called agenda setting.",
            "Title": "Megan Kamerick: Women...",
            "VideoId": "rufeS-lZJg8",
            "Controls": "start=336"
        },
        {
            "Text": " Globalization has been taken to support a neoliberal agenda. It's perceived to be part of an elite agenda rather than something that benefits all. And it needs to be reclaimed on a far more inclusive basis than it is today.",
            "Title": "Why Brexit happened --...",
            "VideoId": "dcwuBo4PvE0",
            "Controls": "start=588"
        },
        {
            "Text": " so what's on the agenda it's all about learning to live in burrows and eating unfamiliar food and eventually they're going to have to learn to catch their own supper in the form of live prairie",
            "Title": "Adorable Baby Animal...",
            "VideoId": "W9zdyytICHU",
            "Controls": "start=145"
        },
        {
            "Text": " places in US waters that are fully protected but yet on land the national parks have been called America's best idea single photograph can move that agenda forward it can really wake people up",
            "Title": "360° Underwater National...",
            "VideoId": "v64KOxKVLVg",
            "Controls": "start=115"
        },
        {
            "Text": " and consider whether lurking variables may be present. Otherwise, we leave ourselves vulnerable to those who would use data to manipulate others and promote their own agendas.",
            "Title": "How statistics can be...",
            "VideoId": "sxYrzzy3cq8",
            "Controls": "start=230"
        },
        {
            "Text": " And he decided human rights is not important enough to include in his agendas, and he did not talk about it. And it scares me.",
            "Title": "What I learned about...",
            "VideoId": "mLzTo-y8Ef0",
            "Controls": "start=453"
        },
        {
            "Text": " And if I hadn't done that, that wasn't on the agenda before. So maybe nothing will happen, but at least the words were said.",
            "Title": "Elon Musk: The future...",
            "VideoId": "zIwLWfaAg-8",
            "Controls": "start=1814"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shakira.webp",
            "Text": "Being raised in a developing country opened my eyes to so much I cannot tolerate. In Colombia, education is sometimes considered a luxury, not a human right. And it's not a priority in the agendas of many leaders.",
            "Title": "Musician",
            "Name": "Shakira"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rush-limbaugh.webp",
            "Text": "I'm not afraid of having an agenda. I do have an agenda. It's a positive agenda.",
            "Title": "American Entertainer",
            "Name": "Rush Limbaugh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cindy-hyde-smith.webp",
            "Text": "I will promote a positive agenda focused on issues important to Mississippians.",
            "Title": "American Politician",
            "Name": "Cindy Hyde-Smith"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ro-khanna.webp",
            "Text": "I have helped shape in the past the Democratic Party's agenda on innovation.",
            "Title": "American Politician",
            "Name": "Ro Khanna"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maxine-waters.webp",
            "Text": "How does he support Clinton's urban agenda? He doesn't know what it is.",
            "Title": "American Politician",
            "Name": "Maxine Waters"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anthony-bennett.webp",
            "Text": "I feel like I'm a nice character, and I don't have my own agenda.",
            "Title": "Canadian Athlete",
            "Name": "Anthony Bennett"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wyck-godfrey.webp",
            "Text": "It's important to push the agenda of hiring women directors.",
            "Title": "American Producer",
            "Name": "Wyck Godfrey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sam-brownback.webp",
            "Text": "I do think there's a lot more we can do on the life agenda.",
            "Title": "American Politician",
            "Name": "Sam Brownback"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-engler.webp",
            "Text": "As governor, I learned the importance of having an agenda.",
            "Title": "American Politician",
            "Name": "John Engler"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jillian-michaels.webp",
            "Text": "My agenda is trying to help people live a better life.",
            "Title": "American Athlete",
            "Name": "Jillian Michaels"
        }
    ]
}