{
    "currentWord": {
        "wordRoot": "anxious",
        "id": 6967,
        "phonemic": "ˈæŋkʃəs|ˈæŋkʃəs\r",
        "bigId": "3a5fa15b-9a5a-4460-913c-aa7f37c8b722",
        "wordForms": [
            "anxiously",
            "anxious"
        ]
    },
    "senses": [
        {
            "id": "3a5fa15b-9a5a-4460-913c-aa7f37c8b722",
            "de": "Feeling worried, nervous, or afraid about something that may happen",
            "ty": "adjective",
            "ex": "She felt anxious about her exams.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "feel anxious",
                " look anxious",
                " become anxious"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3a5fa15b-9a5a-4460-913c-aa7f37c8b722.webp",
            "Tips": [
                {
                    "title": "Negative Emotion",
                    "description": "Use 'anxious' to describe a person who is uneasy about a future event or outcome.",
                    "example": "She was anxious the night before her interview.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/bjnKML4XedyP2fy4FQR3ZOiLQoI.webp"
                },
                {
                    "title": "Intensity Matters",
                    "description": "'Anxious' expresses a stronger feeling than simply being worried or concerned.",
                    "example": "As the hurricane approached, residents grew increasingly anxious.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/58ra27J6bJwN2JkSqwineIUGE3k.webp"
                },
                {
                    "title": "Not Always Visible",
                    "description": "Someone might feel anxious on the inside even if they don't show it outwardly.",
                    "example": "Despite appearing calm, he was actually very anxious about the results.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/d8yHsRP9PA1MjZj88ceBOoCS1k0.webp"
                }
            ]
        },
        {
            "id": "7b540aa3-a7df-4c2f-bd62-39b07a02afa6",
            "de": "Eagerly wanting to do or have something",
            "ty": "adjective",
            "ex": "People are anxious to see the final results.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "anxious to see",
                " anxious to hear",
                " anxious for change"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7b540aa3-a7df-4c2f-bd62-39b07a02afa6.webp",
            "Tips": [
                {
                    "title": "Positive Excitement",
                    "description": "The second meaning of 'anxious' has a positive connotation, implying enthusiasm.",
                    "example": "I'm anxious to start my new job and meet my colleagues.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Future Oriented",
                    "description": "Use 'anxious' to express a strong desire towards a future possibility or event.",
                    "example": "They were anxious to hear the news about the election.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Impatience Implied",
                    "description": "When 'anxious' means eager, it can also include an element of impatience.",
                    "example": "The kids are anxious to open their presents on Christmas morning.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Agitate": {
            "wordRoot": "Agitate",
            "wordDefinition": "Agitate means to disturb or upset someone or something.\n\nFor example, \"the wind agitated the trees.\"\n\nAgitate is a verb used to describe external disturbance or unrest, while anxious is an adjective used to describe internal feelings of uneasiness or worry.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d362e720-5e93-4c5a-8796-b9a5a88174ea.webp"
        },
        "Apprehensive": {
            "wordRoot": "Apprehensive",
            "wordDefinition": "Anxious and apprehensive both mean to feel worried or nervous about something that might happen in the future.\n\nHowever, anxious often refers to a general feeling of unease or worry, while apprehensive tends to be more specific, referring to worry about a particular situation or event.\n\nFor example, you might feel anxious about starting a new school year, but apprehensive about giving a speech in front of your class.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9a0bc347-1ae4-4678-9295-ad56faf0a57c.webp"
        },
        "Fearful": {
            "wordRoot": "Fearful",
            "wordDefinition": "Anxious and fearful are two words that describe feeling scared or worried, but they have slightly different meanings.\n\nFearful means feeling afraid of something that is happening right now, or could happen in the future. For example, you might feel fearful if you see a dangerous animal on a hike, or if you hear about a scary illness that is spreading in your area.\n\nAnxious is a more general feeling of worry or nervousness, while fearful is a more specific feeling of being afraid of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0e4d16c0-bd3e-405e-8239-e9465aa57869.webp"
        },
        "Fretful": {
            "wordRoot": "Fretful",
            "wordDefinition": "Both anxious and fretful mean worried or uneasy, but anxious tends to refer to a more general feeling of unease or nervousness, while fretful implies a more irritable or restless state.\n\nFor example, you might be anxious about an upcoming exam, but you might be fretful if you're trying to get to sleep but can't stop thinking about something that's bothering you.\n\nAnxious is a more common word and can be used in a wider variety of situations, while fretful is usually reserved for situations where there's some kind of persistent, irritating worry or discomfort.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/80433a0b-02f8-4da6-beb9-6a1c35cc31ec.webp"
        },
        "Nervous": {
            "wordRoot": "Nervous",
            "wordDefinition": "Anxious and nervous are two similar words, but they are used in slightly different situations.\n\nNervous usually refers to a feeling of unease related to a specific situation in the present or immediate future. For instance, a person might feel nervous before giving a speech or going on a date.\n\nAnxious describes a general feeling of worry about something that hasn't happened yet, while nervous describes a specific feeling of unease in the present or near future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8081e234-aa06-4fcf-95b2-702d559e11f4.webp"
        },
        "Panicky": {
            "wordRoot": "Panicky",
            "wordDefinition": "Anxious refers to feeling worried or uneasy about something, while panicky refers to feeling extreme fear or terror. Anxious is applicable in situations where someone is worried or concerned about something, while panicky is applicable in situations where someone feels absolutely terrified and may have difficulty breathing or acting rationally.\n\nAnxious is generally a milder term, while panicky implies a more intense and immediate emotional response.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f0881c42-7182-4c6b-a5e5-7bd369677725.webp"
        },
        "Restless": {
            "wordRoot": "Restless",
            "wordDefinition": "It is often used to describe feelings of unease or fear. Restless means not able to relax or sit still because of feeling too much energy or excitement.\n\nAnxiety is a mental state that can be caused by many things like stress, fear, or worry. Restlessness is a physical state that can be caused by boredom, excitement, or a need to move.\n\nAnxious describes a feeling of worry, while restless describes a feeling of wanting to move or do something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e1be1fa9-2e7f-49fe-a117-e4f200a65b6f.webp"
        },
        "Tense": {
            "wordRoot": "Tense",
            "wordDefinition": "Tense means to feel physically or emotionally tight, like your muscles are contracted. For example, you might feel tense before a sports game because you are physically preparing yourself for the challenge.\n\nSo, while both words relate to feelings of unease or discomfort, anxious is more related to mental stress while tense is more related to physical stress.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/86a0fa1f-5cf4-4b3b-9627-3f8fa33831f1.webp"
        },
        "Uneasy": {
            "wordRoot": "Uneasy",
            "wordDefinition": "Both anxious and uneasy mean that a person is feeling worried or afraid, but anxious usually refers to a feeling of fear or apprehension about something in the future, whereas uneasy usually refers to a general feeling of discomfort or concern, usually without a specific cause.\n\nFor example, you might feel anxious about an upcoming test or presentation because you're worried about how it will go, while feeling uneasy could describe a feeling of discomfort or unease you have around a particular person, or a sense of unease you feel in a new or unfamiliar situation.\n\nAnxious is more specific to a particular situation, while uneasy is more general and can describe a range of uncomfortable feelings or situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/54ef312f-d6e7-4053-9deb-cfed5a565cac.webp"
        },
        "Worry": {
            "wordRoot": "Worry",
            "wordDefinition": "Anxious is the feeling of nervousness, fear, or worry about something that may happen in the future. It is an internal feeling that causes physical symptoms like restlessness, sweating, or a racing heart.\n\nWorry means thinking about problems or concerns. It is something that we do with our minds, and it is often focused on things that are happening right now.\n\nWorrying can also cause physical symptoms, like headaches or stomachaches.\n\nAnxious is a feeling, while worry is an action. We feel anxious when we are worried about something that may happen in the future, and we worry when we think about events that are happening right now.\n\nBoth can be applicable in different situations, but anxiety is usually a more intense feeling than worry.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/86eb0be5-fea9-45fc-be9b-a6b9a56ee441.webp"
        }
    },
    "videos": [
        {
            "Text": " They're doing poorly in math because they're anxious about it. Some psychologists think that's because math anxiety decreases a cognitive resource called working memory. That's the short-term memory system that helps you organize the information you need to complete a task. Worrying about being able to solve math problems,",
            "Title": "Why do people get so...",
            "VideoId": "7snnRaC4t5c",
            "Controls": "start=57"
        },
        {
            "Text": " I'm kidding. And I've got malingering. And I think it's actually quite rare to have both malingering and generalized anxiety disorder, because malingering tends to make me feel very anxious. Anyway, I was looking through this book, wondering if I was much crazier than I thought I was,",
            "Title": "Strange answers to the...",
            "VideoId": "xYemnKEKx0c",
            "Controls": "start=75"
        },
        {
            "Text": " and a coldness. And then I was back, drowsy and disoriented, but definitely there. Now, when you wake from a deep sleep, you might feel confused about the time or anxious about oversleeping, but there's always a basic sense of time having passed, of a continuity between then and now.",
            "Title": "Your brain hallucinates...",
            "VideoId": "lyu7v7nWzfo",
            "Controls": "start=23"
        },
        {
            "Text": " It's getting more oxygen to your brain. And participants who learned to view the stress response as helpful for their performance, well, they were less stressed out, less anxious, more confident, but the most fascinating finding to me was how their physical stress response changed.",
            "Title": "How to make stress your...",
            "VideoId": "RcGyVTAoXEU",
            "Controls": "start=336"
        },
        {
            "Text": " but there is one thing the entire world does agree on there has to be a way to solve the Rubik's Cube oh well we came up with this has to be the geek geek of all I have never finished a Rubik's Cube in my life never didn't master this thing they make me incredibly anxious",
            "Title": "Solving the Rubik's Cube...",
            "VideoId": "MIejkn807NI",
            "Controls": "start=1"
        },
        {
            "Text": " I felt anxious and adrift. And I wasn't alone; my friends -- they struggled with this, too. Eventually, I decided to go to graduate school for positive psychology to learn what truly makes people happy. But what I discovered there changed my life.",
            "Title": "There's more to life...",
            "VideoId": "y9Trdafp83U",
            "Controls": "start=29"
        },
        {
            "Text": " and she said you're angry you're depressed you're anxious and she wanted to help me so she looked at me and said if there was anything in the world that you could do what would you do and I told her I'd start a dance company she's",
            "Title": "Healing war wounds...",
            "VideoId": "hwEL0IsRe_0",
            "Controls": "start=144"
        },
        {
            "Text": " chocolate, caffeine pills, and even beverages labeled decaf. Caffeine helps us feel alert, focused, happy, and energetic, even if we haven't had enough sleep. But it can also raise our blood pressure, and make us feel anxious.",
            "Title": "How does caffeine keep...",
            "VideoId": "foLf5Bi9qXs",
            "Controls": "start=21"
        },
        {
            "Text": " Firstly, the more you believe you can buy and display your way out of sadness, and into a good life, the more likely you are to become depressed and anxious. And secondly,",
            "Title": "This could be why you're...",
            "VideoId": "MB5IX-np5fE",
            "Controls": "start=881"
        },
        {
            "Text": " this is a big moment in their young lives exposed to the perils of life outside but an exciting one although it's an anxious time for",
            "Title": "Are Badgers the Cleanest...",
            "VideoId": "0LHi9CyLvxE",
            "Controls": "start=142"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-reilly.webp",
            "Text": "Being a father has fulfilled me in parts of my life that sustain me. It gives me a comfort and patience. All actors have this hole inside that they're trying to fill by performing. I'm anxious to keep creating, but I'm not so desperate any more because I have the love and support of my kids and wife.",
            "Title": "American Actor",
            "Name": "John C. Reilly"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gaby-hoffmann.webp",
            "Text": "I was anxious before I decided to go back to acting about what I wanted to do with my life. Once I realized I was sort of interested in acting, I've been pretty lucky and had all these great parts. And I feel pretty much like, 'What will happen will happen.",
            "Title": "American Actress",
            "Name": "Gaby Hoffmann"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/patrisse-cullors.webp",
            "Text": "Generations of black women have anxiously watched as our children walk out into a world set against them. We teach them how to respond to police and how to react to racist comments, knowing that these lessons are not guaranteed to protect our children.",
            "Title": "American Activist",
            "Name": "Patrisse Cullors"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joyce-meyer.webp",
            "Text": "Dread, which is closely related to fear, steals the ability to enjoy ordinary life and makes people anxious about the future. It keeps them from looking forward to the next day, the next month, or the next decade.",
            "Title": "American Author",
            "Name": "Joyce Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jessica-barden.webp",
            "Text": "There isn't a right or wrong way to be depressed, anxious, or struggle with PTSD. Mental health challenges manifest differently for different people, and it's important that people see that on-screen.",
            "Title": "English Actress",
            "Name": "Jessica Barden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/katarina-johnson-thompson.webp",
            "Text": "I always have a book that I write during competition. I need it with me, just to read back and reflect and look forward. If I'm feeling anxious, it helps me.",
            "Title": "English Athlete",
            "Name": "Katarina Johnson-Thompson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/francesca-annis.webp",
            "Text": "The minute anyone's getting anxious I say, You must eat and you must sleep. They're the two vital elements for a healthy life.",
            "Title": "English Actress",
            "Name": "Francesca Annis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benjamin-disraeli.webp",
            "Text": "Something unpleasant is coming when men are anxious to tell the truth.",
            "Title": "British Statesman",
            "Name": "Benjamin Disraeli"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/karen-kilgariff.webp",
            "Text": "We all feel anxious at times and acknowledging that only helps.",
            "Title": "American Writer",
            "Name": "Karen Kilgariff"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/enrique-iglesias.webp",
            "Text": "Being anxious is the worst feeling in the world.",
            "Title": "Spanish Musician",
            "Name": "Enrique Iglesias"
        }
    ]
}