{
    "currentWord": {
        "wordRoot": "arrive",
        "id": 10365,
        "phonemic": "əˈraɪv|əˈraɪv\r",
        "bigId": "b457baa8-6bc0-4d2e-9614-881ebb2a7ac7",
        "wordForms": [
            "arrives",
            "arriving",
            "arrived",
            "arrive"
        ]
    },
    "senses": [
        {
            "id": "b457baa8-6bc0-4d2e-9614-881ebb2a7ac7",
            "de": "To reach a place, usually at the end of a trip.",
            "ty": "verb",
            "ex": "I arrived at the school early in the morning.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "arrive late",
                "arrive early",
                "arrive on time"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b457baa8-6bc0-4d2e-9614-881ebb2a7ac7.webp",
            "Tips": [
                {
                    "title": "Journey's End",
                    "description": "Use 'arrive' to describe the moment someone or something reaches the final destination after traveling.",
                    "example": "We finally arrived at the hotel after a long flight.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ULwUK81e9D1IFW0Ywp7hx58E.webp"
                },
                {
                    "title": "Specific Location",
                    "description": "'Arrive' is often followed by a specific place, like 'at the station' or 'in New York'.",
                    "example": "She arrived at the airport in time for her flight.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/OLiOgdQqkHGGChrlkMFlFYcZs.webp"
                },
                {
                    "title": "Time Reference",
                    "description": "Pair 'arrive' with a time expression to indicate when the arrival happened.",
                    "example": "They arrived just before dinner.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/8fvcFtcWk1WkjjS9oRic5K3CSw.webp"
                }
            ]
        },
        {
            "id": "4412d0f2-a9e3-4a77-b9dd-364eb32c8286",
            "de": "To succeed in a particular situation or place.",
            "ty": "verb",
            "ex": "He arrived in the music industry after years of hard work.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "arrive in the industry",
                "arrive at the top",
                "arrive in the scene"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4412d0f2-a9e3-4a77-b9dd-364eb32c8286.webp",
            "Tips": [
                {
                    "title": "Career Milestone",
                    "description": "Use 'arrive' to talk about reaching an important stage in professional or personal growth.",
                    "example": "After years of training, she has finally arrived as a principal dancer.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Highlight Success",
                    "description": "When some professional becomes well-known, saying they 'have arrived' implies notable success.",
                    "example": "The author has arrived in the literary world with his bestselling novel.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Metaphorical Use",
                    "description": "The word can also be used metaphorically to mean becoming successful or gaining acceptance.",
                    "example": "He didn't just arrive in comedy; he reinvented it.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "578080d3-ae02-4de6-95ae-cf38a6db570c",
            "de": "To be given or sent to someone, usually by post or delivery.",
            "ty": "verb",
            "ex": "The package arrived in the morning.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "arrive in the post",
                "arrive by mail",
                "arrive by delivery"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/578080d3-ae02-4de6-95ae-cf38a6db570c.webp",
            "Tips": [
                {
                    "title": "Receiving Items",
                    "description": "When something is delivered, use 'arrive' to express that it has been received.",
                    "example": "Has the gift you ordered online arrived yet?\r",
                    "imageUrl": ""
                },
                {
                    "title": "Passive Construction",
                    "description": "In sentences about mail delivery, 'arrive' is commonly used in passive voice.",
                    "example": "The invitations were arrived late due to the postal strike.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Anticipation",
                    "description": "Use 'arrive' to describe something awaited with excitement or importance.",
                    "example": "The moment we had all been waiting for arrived—the concert started!",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Attain": {
            "wordRoot": "Attain",
            "wordDefinition": "Attain means to achieve or reach a goal through effort or skill.\n\nIt is often used in the context of personal or professional achievement. For example, one might say \"I attained my goal of graduating with honors\" or \"I hope to attain a leadership position in my company.\".\n\nArrive describes reaching a physical destination, while attain describes reaching a personal or professional goal through effort or skill.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a76e45b6-6772-40a8-b731-21c122c2a6cc.webp"
        },
        "Come": {
            "wordRoot": "Come",
            "wordDefinition": "Come is used when someone moves from one place to another to join another person or group. For example, if you are inviting a friend over to your house, you can say \"Come over to my house\".\n\nArrive is used when someone reaches a destination and come is used when someone moves towards another person or group.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bd858fea-700c-4abc-b217-c4480d4d7af0.webp"
        },
        "Enter": {
            "wordRoot": "Enter",
            "wordDefinition": "Enter typically refers to moving through a physical entrance or doorway to access a new space, such as a room or a building.\n\nFor example, if someone leaves their home and enters a store, they have moved through the store's entrance to access the interior space.\n\nArrive is used when referring to reaching a destination, whereas enter is used when referring to moving through a doorway or entrance to access a new space.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0819faf2-e1b5-4c2c-9d6c-3bd05e693b55.webp"
        },
        "Hit": {
            "wordRoot": "Hit",
            "wordDefinition": "Hit can have a few different meanings, but generally refers to making contact with something forcefully.\n\nWe might use it when talking about hitting a baseball, or hitting a curb while driving.\n\nArrive is used more to talk about reaching a destination or goal, while hit is used more to talk about making contact with something forcefully.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/308aae1f-a027-4b65-92ad-461aa838ed77.webp"
        },
        "Land": {
            "wordRoot": "Land",
            "wordDefinition": "Arrive means to reach a destination, while land specifically refers to arriving by airplane or spacecraft at an airport or spacecraft landing site.\n\nFor example, you could arrive at a friend's house, a hotel, or a restaurant. But you would only say a plane or a spacecraft 'landed' at an airport or landing site.\n\nArrive is a more general term, while land is more specific to transportation arrival by plane or spacecraft.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/78693938-538f-42f0-b628-a8d9b62fc783.webp"
        },
        "Make it": {
            "wordRoot": "Make it",
            "wordDefinition": "Make it can have a few different meanings, but typically it means to successfully accomplish something or to arrive somewhere despite challenges or obstacles.\n\nFor example, if you have a job interview at 10am and you arrive on time, you can say \"I made it to my interview on time!\" It can also mean to attend an event or social gathering.\n\nFor example, if your friend invites you to a party and you show up, they might say \"You made it!\"\n\nArrive refers specifically to reaching a destination, while make it can refer to successfully accomplishing something, overcoming obstacles, or attending an event.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/481bcf24-24b5-4465-98d3-e6635059edab.webp"
        },
        "Pull in": {
            "wordRoot": "Pull in",
            "wordDefinition": "Arrive means to reach a destination, while pull in means to enter a specific spot or area.\n\nArrive can be used for any situation where someone reaches a destination like arriving at a friend's house or arriving at a vacation spot.\n\nPull in is used when the person or thing arrives at a specific spot or area, like pulling into a parking space or pulling into a harbor with a boat.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/813f018a-bacb-4d4d-9c51-1ac22bb40e12.webp"
        },
        "Reach": {
            "wordRoot": "Reach",
            "wordDefinition": "Both arrive and reach refer to the act of reaching a destination.\n\nHowever, arrive means specifically to reach the end of a journey or to reach a destination that you have been planning to go to.\n\nReach on the other hand means to arrive at a place, goal or destination which could be physical or metaphorical. For example, when you reach for something, you are extending your arm to grab it.\n\nWhen you reach a goal in a video game or a sport, you have successfully accomplished something.\n\nThe main difference is that arrive is more specific to arriving at a planned destination, while reach is more general and can be applied to different contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/06f7c490-d09c-4f45-b475-7c3aaa985aef.webp"
        }
    },
    "videos": [
        {
            "Text": " But because the skin does not fully recover, scarring continues to be a major clinical issue for doctors around the world. And even though researchers have made significant strides in understanding the healing process, many fundamental mysteries remain unresolved. For instance, do fibroblast cells arrive from the blood vessels",
            "Title": "How a wound heals itself...",
            "VideoId": "TLVwELDMDWs",
            "Controls": "start=186"
        },
        {
            "Text": " would earn a spot on the zodiac calendar in the order they arrived. The rat rose with the sun to get an early start, but on the way to the river, he met the horse, the tiger, and the ox. Because the rat was small and couldn't swim very well, he asked the bigger animals for help. While the tiger and horse refused,",
            "Title": "The myth behind the...",
            "VideoId": "may2s9j4RLk",
            "Controls": "start=41"
        },
        {
            "Text": " Most importantly, everyone must be safely across before the zombies arrive. Otherwise, the first zombie could step on the bridge while people are still on it. Finally, there are no tricks to use here. You can't swing across, use the bridge as a raft,",
            "Title": "Can you solve the bridge...",
            "VideoId": "7yDmGnA8Hw0",
            "Controls": "start=98"
        },
        {
            "Text": " When raiders were sighted, fire and smoke signals traveled between towers until reinforcements arrived. Small openings along the wall let archers fire on invaders, while larger ones were used to drop stones and more.",
            "Title": "What makes the Great...",
            "VideoId": "23oHqNEqRyo",
            "Controls": "start=136"
        },
        {
            "Text": " hopeful I was feeling like things might work out and as I was leaving another writer arrived this writer recognized me from when I was a child and he said are you so and so's daughter and I replied yes",
            "Title": "How to deal with...",
            "VideoId": "v4P2Qwh1QCU",
            "Controls": "start=82"
        },
        {
            "Text": " They sustain themselves by consuming the life force of a living creature. This shared trait is what defines a vampire -- all the other attributes change with the tides. So, how do we arrive",
            "Title": "Vampires: Folklore,...",
            "VideoId": "_0ThKRmySoU",
            "Controls": "start=112"
        },
        {
            "Text": " heads moment of truth has arrived unfazed he keeps dancing while all around him the others to come to the phrasing slowly the neurotoxic venom is turning",
            "Title": "Could You Pass the...",
            "VideoId": "XwvIFO9srUw",
            "Controls": "start=169"
        },
        {
            "Text": " The main question that I've been asked since I arrived at this conference when I said I would talk about infidelity is, for or against? I said, \"Yes.\"",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=1218"
        },
        {
            "Text": " Even wasps must abandon their homes when the ants arrive. Everything alive in the path of the raiders overwhelmed by sheer numbers.",
            "Title": "Army Ants Rampage...",
            "VideoId": "JsfiUR0ZzLw",
            "Controls": "start=201"
        },
        {
            "Text": " yet another hunter arrives it's one from the deep a humboldt squid",
            "Title": "What's Hiding in the...",
            "VideoId": "TDNrM0Nt1Q0",
            "Controls": "start=48"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jazz-jennings.webp",
            "Text": "I always say I want to leave this world in a better state than when I arrived, and I continue to live by that message. So I'm going to do what I can to make the world a better place but also just make sure that I'm happy as well.",
            "Title": "American Activist",
            "Name": "Jazz Jennings"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-wayne.webp",
            "Text": "Tomorrow is the most important thing in life. Comes into us at midnight very clean. It's perfect when it arrives and it puts itself in our hands. It hopes we've learned something from yesterday.",
            "Title": "American Actor",
            "Name": "John Wayne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jimmy-barnes.webp",
            "Text": "There are new children arriving and trying to reach our lucky country every day, and I hope that we can all work together to help them find their dream, too.",
            "Title": "Scottish Musician",
            "Name": "Jimmy Barnes"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/antonio-conte.webp",
            "Text": "It's important for the coach when you arrive to understand the players and to understand every single player's strength and their weakness.",
            "Title": "Italian Coach",
            "Name": "Antonio Conte"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anais-nin.webp",
            "Text": "Each friend represents a world in us, a world not born until they arrive, and it is only by this meeting that a new world is born.",
            "Title": "American Author",
            "Name": "Anais Nin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-walton.webp",
            "Text": "Since I arrived at CNN, it has grown into one of the largest and most trusted news organizations in the world.",
            "Title": "American Businessman",
            "Name": "Jim Walton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-bailly.webp",
            "Text": "Being a young player arriving at a big club is great. It's something that really helps me on the way.",
            "Title": "",
            "Name": "Eric Bailly"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeanne-moreau.webp",
            "Text": "To give a character life in a short space of time, it helps if you arrive on screen with a past.",
            "Title": "French Actress",
            "Name": "Jeanne Moreau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/edwin-louis-cole.webp",
            "Text": "Life is lived on levels and arrived at in stages.",
            "Title": "American Author",
            "Name": "Edwin Louis Cole"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-armour.webp",
            "Text": "Until Eve arrived, this was a man's world.",
            "Title": "American Poet",
            "Name": "Richard Armour"
        }
    ]
}