{
    "currentWord": {
        "wordRoot": "ascertain",
        "id": 10447,
        "phonemic": "ˌæsəˈteɪn|ˌæsərˈteɪn\r",
        "bigId": "3e448acf-014c-4480-b2f6-46e0e87554ed",
        "wordForms": [
            "ascertains",
            "ascertaining",
            "ascertained",
            "ascertainment",
            "ascertainable",
            "ascertain"
        ]
    },
    "senses": [
        {
            "id": "3e448acf-014c-4480-b2f6-46e0e87554ed",
            "de": "To find out something for sure",
            "ty": "verb",
            "ex": "The police is trying to ascertain the truth about the incident.",
            "use": "",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "ascertain the truth",
                " ascertain the cause",
                " ascertain the identity"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3e448acf-014c-4480-b2f6-46e0e87554ed.webp",
            "Tips": [
                {
                    "title": "Investigative Context",
                    "description": "Used when exploring or investigating an issue or fact, like a detective seeking answers.",
                    "example": "The researcher will ascertain if the data supports the hypothesis.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tWvWz6shcNg6A65zCoqN69L2jzs.webp"
                },
                {
                    "title": "Neutral Tone",
                    "description": "Conveys no emotion; it's used for stating facts or findings objectively.",
                    "example": "The audit will ascertain the company's financial health.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/IM241gbSsMeMtllmj3UZPAi4E.webp"
                },
                {
                    "title": "Formal Expression",
                    "description": "Appropriate for formal writing or speaking, not casual conversations.",
                    "example": "We must ascertain the event's success through participant feedback.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Kr8p558cjIVWcwWpJCKE5HgdOk.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "d38c6d94-9f90-452f-b5f8-02306f269229",
            "de": "To make certain of something",
            "ty": "verb",
            "ex": "You should ascertain that the information is correct before sharing it.",
            "use": "",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "ascertain the authenticity",
                " ascertain the accuracy",
                " ascertain the validity"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d38c6d94-9f90-452f-b5f8-02306f269229.webp",
            "Tips": [
                {
                    "title": "Double Checking",
                    "description": "Suggests verifying or confirming information that may already be known or assumed.",
                    "example": "Please ascertain the guests have all RSVP'd before ordering the catering.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Responsibility",
                    "description": "Carries an implied duty to verify something carefully and responsibly.",
                    "example": "It's the manager's job to ascertain that all safety protocols are followed.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Pre-Action Check",
                    "description": "Done before making decisions or taking action to ensure correctness.",
                    "example": "Ascertain the accuracy of the report before presenting to the board.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Confirm": {
            "wordRoot": "Confirm",
            "wordDefinition": "Ascertain means to find out for sure, to determine or discover, whereas confirm means to verify or make certain something that was previously uncertain.\n\nOnce you have this information, you could then confirm the opening hours by double-checking them with the store.\n\nAscertain is more often used when trying to discover or figure something out, whereas confirm is used to affirm or validate something that is already known or suspected.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/60a1350a-9353-40cd-a11e-833b106b8e3a.webp"
        },
        "Determine": {
            "wordRoot": "Determine",
            "wordDefinition": "The words ascertain and determine have similar meanings, but differ slightly in their usage.\n\nTo determine means to come to a decision or conclusion after careful thought or investigation. For example, you might determine the best course of action after considering all the available information.\n\nAscertain is used to make sure of something, while determine is used to make a decision or reach a conclusion.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7bb3c1d7-4dc7-4a4a-9a95-c1c82766d7be.webp"
        },
        "Discover": {
            "wordRoot": "Discover",
            "wordDefinition": "Discover is used when we find something that we didn't know existed or were unaware of. It means to come across something by chance or accident.\n\nFor example, a scientist might discover a new species in a remote forest that no one knew existed before.\n\nIn simpler terms, you use ascertain when you want to prove or confirm something, and discover when you want to find something new that was previously unknown.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a95ab5df-8670-45e2-9fd7-8f4b1653f48c.webp"
        },
        "Establish": {
            "wordRoot": "Establish",
            "wordDefinition": "Establish means to create, build, or set up something. It implies that there is a need to create a new entity or situation.\n\nFor example, you might establish a new business by creating a business plan, finding investors, and putting all the necessary resources together.\n\nAscertain is used when you want to find out or verify something that already exists, whereas establish is used when you want to create or set up something new.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/49b0e5d3-7211-4c60-98ff-c034701baeab.webp"
        },
        "Find out": {
            "wordRoot": "Find out",
            "wordDefinition": "Find out means to discover something, often through asking questions, researching or simply stumbling upon it. It is more commonly used in everyday language and informal situations.\n\nExample: I need to find out what time the movie starts.\n\nAscertain implies a methodical and deliberate approach to uncovering information, whereas find out can be accidental or informal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1ad21727-82af-44eb-8bed-727189f46baf.webp"
        },
        "Identify": {
            "wordRoot": "Identify",
            "wordDefinition": "Identify means to recognize or establish the particular characteristics, qualities or identity of something or someone.\n\nIt is often used to describe the act of recognizing or naming someone or something that is already known. For example, you might identify a friend from a distance by recognizing their face or clothing.\n\nIn simpler terms, ascertain means to find out something you don't know, while identify means to recognize something you already know.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d9232bce-3681-4269-a981-ea83ff23904c.webp"
        },
        "Learn": {
            "wordRoot": "Learn",
            "wordDefinition": "'Ascertaining' refers to finding out something with complete certainty or confirming a fact, while 'learning' refers to acquiring knowledge about a subject or skill.\n\nYou would use learn if you were studying for a test or trying to gain knowledge about a particular subject - you might say you learned a lot about biology after reading a textbook or attending lectures.\n\nAscertain is more about confirming existing facts, while 'learning' is about acquiring new knowledge.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0598e34c-6350-4a72-a6af-1e398a321971.webp"
        },
        "Verify": {
            "wordRoot": "Verify",
            "wordDefinition": "Verify on the other hand, means to confirm the truth, accuracy, or validity of something. It's often used when you have a claim or statement, and you want to make sure it's true.\n\nFor example, if someone tells you that they received an award, you might verify this by checking with a trusted source or seeing the award certificate yourself.\n\nAscertain is used to learn or discover new information, while verify is used to confirm or validate existing information.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7ace7617-c006-447b-ade7-4680f89ecc15.webp"
        }
    },
    "videos": [
        {
            "Text": " extra components that can be shipped for very little cost across the world, and that's what is all required with a little bit of local tinkering talent to convert the device into something else. So we are right now doing some systematic field tests to basically ascertain whether something like this actually",
            "Title": "Vinay Venkatraman:...",
            "VideoId": "g_3iLapiTCw",
            "Controls": "start=765"
        },
        {
            "Text": " So therefore, if we were to do this, what we'd need to do is sequence that region in all these different mammals and ascertain if it's the same or if it's different. So if it is the same, this indicates that that site is important for a function, so a disease mutation should fall within that site.",
            "Title": "Emma Teeling: The secret...",
            "VideoId": "GROCkg810R0",
            "Controls": "start=616"
        },
        {
            "Text": " So he brought it back. And the kid was drinking it, and a security guard spotted it, and called the police, who called an ambulance that rushed to the ballpark, whisked the kid to the hospital. The emergency room ascertained that the kid had no alcohol in his blood.",
            "Title": "Barry Schwartz: Our loss...",
            "VideoId": "lA-zdh_bQBo",
            "Controls": "start=379"
        },
        {
            "Text": " is going to be very data-driven, and it's going to be based on the information that we ascertain from taste communities online, where women are really driving the action. So you may be asking, well why is it important that I know what entertains people?",
            "Title": "Johanna Blakley: Social...",
            "VideoId": "ZR4LdnFGzPk",
            "Controls": "start=408"
        },
        {
            "Text": " you're making the first approach to a newly discovered planet. You've used various techniques to ascertain that this world supports an astonishing variety of lifeforms. You want to make contact, but not with their version of a scorpion,",
            "Title": "Shadows of Forgotten...",
            "VideoId": "4xiAQIL0GyI",
            "Controls": "start=166"
        },
        {
            "Text": " species taxa so therefore if we were to do this want me to do with sequence that region in all these different mammals and ascertain if it's the same or if it's different so if it is the same this indicates that that site is important",
            "Title": "The secret of the bat...",
            "VideoId": "D5yCT5DMXO0",
            "Controls": "start=617"
        },
        {
            "Text": " they can find on a few occasions they find one that horse will then be put through a rigorous month-long physical and mental assessment to ascertain if they do indeed have the right stuff one of the things we look for when we",
            "Title": "Police Horse Training PIPE...",
            "VideoId": "phXXvbSLidU",
            "Controls": "start=27"
        },
        {
            "Text": " in my dad's big easy chair, you know? So, three types of vision, right? Vision based on what one cannot see, the vision of that unseen and unknowable. The vision of that which has already been proven or can be ascertained.",
            "Title": "Scott McCloud:...",
            "VideoId": "fXYckRgsdjI",
            "Controls": "start=308"
        },
        {
            "Text": " kid to the hospital the emergency room to ascertain that the kid had no alcohol in his blood and they were ready to let the kid go but not so fast the Wayne County Child Welfare protective agency said",
            "Title": "Our loss of wisdom -...",
            "VideoId": "VYu0kMCxFEE",
            "Controls": "start=392"
        },
        {
            "Text": " more than good training to help ascertain if this is the case dr. Debbie Marsden has devised a test to measure",
            "Title": "Can a Horse Really Be...",
            "VideoId": "1xLJ0nso61A",
            "Controls": "start=9"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sebastian-horsley.webp",
            "Text": "My theory is that the way you cope with the depths will ascertain the heights that you reach - they are intimately connected - and if you have a lust for life, you are also going to have a lust for death.",
            "Title": "British Artist",
            "Name": "Sebastian Horsley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/fritz-zwicky.webp",
            "Text": "I soon became convinced... that all the theorizing would be empty brain exercise and therefore a waste of time unless one first ascertained what the population of the universe really consists of.",
            "Title": "Swiss Scientist",
            "Name": "Fritz Zwicky"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/walter-cronkite.webp",
            "Text": "Court proceedings, except for certain limited situations, are open to the public. This is for the protection of the accused, to be certain to ascertain that there is a fair trial.",
            "Title": "American Journalist",
            "Name": "Walter Cronkite"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-muller.webp",
            "Text": "How important it is to ascertain the will of God, before we undertake anything, because we are then not only blessed in our own souls, but also the work of our hands will prosper.",
            "Title": "English Clergyman",
            "Name": "George Muller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benedict-samuel.webp",
            "Text": "When you have quick scenes, it becomes difficult to ascertain where your character fits and where they're going. I always enjoy scenes that have a movement to them.",
            "Title": "Australian Actor",
            "Name": "Benedict Samuel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-madison.webp",
            "Text": "Whenever a youth is ascertained to possess talents meriting an education which his parents cannot afford, he should be carried forward at the public expense.",
            "Title": "American President",
            "Name": "James Madison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frances-wright.webp",
            "Text": "Instead of establishing facts, we have to overthrow errors; instead of ascertaining what is, we have to chase from our imaginations what is not.",
            "Title": "Scottish Writer",
            "Name": "Frances Wright"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-green-ingersoll.webp",
            "Text": "A great man does not seek applause or place; he seeks for truth; he seeks the road to happiness, and what he ascertains, he gives to others.",
            "Title": "American Lawyer",
            "Name": "Robert Green Ingersoll"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-bernard-shaw.webp",
            "Text": "What a man believes may be ascertained, not from his creed, but from the assumptions on which he habitually acts.",
            "Title": "Irish Playwright",
            "Name": "George Bernard Shaw"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/adam-clarke.webp",
            "Text": "Whether the family of the Clarkes were of Norman extraction cannot be easily ascertained.",
            "Title": "British Theologian",
            "Name": "Adam Clarke"
        }
    ]
}