{
    "currentWord": {
        "wordRoot": "association",
        "id": 1038,
        "phonemic": "əˌsəʊʃiˈeɪʃn|əˌsəʊsiˈeɪʃn\r",
        "bigId": "c54148ba-af1d-467e-ae47-181c288af7f7",
        "wordForms": [
            "associations",
            "association"
        ]
    },
    "senses": [
        {
            "id": "c54148ba-af1d-467e-ae47-181c288af7f7",
            "de": "A group of people who share similar aims or interests and come together to work towards them",
            "ty": "noun",
            "ex": "John joined the local tennis association.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "join an association",
                " establish an association",
                " local association"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c54148ba-af1d-467e-ae47-181c288af7f7.webp",
            "Tips": [
                {
                    "title": "Purpose Driven",
                    "description": "Associations are formed for specific purposes; they're not just casual groups.",
                    "example": "She founded an association for renewable energy advocacy.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oU4uex1M2eYVMrwmjBIj4J8IQ.webp"
                },
                {
                    "title": "Shared Interests",
                    "description": "Members usually share common goals or hobbies which drive the association's activities.",
                    "example": "He's in an association for bird watchers.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/4piAmJXTYAUprhpISjAg5QBoik.webp"
                },
                {
                    "title": "Formal Structure",
                    "description": "An association often has a structured organization with roles like president or treasurer.",
                    "example": "She was elected treasurer of the association.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/r0McGep4ztK7Wg5ruCGLmhCH3g.webp"
                }
            ]
        },
        {
            "id": "6421bd44-5b29-4b8c-bef4-06c9fe1abb63",
            "de": "A mental connection between ideas or things",
            "ty": "noun",
            "ex": "There is a strong association between smoking and lung cancer.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong association",
                " positive association",
                " negative association"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6421bd44-5b29-4b8c-bef4-06c9fe1abb63.webp",
            "Tips": [
                {
                    "title": "Cause and Effect",
                    "description": "Associations can indicate a cause-and-effect relationship in various contexts.",
                    "example": "There's a direct association between diet and health.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Causation",
                    "description": "Association doesn't mean one thing causes another, just that they are linked somehow.",
                    "example": "A study found an association between sleep patterns and productivity.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "4a8ff681-8039-48d0-bad2-d17d2a9ad78a",
            "de": "A process by which thoughts or ideas are linked together",
            "do": "Psychology",
            "ty": "noun",
            "ex": "His bad mood is an association to the stressful work day he had.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "association of thoughts",
                " mental association",
                " free association"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4a8ff681-8039-48d0-bad2-d17d2a9ad78a.webp",
            "Tips": [
                {
                    "title": "Psychological Process",
                    "description": "In psychology, association refers to a mental process of connecting ideas.",
                    "example": "He used dream interpretation to explore the associations in his subconscious.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Unconscious Connections",
                    "description": "Some associations are automatic and occur without our conscious awareness.",
                    "example": "Pavlov’s dogs salivated at the bell through unconscious association.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "de1a4704-5811-4a42-8afc-4caec3021979",
            "de": "The process of combining or grouping things together",
            "ty": "noun",
            "ex": "The association of ingredients creates a unique flavor in the dish.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "association of tastes",
                " association of cultures",
                " association of ideas"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/de1a4704-5811-4a42-8afc-4caec3021979.webp",
            "Tips": [
                {
                    "title": "Creative Combinations",
                    "description": "Association can describe the inventive act of combining different elements.",
                    "example": "The chef's association of exotic spices created a revolutionary dish.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Beyond Physical",
                    "description": "Associations extend beyond physical objects to ideas and qualities.",
                    "example": "The association of traditional and modern themes surprised the audience.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "ba02da63-f2b3-46be-b98d-14c2541b507b",
            "de": "The company or group a person belongs or is linked to",
            "ty": "noun",
            "ex": "His association with the criminal gang is what got him into trouble.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "close association",
                " brief association",
                " association with a group"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ba02da63-f2b3-46be-b98d-14c2541b507b.webp",
            "Tips": [
                {
                    "title": "Reputational Impact",
                    "description": "An individual's associations can affect how others view their character or status.",
                    "example": "Her association with that company boosted her professional image.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Influence Perception",
                    "description": "Being linked with groups or companies can influence public perception, for better or worse.",
                    "example": "His association with that scandal tainted his reputation.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Affiliation": {
            "wordRoot": "Affiliation",
            "wordDefinition": "Affiliation refers to the official connection or partnership between two entities, like organizations or companies. For example, a university may have an affiliation with a hospital, meaning they work together and support each other.\n\nAffiliation refers to an official connection between two entities while association refers to a group of people with a common interest or purpose.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/55632849-0874-4968-a8af-b79d19f73db5.webp"
        },
        "Alliance": {
            "wordRoot": "Alliance",
            "wordDefinition": "An alliance is a union formed for mutual benefit or protection between different groups or nations. It typically involves a formal agreement or treaty and may be formed for political, military, or economic reasons.\n\nBoth alliance and association imply a coming together of different entities, but an alliance is more formal and typically involves a larger-scale collaboration, while an association can be more informal and focused on a specific interest or goal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c01cfa60-aff7-4a85-9ab3-13ee58493249.webp"
        },
        "Attachment": {
            "wordRoot": "Attachment",
            "wordDefinition": "Association refers to a mental connection between two or more things, whereas attachment refers to a deep emotional connection to someone or something.\n\nYou might have an attachment to your pet dog. This means that you have a strong emotional connection to your dog and feel a sense of love and loyalty towards them.\n\nAssociation is more commonly used in academic or professional contexts, while attachment is used more in personal or emotional contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b84b7708-3d0e-48e6-ab8e-398c4d59ac70.webp"
        },
        "Combination": {
            "wordRoot": "Combination",
            "wordDefinition": "Combination, on the other hand, refers to the act of putting two or more things together to create something new.\n\nFor example, if you combine flour, sugar, and eggs to make a cake, that's a combination. Combinations are used to make something new or to achieve a desired result.\n\nIn mathematics and science, combination is used to study probability and understand how different variables interact with each other.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/22f92d6b-930b-43e7-a62e-470ec38cfebb.webp"
        },
        "Connection": {
            "wordRoot": "Connection",
            "wordDefinition": "The words association and connection are similar in meaning but have slight differences in their usage.\n\nA connection refers to a bond or link between two or more things that are joined or associated in some way. For example, if we say, \"I have a connection with my family,\" it means that there is a strong bond or relationship between me and my family members.\n\nAssociation refers to a relationship or link between things, while connection refers to the bond or link between those things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/14ffe5ed-b0c3-4d57-9700-40b30db152c0.webp"
        },
        "Correlate": {
            "wordRoot": "Correlate",
            "wordDefinition": "Correlate refers to a statistical relationship between two variables. When two variables are said to be correlated, it means that changes in one variable are reflected in changes in the other variable.\n\nFor example, there may be a positive correlation between a student's attendance in class and their grades. Correlation describes the strength and direction of the relationship between two variables.\n\nAssociation is a general term used to describe a connection between two variables, while correlation is a statistical term used to describe the relationship between two variables.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/21758632-23c9-490d-bf54-09d180c5f67a.webp"
        },
        "Fusion": {
            "wordRoot": "Fusion",
            "wordDefinition": "Association and fusion are two different concepts.\n\nFusion refers to the act of joining or combining two or more things together to form a new entity or substance. For example, when two or more atomic nuclei come together to form a single, more massive nucleus, it is called nuclear fusion.\n\nAssociation refers to the linking or connecting of similar or related things, while fusion refers to the combining of two or more things to create something new.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e8a49822-0414-4a03-9488-3f712ad3a0f5.webp"
        },
        "Interaction": {
            "wordRoot": "Interaction",
            "wordDefinition": "For example, there may be an association between smoking and lung cancer, without any direct interaction between the two.\n\nInteraction refers to the direct communication or engagement between two or more things. This can include physical contact, communication, or any other form of direct connection.\n\nIn simpler terms, association is like a general connection between things, while interaction involves direct engagement or communication between those things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b9c17123-4eb6-41d4-bfbd-0855cd47ddb0.webp"
        },
        "Partnership": {
            "wordRoot": "Partnership",
            "wordDefinition": "Partnership is used when two or more people or organizations work together as equals towards a common goal, with each party having equal responsibility and say in achieving that goal.\n\nPartnerships often involve shared resources, risks, and rewards.\n\nAssociation implies a looser, more casual relationship, while partnership implies a more formal, structured relationship.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/20488939-51f7-4580-970d-ba7e174c0ffd.webp"
        },
        "Relationship": {
            "wordRoot": "Relationship",
            "wordDefinition": "Relationship refers to the connection or bond between two people, animals or things, where there is an emotional connection or attachment.\n\nFor example, a mother and child have a relationship based on love, care and nurturing.\n\nAssociation refers to a connection or link between things that work together, while relationship refers to the emotional bond between people or things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf882de7-8175-4922-b9ec-054d65021b69.webp"
        },
        "Union": {
            "wordRoot": "Union",
            "wordDefinition": "Union refers to a group of workers who come together to protect their interests in the workplace, including wages, benefits, and working conditions.\n\nUnions negotiate with employers on behalf of their members and may also engage in collective bargaining.\n\nSo, while both words refer to groups of people coming together for a common purpose or interest, association generally refers to groups that are not primarily focused on workplace concerns, while union specifically refers to organized groups of workers in a particular industry or field.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7c71939c-08ef-48ee-b9ea-9318e892b373.webp"
        }
    },
    "videos": [
        {
            "Text": " the decrease in inhibition and cognitive control might lead to wild associations— and, thanks to the amygdala and cingulate cortex activity, those associations can be between emotionally charged topics. Some researchers think this stage might help us make innovative connections between ideas upon waking.",
            "Title": "How long should your...",
            "VideoId": "BN9yqF6Um98",
            "Controls": "start=185"
        },
        {
            "Text": " or the well constructed plot of a novel conveyed through perfectly crafted sentences. Most importantly, the network of associations formed by ideasethesia may not only be similar to our linguistic network but may, in fact, be an integral part of it. Rather than the traditional view,",
            "Title": "Ideasthesia: How do...",
            "VideoId": "GIF2tssedLI",
            "Controls": "start=237"
        },
        {
            "Text": " But today the word has such positive associations, that vastly different regimes claim to embody it. At the same time, some share Plato's skepticism about the wisdom of crowds. Many modern democracies reconcile this conflict by having citizens elect those they consider qualified",
            "Title": "What did democracy...",
            "VideoId": "0fivQUlC7-8",
            "Controls": "start=208"
        },
        {
            "Text": " Just as autism is a spectrum, there's a spectrum of etiologies, a spectrum of causes. Based on epidemiological data, we know that one of the causes, or one of the associations, I should say, is advanced paternal age, that is, increasing age of the father",
            "Title": "Autism — what we know...",
            "VideoId": "wKlMcLTqRLs",
            "Controls": "start=252"
        },
        {
            "Text": " and he's ready to welcome this guests among them are the leaders of Taiwan's premier keulen Area associations men and women who can make or break a chef's reputation even for these experts this meal will be a rare treat most of them",
            "Title": "Would You Eat Bull...",
            "VideoId": "xwxdI1XSQDU",
            "Controls": "start=154"
        },
        {
            "Text": " is help people understand this auditory event, and develop neutral associations with these often-distressing sounds. For example, sound therapy uses noises like rain, birdsong, or music to mask tinnitus and reduce stress.",
            "Title": "What’s that ringing in...",
            "VideoId": "TnsCsR2wDdk",
            "Controls": "start=242"
        },
        {
            "Text": " taste, smell, touch, hearing, sight, and the sense of motion. It also plays with our ability to abstract and make complex associations. Look at the following sentence. \"The world was ghost-quiet,",
            "Title": "How to write descriptivel...",
            "VideoId": "RSoRzTtwgP4",
            "Controls": "start=133"
        },
        {
            "Text": " For some, it's a serious sport. For others, just a way to let loose. But despite its casual association with fun and sun, surfing has a richer and deeper history than many realize.",
            "Title": "The complicated history...",
            "VideoId": "jyn_orqdyHQ",
            "Controls": "start=4"
        },
        {
            "Text": " settling in our popular consciousness to evoke some larger-than-life ideal or positive association smart cool",
            "Title": "The legacy of dead...",
            "VideoId": "9UkDC86Mjpo",
            "Controls": "start=95"
        },
        {
            "Text": " sarah free dives to the grassy seabed and catches a rare glimpse of this strange association",
            "Title": "Dolphins Use Sting﻿﻿rays...",
            "VideoId": "7g3wWgbYtMI",
            "Controls": "start=57"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/huda-kattan.webp",
            "Text": "The thing that helped me most when I started my own business was my experience as the president and PR director of student associations in college. Because of that I knew how to create and run an organization and how to really make things - even hard things - happen.",
            "Title": "Iraqi Entertainer",
            "Name": "Huda Kattan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steph-mcgovern.webp",
            "Text": "Since becoming a BBC breakfast presenter I have been paid four-figure sums for doing hour-long speeches for associations and at awards dinners. That has been an eye-opener. I am surprised by how much people are willing to pay TV celebrities to do that kind of stuff.",
            "Title": "English Journalist",
            "Name": "Steph McGovern"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tracy-k-smith.webp",
            "Text": "One of poetry's great effects, through its emphasis upon feeling, association, music, and image - things we recognize and respond to even before we understand why - is to guide us toward the part of ourselves so deeply buried that it borders upon the collective.",
            "Title": "American Poet",
            "Name": "Tracy K. Smith"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ken-buck.webp",
            "Text": "What I have said is that I think the federal government and we as a society have come too far in trying to separate good organizations that perform good functions for people just based on the fact one has a religious association and one doesn't.",
            "Title": "American Politician",
            "Name": "Ken Buck"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frederic-bastiat.webp",
            "Text": "And what is liberty, whose very name makes the heart beat faster and shakes the world? Is it not the union of all liberties - liberty of conscience, of education, of association, of the press, of travel, or labor, or trade?",
            "Title": "French Economist",
            "Name": "Frederic Bastiat"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tobias-lindholm.webp",
            "Text": "I have three sons, and the oldest wants to play pirates all the time. It has all these associations of living some kind of very free life. It's interesting for me as a filmmaker to show a whole different side of that.",
            "Title": "Danish Writer",
            "Name": "Tobias Lindholm"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeremy-corbyn.webp",
            "Text": "If there is 'right to buy' for council tenants and housing association properties, then why shouldn't that apply to all tenants? Some landlords are decent, very caring people, but some of them are truly appalling.",
            "Title": "British Politician",
            "Name": "Jeremy Corbyn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sharon-salzberg.webp",
            "Text": "I think the associations people have with kindness are often things like meekness and sweetness and maybe sickly sweetness; whereas I do think of kindness as a force, as a power.",
            "Title": "American Author",
            "Name": "Sharon Salzberg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joachim-low.webp",
            "Text": "If you become world champions, there is nothing to top that. It's the result of many years of work, good decisions inside the association, good training and good players.",
            "Title": "German Coach",
            "Name": "Joachim Low"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gus-van-sant.webp",
            "Text": "There is a common theme, though, in the stories I have told, which are usually associations of characters or families that are formed outside of a family circle.",
            "Title": "American Director",
            "Name": "Gus Van Sant"
        }
    ]
}