{
    "currentWord": {
        "wordRoot": "assurance",
        "id": 6686,
        "phonemic": "əˈʃɔːrəns|əˈʃʊrəns\r",
        "bigId": "55dcc5c3-3594-4f04-a8f8-4f3e0d28e902",
        "wordForms": [
            "assurances",
            "assurance"
        ]
    },
    "senses": [
        {
            "id": "55dcc5c3-3594-4f04-a8f8-4f3e0d28e902",
            "de": "A positive declaration to give confidence",
            "ty": "noun",
            "ex": "He gave her an assurance that he would be there on time",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "give assurance",
                " receive assurance",
                " offer assurance"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/55dcc5c3-3594-4f04-a8f8-4f3e0d28e902.webp",
            "Tips": [
                {
                    "title": "Reassurance",
                    "description": "Used when someone needs to be comforted or convinced about something.",
                    "example": "His mother's assurance calmed him before the exam.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Lay0p9uEjQUr1bFq9Qh8fAJaxUo.webp"
                },
                {
                    "title": "Commitment Indication",
                    "description": "Indicates a strong commitment to act or support.",
                    "example": "Her assurance of help made me feel supported.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/4FWbDTE1Htq91wzbfIHxJcVbYc.webp"
                },
                {
                    "title": "Strengthens Promises",
                    "description": "Often used to emphasize that a promise is solid and reliable.",
                    "example": "I need your assurance that you will deliver the project on time.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/t6oknLzfKreZGMozmrCtX4TVFY.webp"
                }
            ]
        },
        {
            "id": "984117d6-49a6-4343-b64f-2f8941203c8b",
            "de": "Confidence or certainty in one's abilities",
            "ty": "noun",
            "ex": "She spoke with quiet assurance",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "quiet assurance",
                " with assurance",
                " convey assurance"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/984117d6-49a6-4343-b64f-2f8941203c8b.webp",
            "Tips": [
                {
                    "title": "Self-Confidence",
                    "description": "Refers to being secure in oneself, without sounding arrogant.",
                    "example": "Her assurance impressed the interview panel.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Perceived Competence",
                    "description": "Demonstrates capability and can make others more trusting of one's abilities.",
                    "example": "He handled the situation with assurance, showing his expertise.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Positive Connotation",
                    "description": "Carries a positive tone, indicating reliability and trustworthiness.",
                    "example": "Speaking with assurance can make your arguments more persuasive.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "d9fc372a-d441-4b56-b0e3-4d8b60b67c86",
            "de": "A policy sold by an insurance company",
            "do": "Insurance",
            "ty": "noun",
            "ex": "He took out an assurance for his new car",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "take out assurance",
                " buy assurance",
                " sell assurance"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d9fc372a-d441-4b56-b0e3-4d8b60b67c86.webp",
            "Tips": [
                {
                    "title": "Financial Security",
                    "description": "Used in the context of providing protection against financial loss.",
                    "example": "The businessman took assurance against fire damage to his stores.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Insurance Specific",
                    "description": "Specific to the insurance industry and might not be interchangeable with 'insurance'.",
                    "example": "Her life assurance policy ensured her family's financial stability.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Long-Term Planning",
                    "description": "Often associated with long-term commitments or plans, like life assurance.",
                    "example": "Assurance policies are crucial for long-term financial planning.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Certificate": {
            "wordRoot": "Certificate",
            "wordDefinition": "A certificate is a document that serves as proof that you have completed a course or achieved a certain level of proficiency.\n\nIt is applicable in education or professional settings, where certificates are awarded after completing a qualification or training program.\n\nAssurance guarantees something to be true or reliable while a certificate serves as proof of completing a course or achieving a certain level of proficiency.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c3a551cf-6c69-45c4-8d84-ceae8bb9aceb.webp"
        },
        "Confidence": {
            "wordRoot": "Confidence",
            "wordDefinition": "Assurance is a stronger word than confidence. It means having a guarantee or a promise that something will definitely happen or be provided.\n\nConfidence is a feeling of trust in your own abilities, judgement, or knowledge. For example, if you are confident that you know the answer to a question on a test, it means you believe that you are right and you have faith in your own abilities to answer correctly.\n\nSo assurance is about having a promise or a guarantee that something will happen, while confidence is about having trust in your own abilities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/118d8bb0-f43f-47fd-ae33-87e1ef08085b.webp"
        },
        "Conviction": {
            "wordRoot": "Conviction",
            "wordDefinition": "Assurance and conviction are both words that express confidence or belief in something, but they are used in slightly different ways.\n\nConviction refers to a strong belief in something, often coupled with a sense of determination or passion. For example, someone might say \"I have a conviction that everyone should be treated equally,\" meaning that they strongly believe in that principle and may take action to ensure that it is upheld.\n\nAssurance is more about having confidence or certainty, while conviction is about having a strong belief or sense of purpose.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/61e352c5-e98e-40b8-a18f-4cc350af3428.webp"
        },
        "Guarantee": {
            "wordRoot": "Guarantee",
            "wordDefinition": "Assurance and guarantee may seem similar, but they have differences in their meanings. Assurance means to give someone confidence or a promise that something will happen, but it's not always guaranteed.\n\nFor example, a doctor can give a patient assurance that their medicine will cure them, but there is no guarantee because everyone's body reacts differently.\n\nA guarantee is a promise or an agreement made by someone to ensure that something will happen or be done. It is a legal term that has a specific implication that if something doesn't happen, the person who made the guarantee will provide compensation or take responsibility for the mistake.\n\nFor example, when you purchase an electronic device, the manufacturer provides a guarantee that it will work for a certain duration, and if it doesn't, they will replace it or refund your money.\n\nAssurance is a promise that gives confidence, and a guarantee is a promise that provides a legally binding obligation to do something or provide compensation if it doesn't work.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/209881b5-3f93-4f7c-9c87-79d08c400702.webp"
        },
        "Pledge": {
            "wordRoot": "Pledge",
            "wordDefinition": "Pledge means a promise or commitment to do something. For example, a student might pledge to study harder to improve their grades.\n\nBoth assurance and pledge involve a level of commitment, but assurance is more about a sense of security and confidence in the future, while pledge is more about a specific promise or commitment to take action.\n\nAssurance is often used in business or personal relationships where trust is important, while pledge is often used in personal or social contexts where promises are made.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ddd6100c-c831-4593-abbd-8cb6ef833728.webp"
        },
        "Promise": {
            "wordRoot": "Promise",
            "wordDefinition": "Promise is when one person gives their word to another person that they will do something. For example, if a parent promises their child that they will take them to the zoo on the weekend, they have made a promise to their child.\n\nAssurance gives you confidence and promises are commitments made by one person to another.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/31b7898b-f8d5-4a93-a88c-cf025210f771.webp"
        },
        "Security": {
            "wordRoot": "Security",
            "wordDefinition": "Assurance refers to the confidence or certainty one has about something, while security refers to protection or safety from harm or danger.\n\nIf you install a security camera at your front door, it will protect your home from potential burglars.\n\nAssurance is more applicable to situations where you need trust or confidence in someone or something, while security is more applicable to situations where you need protection from harm.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/390b93b2-84a0-49fd-a1d0-2400af6db763.webp"
        },
        "Surety": {
            "wordRoot": "Surety",
            "wordDefinition": "The words assurance and surety both mean confidence or certainty, but they are used in slightly different ways.\n\nSurety is often used in relation to a guarantee of payment or responsibility. For example, if someone acts as surety for a loan, it means they are guaranteeing that they will pay the loan if the original borrower cannot.\n\nAssurance is used when talking about promises or guarantees related to a particular thing happening, while surety is used when talking about someone taking responsibility for another person's obligation or debt.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f6afae26-163e-4531-a7e4-37a6ffddd99d.webp"
        }
    },
    "videos": [
        {
            "Text": " Insects, snakes, turtles not so much. Zoos actually are the ark. Zoos are the ones that really take care to make sure we have assurance colonies of animals until we get smart enough as a species to set land aside that these animals need. And we need it too, believe me. We work with these zoos months in advance",
            "Title": "Saving Animals Through...",
            "VideoId": "InTpZhbvscg",
            "Controls": "start=123"
        },
        {
            "Text": " would need help from partner countries, who could benefit from partner countries who help them set up the rules in this charter and the enforcement, so everybody can trust that the charter really will be enforced. And the insight of President Lobo was that that assurance of enforcement",
            "Title": "Paul Romer: The world's...",
            "VideoId": "30kPKxGuHLA",
            "Controls": "start=350"
        },
        {
            "Text": " a few people trying to keep using it. You see people who are really shell-shocked. They are very hardworking people. All they know about life is they get up in the morning, and if their engine starts, they go to work. They always felt that they could rely on the assurances",
            "Title": "Carl Safina: The oil...",
            "VideoId": "7gouSXt2zE4",
            "Controls": "start=287"
        },
        {
            "Text": " minutes later like this two minutes after that he's starting to fall asleep most of these animals we photograph are born and raised in human care they're part of assurance colonies like this tarsier they're part of captive assurance colonies making sure that they don't go",
            "Title": "Every Animal Deserves a...",
            "VideoId": "lxW8buTV4KE",
            "Controls": "start=257"
        },
        {
            "Text": " a gesture of safety and assurance. With these symbols, this powerful avatar makes it clear that the material world is anything but an illusion. Rather, it is a cycle of life that must be sustained— from the feeding of open mouths and rumbling bellies,",
            "Title": "The legend of Annapurna,...",
            "VideoId": "ztoUaJFEi8M",
            "Controls": "start=257"
        },
        {
            "Text": " assurances with animals you know wildlife are wild for a reason if they get used to getting in a structure with people the problem with stripes with people as they contain people and usually the Bears aren't the ones that",
            "Title": "Knock Knock, Who's Bear...",
            "VideoId": "g9JChJqUo5U",
            "Controls": "start=34"
        },
        {
            "Text": " and to love without counting the cost, without reasons and assurances that nothing will be lost. Life will break your heart, and life may take everything you have and everything you hope for.",
            "Title": "\"Everything happens for...",
            "VideoId": "DTcJmIbn5nw",
            "Controls": "start=846"
        },
        {
            "Text": " those assurances burns and Rafi were sent to Washington State were tried convicted and are presently serving life sentences this is just one example of the interplay between law and morality",
            "Title": "Where foreign laws and...",
            "VideoId": "GqQm6F88rjA",
            "Controls": "start=185"
        },
        {
            "Text": " loses its central importance. I believe that it is nothing less than the assurance of immortality that makes self-sacrifice at these moments so relatively easy. I may fall, but I do not die,",
            "Title": "Jonathan Haidt:...",
            "VideoId": "2MYsx6WArKY",
            "Controls": "start=254"
        },
        {
            "Text": " the California Army National Guard has been deployed to assist assurance department and Los Angeles Police Department in a mutual aid operation to restore law",
            "Title": "LA92 Panel - Live PIPE...",
            "VideoId": "dWGUgjgOW_Y",
            "Controls": "start=7173"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-burdett.webp",
            "Text": "It is quite amazing how hard the subconscious works when it is made to understand that this life is not a rehearsal, there is no safety net and no assurance of any final closure. It is also quite appalling to realize how catatonic the imagination can become when we hedge our bets, opt for the safer direction at every fork in the path.",
            "Title": "British Novelist",
            "Name": "John Burdett"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anna-garlin-spencer.webp",
            "Text": "The essence of democracy is its assurance that every human being should so respect himself and should be so respected in his own personality that he should have opportunity equal to that of every other human being to show what he was meant to become.",
            "Title": "American Educator",
            "Name": "Anna Garlin Spencer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jose-ortega-y-gasset.webp",
            "Text": "The characteristic of the hour is that the commonplace mind, knowing itself to be commonplace, has the assurance to proclaim the rights of the commonplace and to impose them wherever it will.",
            "Title": "Spanish Philosopher",
            "Name": "Jose Ortega y Gasset"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-dalberg-acton.webp",
            "Text": "By liberty I mean the assurance that every man shall be protected in doing what he believes is his duty against the influence of authority and majorities, custom and opinion.",
            "Title": "English Historian",
            "Name": "John Dalberg-Acton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/orison-swett-marden.webp",
            "Text": "There can be no great courage where there is no confidence or assurance, and half the battle is in the conviction that we can do what we undertake.",
            "Title": "American Writer",
            "Name": "Orison Swett Marden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/a-r-ammons.webp",
            "Text": "The poet exposes himself to the risk. All that has been said about poetry, all that he has learned about poetry, is only a partial assurance.",
            "Title": "American Poet",
            "Name": "A. R. Ammons"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alan-cox.webp",
            "Text": "Everybody in the real world will agree - the moment a project is behind deadline, quality assurance tends to go out the window.",
            "Title": "Welsh Inventor",
            "Name": "Alan Cox"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jahangir-khan.webp",
            "Text": "However, there is no assurance that we can produce world class players so soon. Only time can tell.",
            "Title": "Pakistani Athlete",
            "Name": "Jahangir Khan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rod-serling.webp",
            "Text": "It may be said with a degree of assurance that not everything that meets the eye is as it appears.",
            "Title": "American Writer",
            "Name": "Rod Serling"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ro-khanna.webp",
            "Text": "People want to have some assurance that their privacy, their data is going to be protected.",
            "Title": "American Politician",
            "Name": "Ro Khanna"
        }
    ]
}