{
    "currentWord": {
        "wordRoot": "attend",
        "id": 20050,
        "phonemic": "əˈtend|əˈtend\r",
        "bigId": "e8245eb4-765c-4b5f-9ea1-06f8ae47b23c",
        "wordForms": [
            "attends",
            "attending",
            "attended",
            "attend"
        ]
    },
    "senses": [
        {
            "id": "e8245eb4-765c-4b5f-9ea1-06f8ae47b23c",
            "de": "To go to or be present at an event, place, or activity",
            "ty": "verb",
            "ex": "She will attend the meeting tomorrow.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "attend a meeting",
                " attend school",
                " attend a concert"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e8245eb4-765c-4b5f-9ea1-06f8ae47b23c.webp",
            "Tips": [
                {
                    "title": "Physical Presence",
                    "description": "The word 'attend' implies actually being in the location of the event or activity.",
                    "example": "He will attend the party at Susan's house.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/e9DFUf84RGqfmd3H5Qc8fnc8Rk.webp"
                },
                {
                    "title": "Commitment Expected",
                    "description": "'Attend' often suggests you have agreed to be present and participate.",
                    "example": "Maria agreed to attend the weekly team meetings.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/QNQI5bGq6jPMQo35wXqC6RbLtdQ.webp"
                },
                {
                    "title": "Formal Occasions",
                    "description": "'Attend' is frequently used for formal or organized events such as ceremonies.",
                    "example": "Many people attended the award ceremony downtown.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3u9qDVqUscNQu14N3GchAC9NFoc.webp"
                }
            ]
        },
        {
            "id": "4f80ce4f-6c74-4ae8-be24-95b6b530254b",
            "de": "To take care of or look after someone or something",
            "ty": "verb",
            "ex": "Nurses attend the sick in hospitals.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "attend the sick",
                " attend to needs",
                " attend to duties"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4f80ce4f-6c74-4ae8-be24-95b6b530254b.webp",
            "Tips": [
                {
                    "title": "Dedicated Assistance",
                    "description": "'Attend' shows special care or support for someone, not just casual help.",
                    "example": "The nurse attentively attended to the injured man.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ongoing Responsibility",
                    "description": "Using 'attend' can indicate a continuous or regular duty to help someone.",
                    "example": "The caretaker attends to the needs of the elderly daily.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6553058b-1c7a-46f1-b6ac-48d4dbf66271",
            "de": "To deal with or manage something",
            "ty": "verb",
            "ex": "She attended to the matter immediately.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "attend to a matter",
                " attend to business",
                " attend to a problem"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6553058b-1c7a-46f1-b6ac-48d4dbf66271.webp",
            "Tips": [
                {
                    "title": "Direct Focus",
                    "description": "'Attend to' suggests giving something your full and immediate attention.",
                    "example": "He attended to the urgent email as soon as he arrived.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Professional Context",
                    "description": "'Attend to' is often used in a work or business context to discuss responsibilities.",
                    "example": "The manager is attending to the client complaints.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "167b273d-eef4-489a-8922-26278c76201b",
            "de": "To listen to someone carefully",
            "ty": "verb",
            "ex": "Please attend to what the teacher is saying.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "attend to what someone is saying",
                " attend to instructions",
                " attend to advice"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/167b273d-eef4-489a-8922-26278c76201b.webp",
            "Tips": [
                {
                    "title": "Active Listening",
                    "description": "'Attend to' emphasizes actively listening or obeying, not just hearing sounds.",
                    "example": "The students were asked to attend to the safety instructions.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Concentration Required",
                    "description": "When 'attend to' is used, it means focus is needed, distractions should be avoided.",
                    "example": "Attend to the speaker without checking your phone.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5ed8a805-d29a-40fc-ae3b-878727bfa82b",
            "de": "In the past, to serve or wait upon someone, especially of high rank",
            "ty": "verb",
            "ex": "The knights would attend the king during festivals.",
            "use": "",
            "co": "Historical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "attend the king",
                " attend the queen",
                " attend the noble"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5ed8a805-d29a-40fc-ae3b-878727bfa82b.webp",
            "Tips": [
                {
                    "title": "Historical Service",
                    "description": "'Attend' in historical contexts often refers to personal service to royalty or nobility.",
                    "example": "Squires were expected to attend their lords in battle and at court.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Attend to": {
            "wordRoot": "Attend to",
            "wordDefinition": "Attend generally means to be present at an event, meeting, or class. For example, you might attend a lecture or an after-school club meeting.\n\nThe phrase attend to is a bit different. It means to focus your attention on something, often in order to take care of it or handle a problem.\n\nFor example, you might attend to a crying baby or attend to a customer's needs in a store.\n\nSo, in short, attend is about being present somewhere, while attend to is about paying attention to something that needs to be dealt with.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6e52f5de-7c5a-47b7-a83a-c49882e31efa.webp"
        },
        "Care for": {
            "wordRoot": "Care for",
            "wordDefinition": "Attend means to be present at an event or function, and it can also mean to take care of someone or something. For example, you might attend a party or attend a doctor's appointment.\n\nThe phrase care for usually means to provide support or assistance to someone or something. For example, you might care for your pets, your siblings, or your elderly grandparents.\n\nAttend focuses more on being present or paying attention to something, while care for focuses on providing assistance or support to someone or something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/168ac43e-844e-4b5b-8220-835fe3e65ec7.webp"
        },
        "Handle": {
            "wordRoot": "Handle",
            "wordDefinition": "Attend means to be present at an event or situation, while the word handle means to manage or deal with a situation or problem.\n\nFor example, you attend a party, but you handle a difficult situation at work.\n\nHandle is used when referring to dealing with a problem or situation, such as handling a customer complaint or handling an emergency.\n\nAttend is related to being present, while handle is related to managing or dealing with something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/79a0a1a2-c7c2-48b9-ad43-d3d22008beeb.webp"
        },
        "Join": {
            "wordRoot": "Join",
            "wordDefinition": "Join means to become a member of a group, organization or a team. For example, you join a club, a sports team or a community group.\n\nAttend refers to the action of being present while join refers to becoming a member.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/651ee729-0924-4676-a5fc-51b387f27e36.webp"
        },
        "Look after": {
            "wordRoot": "Look after",
            "wordDefinition": "Look after means to take care of someone or something. It is applicable when you are responsible for taking care of someone, like a child or a pet.\n\nYou can also look after a house or a garden.\n\nAttend is about being there, while look after is about taking care of something or someone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/349db17e-0f78-4e61-b42a-8058a9cfb76b.webp"
        },
        "Mind": {
            "wordRoot": "Mind",
            "wordDefinition": "Mind means to be careful or to pay attention to something. For example, when you ask someone to mind their manners, you are asking that person to be careful about their behavior.\n\nAttend is used when you are physically present at a particular place, whereas mind is used when you want someone to be careful or pay attention to something specific.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4fa0c12d-7ca8-431a-9004-8c7807920330.webp"
        },
        "Participate": {
            "wordRoot": "Participate",
            "wordDefinition": "Participate means to take part in something actively. This implies contributing to the event or activity, being involved in various aspects, and engaging in the event on a more personal level.\n\nHowever, if you participate in a party game, you are actively contributing and engaging in the party.\n\nAttending is usually used when you are going to an event or gathering as a spectator or observer, while participating suggests involvement and active engagement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/599ea823-70c4-41a9-89b6-bc70d8f67d68.webp"
        },
        "Show up": {
            "wordRoot": "Show up",
            "wordDefinition": "Attend means to be present at a specific event, location or activity and to actively participate or engage in it, while show up means to simply arrive or appear at a specific event or location without necessarily participating or engaging in it.\n\nHowever, if you simply show up at the concert, you might be there but not necessarily participating in any way.\n\nIf you just show up at the meeting, you might be there but not necessarily engaging or participating actively.\n\nAttend is applicable when you want to emphasize active participation or engagement in an event, location or activity, while show up is applicable when you simply want to emphasize presence or arrival at a specific event or location.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/26f10113-d2a8-4eea-a1d3-6e5821bad3ab.webp"
        }
    },
    "videos": [
        {
            "Text": " I mean, you'd want to find out what's going on with him, right? They asked to attend our bedside rounds where we discussed his condition and his plan, which I thought was a reasonable request, and also would give us a chance to show them how much we were trying and how much we cared. The head doctor, though, said no. He gave all kinds of reasons.",
            "Title": "Leana Wen: What your...",
            "VideoId": "lVQ3KUTHDe0",
            "Controls": "start=213"
        },
        {
            "Text": " that I attended as a child he was my friend that used to sit next to me so I contacted the Security Intelligence Service I thought this has to be a mistake I wanted to give a character reference for the family's good family but it was out of their hands it was in",
            "Title": "An inside look at...",
            "VideoId": "RK8zb8dA4G4",
            "Controls": "start=346"
        },
        {
            "Text": " Roman sexual mores for one thing it doesn't have a sense of privacy we think that privacy is the most important thing about sexual activity but here we have a bedroom servant right in the corner on the left-hand side looking out at us and attending to the couple",
            "Title": "Pompeiian Sexuality PIPE...",
            "VideoId": "QOmB3QohaPA",
            "Controls": "start=110"
        },
        {
            "Text": " It was perhaps this precedent that inspired Juana’s lifelong confidence. At age three, she secretly followed her older sister to school. When she later learned that higher education was open only to men, she begged her mother to let her attend in disguise.",
            "Title": "History's \"worst\" nun -...",
            "VideoId": "9wSOt3z_-YY",
            "Controls": "start=75"
        },
        {
            "Text": " a week-long event they attend to share their ideas, think through tough problems... and mostly to party. And at the center of that gathering is the world’s most exclusive club, where under the full moon, the annual logician’s rave takes place.",
            "Title": "Can you solve the demon...",
            "VideoId": "KT-d8MlT27A",
            "Controls": "start=10"
        },
        {
            "Text": " I want to end with a call to young people, the young people attending college and the young people struggling to stay out of prison or to make it through prison and return home. It may seem like these paths to adulthood are worlds apart,",
            "Title": "Alice Goffman: How we're...",
            "VideoId": "-2Dj9M71JAc",
            "Controls": "start=897"
        },
        {
            "Text": " the females must have both shelter and warm water is there to raise their young for the last seven months each of these females has been carrying around about 20,000 fertilized eggs but their task is approaching attend the warmth of the",
            "Title": "Lobsters Battle for a...",
            "VideoId": "yuE7XeqNLl0",
            "Controls": "start=127"
        },
        {
            "Text": " imagine you're the queen you're attended by millions of sterile worker termites who live to feed you groom you and carry your eggs away when you lay them you aren't acting helpless because you",
            "Title": "Termite Queen Lays...",
            "VideoId": "MO5Fd54Ap_k",
            "Controls": "start=23"
        },
        {
            "Text": " they needed her as an engineer when they had briefings i asked permission to go and they said well the girls don't usually go and i said well is there a law i began attending the briefings",
            "Title": "NASA Trailblazer:...",
            "VideoId": "E4j_LpKzcZQ",
            "Controls": "start=155"
        },
        {
            "Text": " Now, very quickly, another reason we cannot think straight about happiness is that we do not attend to the same things when we think about life, and we actually live.",
            "Title": "The riddle of experience...",
            "VideoId": "XgRlrBl-7Yg",
            "Controls": "start=906"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michelle-obama.webp",
            "Text": "For me, education has never been simply a policy issue - it's personal. Neither of my parents and hardly anyone in the neighborhood where I grew up went to college. But thanks to a lot of hard work and plenty of financial aid, I had the opportunity to attend some of the finest universities in this country.",
            "Title": "American First Lady",
            "Name": "Michelle Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/j-michael-straczynski.webp",
            "Text": "Follow your passion. The rest will attend to itself. If I can do it, anybody can do it. It's possible. And it's your turn. So go for it. It's never too late to become what you always wanted to be in the first place.",
            "Title": "American Producer",
            "Name": "J. Michael Straczynski"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jared-polis.webp",
            "Text": "There are a lot of children in our country that, because of their neighborhood or socio-economic status, do not have the opportunity to attend a good school that will prepare them for life's challenges.",
            "Title": "American Politician",
            "Name": "Jared Polis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wynton-marsalis.webp",
            "Text": "My mother always took my brothers and me to music lessons. There were six children. Our parents attended our concerts and encouraged us to study and enjoy many different types of music.",
            "Title": "American Musician",
            "Name": "Wynton Marsalis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/neha-kakkar.webp",
            "Text": "Going out with friends for a nice dinner and then attending the midnight mass are some of the memories I cherish.",
            "Title": "Indian Musician",
            "Name": "Neha Kakkar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/o-j-mayo.webp",
            "Text": "Attending USC has been such a great experience for me and has really helped prepare me for my next step in life.",
            "Title": "American Basketball Player",
            "Name": "O. J. Mayo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-david-thoreau.webp",
            "Text": "The greatest compliment that was ever paid me was when one asked me what I thought, and attended to my answer.",
            "Title": "American Author",
            "Name": "Henry David Thoreau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerry-saltz.webp",
            "Text": "Art is changing. Again. Here. Now. Opportunities to witness this are rare, so attend and observe.",
            "Title": "American Critic",
            "Name": "Jerry Saltz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gary-johnson.webp",
            "Text": "I was raised a Christian. I'd like to think I have Christian values. I don't attend church.",
            "Title": "American Politician",
            "Name": "Gary Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brendan-iribe.webp",
            "Text": "I was born and raised in Maryland and attended the public school system.",
            "Title": "American Businessman",
            "Name": "Brendan Iribe"
        }
    ]
}