{
    "currentWord": {
        "wordRoot": "audience",
        "id": 12369,
        "phonemic": "ˈɔːdiəns|ˈɔːdiəns\r",
        "bigId": "cc69cf52-50a7-49d3-b078-27e99baa3f08",
        "wordForms": [
            "audiences",
            "audience"
        ]
    },
    "senses": [
        {
            "id": "cc69cf52-50a7-49d3-b078-27e99baa3f08",
            "de": "A group of people who gather to listen, watch, or take part in something",
            "ty": "noun",
            "ex": "The concert had an audience of thousands.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "captivate an audience",
                " interact with an audience",
                " play to an audience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cc69cf52-50a7-49d3-b078-27e99baa3f08.webp",
            "Tips": [
                {
                    "title": "Active Involvement",
                    "description": "The audience can be participative, responding to the performance or speaker.",
                    "example": "The comedian enjoyed the audience's laughter and engagement.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/2MpfXHTnz8JiZ5SJxc9acKFRx80.webp"
                },
                {
                    "title": "Live Presence",
                    "description": "This audience physically attends the event, like a concert or play.",
                    "example": "The theatre was filled with an excited audience.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/QKIrNUgkQRrNunl3UuPZRNphWOk.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "8155afab-376d-4890-90bc-6e4f353fa50c",
            "de": "People who watch or listen to a particular television or radio program, movie, or play",
            "ty": "noun",
            "ex": "The show has a large audience.",
            "use": "",
            "co": "Media",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "appeal to an audience",
                " attract an audience",
                " command an audience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8155afab-376d-4890-90bc-6e4f353fa50c.webp",
            "Tips": [
                {
                    "title": "Supportive Fans",
                    "description": "Media audience implies a fan base that consistently follows a show or series.",
                    "example": "The audience eagerly awaited the season finale.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Target Demographic",
                    "description": "Shows are often tailored for a specific audience, like children or adults.",
                    "example": "The new cartoon series has found its audience among kids.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "bcfeb29b-b19b-4a58-b132-313beb9d0c7b",
            "de": "The readership for printed matter, like a book or magazine",
            "ty": "noun",
            "ex": "The book is meant for a young audience.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "reach an audience",
                " write for an audience",
                " lose an audience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bcfeb29b-b19b-4a58-b132-313beb9d0c7b.webp",
            "Tips": [
                {
                    "title": "Specific Interests",
                    "description": "Books and magazines target an audience with particular interests or needs.",
                    "example": "The magazine's audience is those interested in technology.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Engagement Levels",
                    "description": "A readership audience may interact with content by sharing or discussing it.",
                    "example": "The author's blog has built a loyal audience that shares her posts.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "81cdb641-e3d0-4a2b-b635-0f7a5f69cdba",
            "de": "An official meeting with an important person",
            "do": "Politics",
            "ty": "noun",
            "ex": "The ambassador received an audience with the queen.",
            "use": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "request an audience",
                " grant an audience",
                " have an audience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/81cdb641-e3d0-4a2b-b635-0f7a5f69cdba.webp",
            "Tips": [
                {
                    "title": "Formality",
                    "description": "An audience with a dignitary is a formal event with accepted protocols.",
                    "example": "He dressed formally for his audience with the official.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Exclusive Meeting",
                    "description": "Such an audience is usually exclusive and requires a prior arrangement.",
                    "example": "After months of waiting, she finally had an audience with the minister.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Constituent": {
            "wordRoot": "Constituent",
            "wordDefinition": "A constituent refers to a member of a group or organization who has the power to elect representatives. It is applicable in political contexts where people vote for their representatives in government.\n\nFor example, a constituent could be a person who lives in a certain area and has the power to vote for their representative in Congress.\n\nAn audience is a group of people present to watch or listen to something, whereas a constituent is a member of a group with the power to choose representatives.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a067687d-59a1-437a-801f-af7dea13babf.webp"
        },
        "Crowd": {
            "wordRoot": "Crowd",
            "wordDefinition": "Crowd refers to a large, often unorganized group of people who gather together for various reasons, such as a protest, celebration, or emergency.\n\nCrowds can be lively and noisy, with individuals coming and going throughout the event.\n\nIn summary, audiences are typically more structured and focused on a specific event, while crowds are larger and less structured gatherings of people.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/76098602-72f2-47e2-8d83-8166365c4c36.webp"
        },
        "Guest": {
            "wordRoot": "Guest",
            "wordDefinition": "Guest refers to a person who has been invited to an event, gathering or place. For example, if you are invited to a party at your friend's house, you are their guest.\n\nSo, in simple terms, an audience is a group of people who observe a performance or presentation, while a guest is someone who has been invited or welcomed to an event or place.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4f5c2a3a-1d23-4607-9417-091586abab46.webp"
        },
        "Onlooker": {
            "wordRoot": "Onlooker",
            "wordDefinition": "Both audience and onlooker refer to people who are watching or observing something.\n\nOnlooker usually describes an individual who is simply observing an event as it unfolds, without necessarily being part of a larger group.\n\nFor example, someone who watches a parade from the sidelines could be considered an onlooker.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/418ce1d3-85bd-4d44-a792-beb72a30430e.webp"
        },
        "Patron": {
            "wordRoot": "Patron",
            "wordDefinition": "Patron typically refers to a person who supports or sponsors an artist, organization, or event financially.\n\nA patron might donate money to a theater or symphony orchestra, for example, in order to help keep it running.\n\nAudience refers to the people who are experiencing an event, while patron refers to a person who supports that event behind the scenes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c700fda0-4417-4305-b514-dc36fea86229.webp"
        },
        "Spectator": {
            "wordRoot": "Spectator",
            "wordDefinition": "A spectator is someone who is present at an event but not actively participating in it. This term is commonly used in sports events or outdoor activities, where spectators watch the game or activity from the sidelines or stands.\n\nAudience is applicable in the context of live entertainment while spectator is used in the context of watching a sports event or outdoor activity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a2300395-7f23-4040-a69c-0fd53b980aaf.webp"
        },
        "Viewer": {
            "wordRoot": "Viewer",
            "wordDefinition": "The viewer refers to someone who is watching a recorded or broadcasted program, such as a movie or TV show. It suggests a sense of passivity or observation without direct interaction.\n\nAudience applies to live events and involves participation, while viewer applies to recorded or broadcasted media and suggests passive observation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ef6efa3e-cfba-4e6b-85a7-edd001622385.webp"
        },
        "Witness": {
            "wordRoot": "Witness",
            "wordDefinition": "Witness refers to a person who sees or experiences something and can testify about it. This is often used in a legal context.\n\nFor example, if someone witnesses a crime, they may have to go to court and testify about what they saw.\n\nThe main difference between these words is that audience refers to a group of people who are observing something for entertainment or information, while witness refers to an individual who saw something happen and can give testimony about it.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9b5a9de6-a4f2-4d2c-bc58-c8184dbf020c.webp"
        }
    },
    "videos": [
        {
            "Text": " Education not automatons based systems education and which ones ones which are generally responsive for the talents that people have and I'm delighted to say there are lots of countries in the world which are moving in that direction some like Finland have been doing it for a very long time so I think we have time for one question from the audience which is absurd but thankfully second is not",
            "Title": "Expanding our definition...",
            "VideoId": "8awctnozMdo",
            "Controls": "start=456"
        },
        {
            "Text": " but actually little creatures and insects and reptiles and amphibians are facing the same challenges that we do and i really like to try and convey that so that was the challenge of that sequence just to try and make our audience engage with that character and care for its life and i think we managed to do that a lot of the the techniques we use is",
            "Title": "Filming the Kung Fu...",
            "VideoId": "H0TNj8NhkCU",
            "Controls": "start=261"
        },
        {
            "Text": " rather than, say, trochaic hexameter or dactylic tetrameter? It's been said that iambic pentameter was easy for his actors to memorize and for the audience to understand because it's naturally suited to the English language. But there might be another reason. The next time you're in a heightened emotional situation,",
            "Title": "Why Shakespeare loved...",
            "VideoId": "I5lsuyUNu_4",
            "Controls": "start=260"
        },
        {
            "Text": " where they will not be judged by the color of their skin, but by the content of their character. In both cases, the speaker's present their audience with a possible future and try to enlist their help in avoiding or achieving it. But what makes for good deliberative rhetoric, besides the future tense?",
            "Title": "How to use rhetoric to...",
            "VideoId": "3klMM9BkW5o",
            "Controls": "start=82"
        },
        {
            "Text": " friction between her pointe shoe and the floor, and somewhat between her body and the air, reduces her momentum. So how does she keep turning? Between each turn, the dancer pauses for a split second and faces the audience. Her supporting foot flattens, and then twists as it rises back onto pointe,",
            "Title": "The physics of the...",
            "VideoId": "l5VgOdgptRg",
            "Controls": "start=51"
        },
        {
            "Text": " and helped the rhapsode keep their place in the narrative, just as the chorus or bridge of a song helps us to remember the next verses. Because most of the tales were familiar to the audience, it was common to hear the sections of the poem out of order. At some point, the order became set in stone",
            "Title": "Everything you need to...",
            "VideoId": "8Z9FQxcCAZ0",
            "Controls": "start=104"
        },
        {
            "Text": " If you use them poorly, bad idea. Right? So when we think of nonverbals, we think of how we judge others, how they judge us and what the outcomes are. We tend to forget, though, the other audience that's influenced by our nonverbals, and that's ourselves. We are also influenced by our nonverbals,",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=199"
        },
        {
            "Text": " So, if you're in the audience today, or maybe you're watching this talk in some other time or place, you are a participant in the digital rights ecosystem. Whether you're an artist, a technologist, a lawyer or a fan, the handling of copyright directly impacts your life.",
            "Title": "Margaret Stewart: How...",
            "VideoId": "UoX-YihV_ew",
            "Controls": "start=13"
        },
        {
            "Text": " The line between the ceiling and the wall converges to the open door, further creating the perception of the painting as a physical space seen from the viewer's perspective. In this sense, the audience and the real world are the focus,",
            "Title": "Why is this painting so...",
            "VideoId": "loMy3sbW64g",
            "Controls": "start=144"
        },
        {
            "Text": " i cannot and i will not regret what i have said i cannot act against my conscience luther says not many in the audience have heard the word conscience before but they are in",
            "Title": "A Fun, Animated History...",
            "VideoId": "FhGGjRjvq7w",
            "Controls": "start=131"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lady-gaga.webp",
            "Text": "What I've discovered is that in art, as in music, there's a lot of truth-and then there's a lie. The artist is essentially creating his work to make this lie a truth, but he slides it in amongst all the others. The tiny little lie is the moment I live for, my moment. It's the moment that the audience falls in love.",
            "Title": "American Singer",
            "Name": "Lady Gaga"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christian-bale.webp",
            "Text": "You're creating a different world and the actor's job is to be able to convince the audience to enter into that world, whether it be actually something that you recognize from your own life or not.",
            "Title": "Welsh Actor",
            "Name": "Christian Bale"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dakota-fanning.webp",
            "Text": "I don't know whether it's audiences or filmmakers who want characters to be likable today, but I don't think actors are afraid of their characters being unlikable.",
            "Title": "American Actress",
            "Name": "Dakota Fanning"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/orson-welles.webp",
            "Text": "I can think of nothing that an audience won't understand. The only problem is to interest them; once they are interested, they understand anything in the world.",
            "Title": "American Actor",
            "Name": "Orson Welles"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jackie-chan.webp",
            "Text": "I like to change characters and then, slowly I believe the audience treat me as, like an actor who can fight. It's not like an action star.",
            "Title": "Chinese Actor",
            "Name": "Jackie Chan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dwayne-johnson.webp",
            "Text": "When a family film is done well, there's a character that every member of the audience can relate to. I want to be one of those guys.",
            "Title": "American Actor",
            "Name": "Dwayne Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dale-carnegie.webp",
            "Text": "Tell the audience what you're going to say, say it; then tell them what you've said.",
            "Title": "American Writer",
            "Name": "Dale Carnegie"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anthony-quinn.webp",
            "Text": "On the stage, you have to find truth, even if you have to lose the audience.",
            "Title": "Mexican Actor",
            "Name": "Anthony Quinn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jacqueline-fernandez.webp",
            "Text": "The most important thing is that you don't bore the audience.",
            "Title": "Actress",
            "Name": "Jacqueline Fernandez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jason-reitman.webp",
            "Text": "I want my audiences to be as open-minded as my characters.",
            "Title": "Canadian Director",
            "Name": "Jason Reitman"
        }
    ]
}