{
    "currentWord": {
        "wordRoot": "automatic",
        "id": 20808,
        "phonemic": "ˌɔːtəˈmætɪk|ˌɔːtəˈmætɪk\r",
        "bigId": "54713099-bfb8-4856-a89c-da42f786bafb",
        "wordForms": [
            "automatics",
            "automatically",
            "automatic"
        ]
    },
    "senses": [
        {
            "id": "54713099-bfb8-4856-a89c-da42f786bafb",
            "de": "Something that works by itself without needing a person to control it.",
            "ty": "adjective",
            "ex": "The door opens automatically when you stand in front of it.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "automatic door",
                " automatic machine",
                " automatic system"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/54713099-bfb8-4856-a89c-da42f786bafb.webp",
            "Tips": [
                {
                    "title": "No Human Needed",
                    "description": "Automatic implies a process requires no human effort to function continuously.",
                    "example": "The automatic irrigation system waters the garden by itself.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/W4llPwlJ0kPRDbG2FkHc2nHysnc.webp"
                },
                {
                    "title": "Tech Dependence",
                    "description": "Many modern innovations rely on automatic features for efficiency and convenience.",
                    "example": "Her house is fitted with an automatic climate control.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/w4pvkI2umfNNwN8gNhpYVvQfKyQ.webp"
                }
            ]
        },
        {
            "id": "7178153e-5314-4750-bdbc-b823ca336d5b",
            "de": "Something that happens without having to think or decide to do it.",
            "ty": "adjective",
            "ex": "Breathing is an automatic function of the body.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "automatic response",
                " automatic reflex",
                " automatic function"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7178153e-5314-4750-bdbc-b823ca336d5b.webp",
            "Tips": [
                {
                    "title": "Subconscious Actions",
                    "description": "Automatic in a biological sense relates to actions your body does without conscious thought.",
                    "example": "Her automatic response to the question showed she was prepared.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Common Phrases",
                    "description": "There are popular phrases like 'automatic reaction' that imply no deliberate planning.",
                    "example": "He ducked out of the way in an automatic reaction.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5895ca1e-ec3f-4755-8e00-c41c077b406a",
            "de": "Refers to a car or other vehicle with an automatic gear system.",
            "ty": "adjective",
            "ex": "Driving an automatic car is easier than driving one with a manual gearbox.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "automatic car",
                " automatic gearbox",
                " automatic transmission"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5895ca1e-ec3f-4755-8e00-c41c077b406a.webp",
            "Tips": [
                {
                    "title": "Driving Context",
                    "description": "When learning to drive, 'automatic' often contrasts with 'manual' concerning transmission.",
                    "example": "She preferred an automatic car for easy city driving.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ease of Use",
                    "description": "Vehicles with automatic features are often advertised as user-friendly.",
                    "example": "The motorcycle's automatic gears make it simple to ride.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "ef17abab-ab57-4e87-99dd-d70dad558f9c",
            "de": "Something that is automatic is certain to happen as a result of a rule or policy",
            "ty": "adjective",
            "ex": "If you are late three times, you will receive an automatic penalty.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "automatic penalty",
                " automatic dismissal",
                " automatic deduction"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ef17abab-ab57-4e87-99dd-d70dad558f9c.webp",
            "Tips": [
                {
                    "title": "Guaranteed Outcome",
                    "description": "'Automatic' can mean an outcome is guaranteed by rules, without room for discretion.",
                    "example": "His top test scores guaranteed him an automatic place on the team.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Consequence Awareness",
                    "description": "Awareness of automatic consequences might influence people's decisions or behaviors.",
                    "example": "The automatic fine for littering discourages people from doing it.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "3408eb27-52c8-4c5a-affe-ecdd5f560ed7",
            "de": "Refers to a firearm that can fire continuously as long as the trigger is pressed",
            "ty": "adjective",
            "ex": "The suspect was armed with an automatic weapon.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "automatic weapon",
                " automatic fire",
                " automatic rifle"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3408eb27-52c8-4c5a-affe-ecdd5f560ed7.webp",
            "Tips": [
                {
                    "title": "Continuous Firepower",
                    "description": "'Automatic' weapons can fire multiple rounds with one trigger pull.",
                    "example": "Soldiers are trained to use automatic rifles in combat.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Military Associations",
                    "description": "‘Automatic’ can have a militaristic or violent connotation due to its association with weapons.",
                    "example": "Action movies often feature heroes brandishing automatic weapons.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Instinctive": {
            "wordRoot": "Instinctive",
            "wordDefinition": "Instinctive refers to something that is done as a result of innate behavior or natural impulse. For example, a baby's ability to suckle for milk is instinctual.\n\nAutomatic can describe actions that are learned through repetition, while instinctive describes actions that are innate or natural.\n\nActivities such as typing, driving, or playing an instrument can become automatic with practice, while actions like breathing or blinking are instinctive.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1390c577-7abe-4919-93d3-8a6b6821620c.webp"
        },
        "Involuntary": {
            "wordRoot": "Involuntary",
            "wordDefinition": "Involuntary refers to actions or responses that are done without intending to do them, but cannot be consciously controlled.\n\nFor example, blinking, shivering, or sneezing are involuntary actions that happen automatically, but we can't stop them from happening.\n\nAutomatic refers to actions that are done without conscious effort or thought, while involuntary refers to actions that happen automatically without conscious control.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4ad72991-aa28-48af-855e-b30c713efdf7.webp"
        },
        "Mechanical": {
            "wordRoot": "Mechanical",
            "wordDefinition": "Mechanical refers to a system or device that is operated by a human, using mechanical parts. For example, a mechanical watch works through the movement of gears and springs, which are powered by the winding of a spring by a person.\n\nAutomatic refers to something that runs by itself while mechanical refers to something operated by a person using mechanical means.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1377df11-01c0-4baf-9159-a293911d758c.webp"
        },
        "Reflexive": {
            "wordRoot": "Reflexive",
            "wordDefinition": "Reflexive refers to an involuntary or automatic response to a stimulus or situation. For example, when someone touches a hot stove, their reflexive response is to immediately withdraw their hand.\n\nBoth words describe actions that occur without conscious thought, but automatic usually describes actions that have been learned through deliberate practice, while reflexive describes innate responses that happen without thought.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7ce0628c-a8ce-4390-91bd-9e362d705382.webp"
        },
        "Robotic": {
            "wordRoot": "Robotic",
            "wordDefinition": "Robotic refers to a device or process that is controlled by a computer program and can perform complex tasks that require some intelligence.\n\nFor example, a robotic arm can perform delicate surgery on a patient with precision and accuracy.\n\nAutomatic refers to a device that can work on its own, whereas robotic refers to a device that can work on its own and can perform complex tasks with some intelligence involved.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aac8de99-a6b1-48ae-bedf-80ae4e35e617.webp"
        },
        "Routine": {
            "wordRoot": "Routine",
            "wordDefinition": "Routine refers to a set of actions that are performed regularly, often in a specific order. For example, brushing your teeth before bed is part of many people's nightly routine.\n\nAutomatic is applicable to actions that are almost like reflexes or instinctual, while routine is applicable to actions that we consciously choose to do as part of a structured set of actions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b4e68cbb-0d92-45e3-aa52-aa75ad0aeee4.webp"
        },
        "Spontaneous": {
            "wordRoot": "Spontaneous",
            "wordDefinition": "Spontaneous means that something happens naturally or without any planning. For example, a sudden outburst of laughter or an unplanned adventure can be spontaneous.\n\nSpontaneous is often used to describe things that happen unexpectedly or without planning, like a spontaneous party or a spontaneous act of kindness.\n\nAutomatic refers to something that happens without conscious thought, while spontaneous refers to something that happens naturally or unexpectedly without any planning.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c5d3271e-d7a1-4a71-9ae4-a97abd0e8860.webp"
        },
        "Unconscious": {
            "wordRoot": "Unconscious",
            "wordDefinition": "Unconscious refers to something that is done without awareness or control. For example, breathing is an unconscious action, meaning it happens automatically without needing to think about it.\n\nAutomatic is applicable when someone is doing something without thinking, but can still control it, and unconscious is applicable when something is happening automatically, without any awareness or control.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bce24c27-9524-48c3-a7fa-ff00b91a0319.webp"
        }
    },
    "videos": [
        {
            "Text": " So I don't think it's any different than photography. - So you can see your aperture. That's what your camera's doing automatically. There's only three things cameras do. So you have a sensor. You have an aperture and a shutter. That's what a camera is. - That's right, yep. - Everything with those basics. - You know, we always say art imitates life.",
            "Title": "Photography as...",
            "VideoId": "aL4qJjWPjn8",
            "Controls": "start=474"
        },
        {
            "Text": " When a threat triggers our fight or flight response, our bodies prepare for danger by releasing chemicals that change how our brains and bodies function. This automatic response jumpstarts systems that can aid in survival. They do this by making sure we have enough energy and are protected from feeling pain,",
            "Title": "Why is being scared so...",
            "VideoId": "oetVvR5RQUs",
            "Controls": "start=36"
        },
        {
            "Text": " to your retirement plan if you go and switch through the ardent signup mechanism from being one which is about automatically defaulting to opt in rather than opting out retirement savings get boosted quite dramatically secondly we seem to have lost sight that in college today the biggest ideas are",
            "Title": "The surprising key to...",
            "VideoId": "ugr2D4wYf2A",
            "Controls": "start=128"
        },
        {
            "Text": " Scars. After all, immortality doesn't automatically translate to invincibility, it just means you cannot die. But it doesn't guarantee what condition you'll be alive in. Look at your body and count how many scars you have. If you have made this many permanent scars within your life,",
            "Title": "If superpowers were...",
            "VideoId": "uvMiz0-nPxs",
            "Controls": "start=164"
        },
        {
            "Text": " We would thus leverage its intelligence as much as possible to solve the problem of value-loading. This can happen, and the outcome could be very good for humanity. But it doesn't happen automatically. The initial conditions for the intelligence explosion",
            "Title": "What happens when our...",
            "VideoId": "MnT1xgZgkpk",
            "Controls": "start=855"
        },
        {
            "Text": " will only continue to spur greater advances in automatic translation. Perhaps by the time we encounter intergalactic life forms, we'll be able to communicate with them through a tiny gizmo, or we might have to start compiling that dictionary, after all.",
            "Title": "How computers translate...",
            "VideoId": "X4BmV2t83SM",
            "Controls": "start=250"
        },
        {
            "Text": " And emotion recognition software can help treat mental disorders or even provide people with low-cost automated psychotherapy. Despite the potential benefits, the prospect of a massive network automatically scanning our photos, communications,",
            "Title": "Can machines read your...",
            "VideoId": "QFk3e5PcK7s",
            "Controls": "start=195"
        },
        {
            "Text": " resurface after around five and when they're sleeping this is an automatic process if they sink beneath the water automatically their bodies raise themselves up so they can breathing they don't even have to come to land pretty",
            "Title": "Africa's Deadliest...",
            "VideoId": "ZIGywWDfwzc",
            "Controls": "start=95"
        },
        {
            "Text": " so that we're equipped to deal with risks from the outside world. Think about it. Our automatic scratching response would dislodge anything harmful that's potentially lurking on our skin, like a harmful sting, a biting insect,",
            "Title": "Why do we itch? - Emma...",
            "VideoId": "0NGei3H8yRk",
            "Controls": "start=146"
        },
        {
            "Text": " to reveal truths hidden within their minds. Occasionally, instead of picturing something and then drawing it, they let their hands move automatically and would later tease out familiar figures that appeared in the scribbles.",
            "Title": "What is abstract...",
            "VideoId": "oG9jQBj1eqE",
            "Controls": "start=112"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/karl-marlantes.webp",
            "Text": "In the military I could exercise the power of being automatically respected because of the medals on my chest, not because I had done anything right at the moment to earn that respect. This is pretty nice. It's also a psychological trap that can stop one's growth and allow one to get away with just plain bad behavior.",
            "Title": "American Author",
            "Name": "Karl Marlantes"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joanna-coles.webp",
            "Text": "Every time I've been offered a new job, I've automatically said, 'Oh, I don't think you want me for that job.' It's sort of a weird female - or, at least, it is in me - a weird female defense, when, in fact, what you want to do is scream, 'Hooray, I want to do this!",
            "Title": "American Editor",
            "Name": "Joanna Coles"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gabby-barrett.webp",
            "Text": "A few people have asked me about the women agenda on country radio. I can only speak for myself on this, and all I have to say is that I'm very grateful, and thankful, that country radio has been so automatically accepting, and supportive, of me and my music.",
            "Title": "American Musician",
            "Name": "Gabby Barrett"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jenji-kohan.webp",
            "Text": "I think great writers should write great shows, and I have trouble with, like, what you are in life shouldn't automatically make you what you do in your art. It doesn't necessarily translate.",
            "Title": "American Director",
            "Name": "Jenji Kohan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hugh-prather.webp",
            "Text": "Almost any difficulty will move in the face of honesty. When I am honest I never feel stupid. And when I am honest I am automatically humble.",
            "Title": "American Writer",
            "Name": "Hugh Prather"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gijs-de-vries.webp",
            "Text": "There are no automatic links between poverty and terrorism. Among millions of poor people in the world, only a few turn to terrorism.",
            "Title": "Dutch Politician",
            "Name": "Gijs de Vries"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-j-blige.webp",
            "Text": "When you tell your truth, you are coming from a real place, so you are automatically a leader.",
            "Title": "American Musician",
            "Name": "Mary J. Blige"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henepola-gunaratana.webp",
            "Text": "When you have learned compassion for yourself, compassion for others is automatic.",
            "Title": "Sri Lankan Clergyman",
            "Name": "Henepola Gunaratana"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kathleen-troia-mcfarland.webp",
            "Text": "In the real world, words don't automatically translate into deeds.",
            "Title": "American Businesswoman",
            "Name": "Kathleen Troia McFarland"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-earl-jones.webp",
            "Text": "We children learned responsibility automatically.",
            "Title": "American Actor",
            "Name": "James Earl Jones"
        }
    ]
}