{
    "currentWord": {
        "wordRoot": "avoid",
        "id": 7291,
        "phonemic": "əˈvɔɪd|əˈvɔɪd\r",
        "bigId": "cd9d1e41-24b3-42b0-bd59-d43285479322",
        "wordForms": [
            "avoids",
            "avoiding",
            "avoided",
            "avoidable",
            "avoid"
        ]
    },
    "senses": [
        {
            "id": "cd9d1e41-24b3-42b0-bd59-d43285479322",
            "de": "To deliberately stay away from something or keep from doing something",
            "ty": "verb",
            "ex": "She keeps avoiding me every time I try to speak to her.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "avoid conflict",
                " avoid contact",
                " avoid danger"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cd9d1e41-24b3-42b0-bd59-d43285479322.webp",
            "Tips": [
                {
                    "title": "Social Avoidance",
                    "description": "Used when someone intentionally avoids social interaction with a person or group.",
                    "example": "Jim has been avoiding Sarah since their argument.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oU9y72LqGhhmOISdiblolUdbxfI.webp"
                },
                {
                    "title": "Deliberate Action",
                    "description": "Emphasizes the act is intentional, not accidental.",
                    "example": "She isn't just busy; she's avoiding meeting with you.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/LPqtuFY0tnagGIKmvkvyCRUggzA.webp"
                },
                {
                    "title": "Negative Context",
                    "description": "Often has a negative connotation, as it implies evasion or reluctance.",
                    "example": "Avoiding responsibilities will lead to more problems.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/0Uw9JkeTAhTV9hYaM0f7GBmETU.webp"
                }
            ]
        },
        {
            "id": "6876f307-5941-4e7a-86a3-0b9cba084b38",
            "de": "To stop something from happening",
            "ty": "verb",
            "ex": "Eating healthy can help avoid diseases.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "avoid accidents",
                " avoid injuries",
                " avoid complications"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6876f307-5941-4e7a-86a3-0b9cba084b38.webp",
            "Tips": [
                {
                    "title": "Preventive Measure",
                    "description": "Implies taking steps to prevent undesired outcomes or consequences.",
                    "example": "By studying regularly, you can avoid failing the exam.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Safety and Caution",
                    "description": "Often used in contexts related to safety, caution, and health.",
                    "example": "Wear a helmet to avoid head injuries while cycling.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Problem-Solving",
                    "description": "Carries the idea of being proactive to sidestep potential issues.",
                    "example": "Avoid problems with your computer by backing up your data.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "e8dac4f4-8968-4704-b48b-6253bf7d4c95",
            "de": "In law, to make something void",
            "do": "Legal",
            "ty": "verb",
            "ex": "The contract was avoided due to the fraudulent acts of one party.",
            "use": "",
            "co": "Legal",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "avoid a contract",
                " avoid a payment",
                " avoid a liability"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e8dac4f4-8968-4704-b48b-6253bf7d4c95.webp",
            "Tips": [
                {
                    "title": "Legal Specificity",
                    "description": "Used in legal terms to indicate voiding or annulling agreements or conditions.",
                    "example": "The judge ruled to avoid the agreement as it was signed under duress.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Legal Action",
                    "description": "Suggests a formal action taken to refute or cancel a legal commitment.",
                    "example": "You can avoid the penalty if you prove there was a misunderstanding.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Circumvent": {
            "wordRoot": "Circumvent",
            "wordDefinition": "Circumvent means to find a way to get around or bypass something. For example, if there is a traffic jam on the highway, you might try to circumvent it by taking a back road.\n\nThe main difference between these words is that avoid is used to prevent something from happening, while circumvent is used when you need to find a way to get around something that is in your way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c3654750-bd6a-4391-9e98-6861b59529d7.webp"
        },
        "Dodge": {
            "wordRoot": "Dodge",
            "wordDefinition": "Avoid means to keep away from something or not engage in it, while dodge means to move quickly aside or out of the way to avoid something.\n\nIf you're playing dodgeball and someone throws a ball at you, you might dodge the ball by quickly moving out of the way so it doesn't hit you.\n\nAvoid is used when you want to prevent or steer clear of something, while dodge is used when you need to quickly react and move to avoid something that is coming towards you.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0cb5ae52-8dec-4f0d-b600-f964ad62245c.webp"
        },
        "Elude": {
            "wordRoot": "Elude",
            "wordDefinition": "Elude means to escape or evade something or someone, especially by being very clever or skillful. For example, if you're playing tag and you run so fast and change direction so quickly that the person chasing you cannot catch you, you elude them.\n\nAvoid is to intentionally stop doing something, while elude is to unintentionally escape from something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8c63d52b-49b7-4925-a5f1-72054ae75330.webp"
        },
        "Escape": {
            "wordRoot": "Escape",
            "wordDefinition": "Escape means to leave a situation or place that is dangerous, difficult, or uncomfortable. It is applicable when you are in a situation that you need to get away from quickly or when you want to leave a place where you feel trapped or uncomfortable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3b9b4242-fa7f-41ec-956d-2abb39bb1d86.webp"
        },
        "Eschew": {
            "wordRoot": "Eschew",
            "wordDefinition": "Avoid and eschew both refer to steering clear of something, but they have different nuances.\n\nEschew implies that you are consciously rejecting and avoiding something that you believe is morally or ethically wrong.\n\nFor example, you might eschew buying products made using child labour because you believe it is wrong to support such practices.\n\nTo put it simply, avoid means to stay away from something because you don't want to deal with it, while eschew means to avoid something because you believe it is wrong.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3a25b498-2d83-4868-9d99-e874ab8bf848.webp"
        },
        "Evade": {
            "wordRoot": "Evade",
            "wordDefinition": "Avoid and evade have similar meanings, but there is a slight difference in usage. Avoid means to intentionally stay away from something or someone in order to stay safe or prevent a negative outcome.\n\nEvade means to avoid or escape something or someone by being clever or deceptive. It often implies that someone is actively trying to catch or harm you, and you are trying to avoid them or their actions.\n\nFor example, a burglar might try to evade the police by hiding or taking a different route, or a politician might evade questions from journalists by changing the subject or giving vague answers.\n\nAvoid is generally used in a more straightforward and direct sense, while evade has a connotation of being sneaky or deceptive.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5f5cf244-7918-4de8-b2e7-35e6965938e1.webp"
        },
        "Shun": {
            "wordRoot": "Shun",
            "wordDefinition": "Shun means to deliberately avoid, ignore or reject (someone or something) often due to disapproval or dislike.\n\nAvoid means to stay away from something, while shun means to actively reject or ignore something or someone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d1a4fc43-7d92-4348-b03b-c1e3be0964cc.webp"
        },
        "Sidestep": {
            "wordRoot": "Sidestep",
            "wordDefinition": "Both ‘avoid’ and ‘sidestep’ mean not to confront something directly, but ‘avoid’ typically means to stay away from something or someone to prevent harm or negative consequences, while ‘sidestep’ means to avoid something by taking an indirect or evasive action.\n\nHowever, if someone asks a question that you do not want to answer, you might sidestep the issue by changing the subject or not answering directly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1472b006-d4c7-4d2f-bd97-4009d1a72239.webp"
        }
    },
    "videos": [
        {
            "Text": " because it makes us better understand this beautiful world we live in. And in doing that, it helps us avoid the pitfalls of this painful world we live in. There are sciences that help us in this way quite directly. Oncological science, for example. And there are others we look at from afar, with envy sometimes,",
            "Title": "Eduardo Sáenz de...",
            "VideoId": "pGlZi2SwETc",
            "Controls": "start=253"
        },
        {
            "Text": " are far less serious that these examples, and may even be harmless. But it's still worthwhile to be aware of telltale clues, like minimal self-references, negative language, simple explanations and convoluted phrasing. It just might help you avoid an overvalued stock,",
            "Title": "The language of lying —...",
            "VideoId": "H0-WkpmTPrM",
            "Controls": "start=303"
        },
        {
            "Text": " swims into the tentacles and steals the food from the siphonophore the shield over its eyes protects them from the stinging cells of the siphonophore tentacles the barreleye can also rotate its eyes to avoid predators or avoid being captured by scientists",
            "Title": "Fish With Transparent...",
            "VideoId": "Zoygy-8PTtU",
            "Controls": "start=64"
        },
        {
            "Text": " Heart attacks may be common, but they don't have to be inevitable. A healthy diet, avoiding tobacco use, staying fit, and enjoying plenty of sleep and lots of laughter all go a long way in making sure your body's most important muscle keeps on beating.",
            "Title": "What happens during a...",
            "VideoId": "3_PYnWVoUzM",
            "Controls": "start=259"
        },
        {
            "Text": " because they're afraid it will dim their emotions and destroy their creativity. But modern psychiatry is actively trying to avoid that. Today, doctors work with patients on a case-by-case basis to administer a combination of treatments and therapies",
            "Title": "What is bipolar...",
            "VideoId": "RrWBhVlD1H8",
            "Controls": "start=276"
        },
        {
            "Text": " Yet, dependence on another to justify our existence easily leads to boredom and power games. To avoid this trap, Beauvoir advised loving authentically, which is more like a great friendship. Lovers support each other in discovering themselves,",
            "Title": "Why do we love? A...",
            "VideoId": "yJSiUm6jvI0",
            "Controls": "start=289"
        },
        {
            "Text": " that for every dollar spent on current policies on existing subsidies to solar and wind will avoid about 3 cents of climate damage that's a very poor way to invest in the world but if we spent that same dollar on researchers we could",
            "Title": "Economics of climate...",
            "VideoId": "SEjNVWV5jbs",
            "Controls": "start=238"
        },
        {
            "Text": " Afraid of being eaten, or just to avoid further suffering, they committed suicide or starved themselves, believing that in death, their souls would return home. Those who survived were completley dehumanized, treated as mere cargo.",
            "Title": "The Atlantic slave...",
            "VideoId": "3NXC4Q_4JVg",
            "Controls": "start=198"
        },
        {
            "Text": " avoid comparing it to times you've felt down. Comparing what they're experiencing to normal, temporary feelings of sadness can make them feel guilty for struggling. Even just talking about depression openly can help.",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=217"
        },
        {
            "Text": " Dance for his life. He will need a show-stopping trick to avoid becoming lunch.",
            "Title": "Spider Dances For His...",
            "VideoId": "PQbScg3r1oQ",
            "Controls": "start=122"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ben-carson.webp",
            "Text": "It's very important for people to know themselves and understand what their value system is, because if you don't know what your value system is, then you don't know what risks are worth taking and which ones are worth avoiding.",
            "Title": "American Scientist",
            "Name": "Ben Carson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yuna.webp",
            "Text": "Being in the public eye, you can't really avoid a lot of questions. A lot of questions are being thrown at you, whether it's about your personal life or your personal beliefs, and I'm happy to answer them all.",
            "Title": "Malaysian Musician",
            "Name": "Yuna"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/emraan-hashmi.webp",
            "Text": "Every married man who wants peace in the relationship, should learn the trick to avoid that one question - 'How is the food?",
            "Title": "Indian Actor",
            "Name": "Emraan Hashmi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/theodore-roosevelt.webp",
            "Text": "Wars are, of course, as a rule to be avoided; but they are far better than certain kinds of peace.",
            "Title": "American President",
            "Name": "Theodore Roosevelt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-kerouac.webp",
            "Text": "Avoid the world, it's just a lot of dust and drag and means nothing in the end.",
            "Title": "American Novelist",
            "Name": "Jack Kerouac"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/david-walton.webp",
            "Text": "I actively avoided responsibility for as long as I possibly could.",
            "Title": "American Actor",
            "Name": "David Walton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/aristotle.webp",
            "Text": "The aim of the wise is not to secure pleasure, but to avoid pain.",
            "Title": "Greek Philosopher",
            "Name": "Aristotle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/noomi-rapace.webp",
            "Text": "It's better to not be afraid of things and not avoid things.",
            "Title": "Swedish Actress",
            "Name": "Noomi Rapace"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/derren-brown.webp",
            "Text": "In real life, when I can avoid anything stressful, I do.",
            "Title": "English Entertainer",
            "Name": "Derren Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/virginia-woolf.webp",
            "Text": "You cannot find peace by avoiding life.",
            "Title": "British Author",
            "Name": "Virginia Woolf"
        }
    ]
}