{
    "currentWord": {
        "wordRoot": "basis",
        "id": 14396,
        "phonemic": "ˈbeɪsɪs|ˈbeɪsɪs\r",
        "bigId": "bccc858d-df5d-436a-9b43-32ca192371e8",
        "wordForms": [
            "bases",
            "basis"
        ]
    },
    "senses": [
        {
            "id": "bccc858d-df5d-436a-9b43-32ca192371e8",
            "de": "The main part of something that it is built on or from which something can grow.",
            "ty": "noun",
            "ex": "She built her understanding of math on the basis of her teacher's explanations.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "on the basis of",
                " the basis for",
                " basis of understanding"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bccc858d-df5d-436a-9b43-32ca192371e8.webp",
            "Tips": [
                {
                    "title": "Building Blocks",
                    "description": "Think of 'basis' as the foundational layer or starting blocks of a larger structure or concept.",
                    "example": "The basic rules of soccer form the basis of the game.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/IENVny1K4XWZRfgcno8DTfBo4WI.webp"
                },
                {
                    "title": "Growth Platform",
                    "description": "'Basis' implies something is set up from which further development or learning can occur.",
                    "example": "The principles you've learned are the basis for advancing to more complex topics.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/08b4cd2YY8tnPAGrjqs03WY4Wo.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "95d7d3c5-f6cf-4de5-97da-4e08bf388d11",
            "de": "The main reason or cause for something to happen.",
            "do": "Legal",
            "ty": "noun",
            "ex": "There is not a legal basis for the landlord to evict the tenant.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "legal basis",
                " basis for action",
                " basis for decision"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/95d7d3c5-f6cf-4de5-97da-4e08bf388d11.webp",
            "Tips": [
                {
                    "title": "Cause and Effect",
                    "description": "'Basis' in legal contexts refers to a main cause or reason that explains a decision or action.",
                    "example": "The jury reached a verdict on the basis of undeniable evidence.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Argument Grounds",
                    "description": "In legal situations, the 'basis' is the solid ground on which arguments are built.",
                    "example": "Her appeal had a strong legal basis and was therefore accepted.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "52178bc0-531d-421a-aa7c-322047659945",
            "de": "The system or set of methods used in a particular activity.",
            "ty": "noun",
            "ex": "The new curriculum forms the basis for a more interactive approach to teaching.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "basis for a system",
                " basis for teaching",
                " basis for calculations"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/52178bc0-531d-421a-aa7c-322047659945.webp",
            "Tips": [
                {
                    "title": "Methodology",
                    "description": "In certain contexts, 'basis' signifies the preferred methods or systems used to achieve results.",
                    "example": "The research was conducted on the basis of a peer-reviewed methodology.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "ba0fe160-6428-41f3-b260-f43ff42e8f67",
            "de": "In finance, the difference between the spot price of a deliverable commodity and the forward price of the futures contract.",
            "do": "Finance",
            "ty": "noun",
            "ex": "Traders are trying to predict the future direction of the basis.",
            "use": "",
            "co": "Financial",
            "re": "",
            "tp": "",
            "cl": [
                "basis for trade",
                " predicting the basis",
                " understanding the basis"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ba0fe160-6428-41f3-b260-f43ff42e8f67.webp",
            "Tips": [
                {
                    "title": "Price Calculation",
                    "description": "In finance, 'basis' can be the calculation from which trading decisions are made.",
                    "example": "They assessed the crop's value on the basis of current market trends.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Market Indicator",
                    "description": "'Basis' is often used to judge the profitability of a financial trade or investment.",
                    "example": "Investors use the historical basis to predict future profits.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "77d72e8b-8376-4d3f-88e8-b9da4365b2be",
            "de": "A starting point from which something can develop.",
            "ty": "noun",
            "ex": "These techniques will form the basis of our next discussion.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "form the basis",
                " basis for discussion",
                " basis for development"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/77d72e8b-8376-4d3f-88e8-b9da4365b2be.webp",
            "Tips": [
                {
                    "title": "Conversation Starter",
                    "description": "'Basis' can be the key concept or topic that initiates a discussion or project.",
                    "example": "Our conversation will have the latest study as its basis.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Development Foundation",
                    "description": "It signifies the underlying idea or concept that inspires further development or research.",
                    "example": "The work of past scientists has served as the basis for modern technological advances.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Bedrock": {
            "wordRoot": "Bedrock",
            "wordDefinition": "Bedrock refers to a firm and unshakable foundation; it is the strongest and most solid foundation upon which something can be built.\n\nSo, while both words refer to a foundation or support, basis is more general and can be used in a variety of contexts, whereas bedrock has a stronger, more foundational connotation and describes something that is essential and unmovable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4506d23e-d4ba-4923-a0e3-935689284439.webp"
        },
        "Bottom": {
            "wordRoot": "Bottom",
            "wordDefinition": "Bottom typically refers to the lowest part of something.\n\nIt can describe physical objects, such as the bottom of a bottle, or it can refer to a metaphorical aspect such as the lowest point in someone's life, like hitting rock bottom.\n\nBasis describes the reason or foundation for something while bottom often refers to the lowest part of something, either literally or metaphorically.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fb610e7e-33f3-4aa4-8aeb-b93f65e9db05.webp"
        },
        "Cornerstone": {
            "wordRoot": "Cornerstone",
            "wordDefinition": "Cornerstone refers to the most important part of something, upon which everything else is dependent.\n\nIt is the key or crucial part of something that holds everything else together. For example, in a building, the cornerstone is the stone placed at the junction of two walls, which provides strength and support to the entire structure.\n\nIn summary, both words are used to describe the foundation or important parts of something, but basis focuses more on the starting point, while cornerstone refers to the most important part that everything else relies on.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/60c62ca5-0e11-4ffb-85f3-6cba618e5a04.webp"
        },
        "Foundation": {
            "wordRoot": "Foundation",
            "wordDefinition": "Both basis and foundation refer to something that is fundamental or supports something else, but used in different contexts.\n\nFoundation usually refers to the physical or metaphorical structure that provides support or stability. For example, \"The foundation of the building was strong enough to withstand the earthquake.\".\n\nBasis refers to the underlying principle or reason, while foundation refers to the physical or metaphorical support.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/895aabff-883e-4978-a168-56cd4416efd9.webp"
        },
        "Groundwork": {
            "wordRoot": "Groundwork",
            "wordDefinition": "Groundwork refers to the work that is done in preparation for something.\n\nIt is used when talking about the initial steps that need to be taken before something can be accomplished. For example, before building a house, the groundwork must be laid, which includes things like digging foundation trenches and pouring concrete slabs.\n\nBasis focuses on the fundamental aspects of something, while groundwork focuses on the preparation and initial steps that need to be taken to accomplish something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/30c3bc48-9e75-4ed9-ab05-d43479458d54.webp"
        },
        "Premise": {
            "wordRoot": "Premise",
            "wordDefinition": "Premise refers to a statement or proposition that serves as the basis for an argument or theory. It's used to describe the underlying assumption or idea that a conclusion is based on.\n\nFor example, the premise of the movie is that a group of people are stranded on a desert island and must survive.\n\nBasis refers to the foundation of something, while premise refers to the idea or assumption that forms the foundation of an argument or theory.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cc5c18eb-b928-41a4-a891-4dde731bb016.webp"
        },
        "Root": {
            "wordRoot": "Root",
            "wordDefinition": "Root, on the other hand, refers to the origin or source of something. For example, the root of a word is the part that carries the meaning, such as the word 'tele' in 'television.'.\n\nBasis is applicable when referring to the underlying principle or foundation of something, while root is applicable when referring to the origin or source of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/91601ea6-1c9f-4ba8-8f96-c43c90b573d1.webp"
        },
        "Underpinning": {
            "wordRoot": "Underpinning",
            "wordDefinition": "Underpinning refers to the support or foundation that gives strength or stability to something.\n\nUnderpinning describes the framework, structure, or foundation of something, without which it could not exist.\n\nFor instance, the underpinning of a tall building is its strong and deep foundation.\n\nOverall, while basis refers to the essential or fundamental part of a process or structure, underpinning refers to the support or foundation that provides strength and stability.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e48334d3-30aa-4fce-9cfd-efb058d8a9e7.webp"
        }
    },
    "videos": [
        {
            "Text": " that suggests there might be two kinds of laughs that we have. So it seems possible that the neurobiology for helpless, involuntary laughter, like my parents lying on the floor screaming about a silly song, might have a different basis to it than some of that more polite social laughter that you encounter, which isn't horrible laughter,",
            "Title": "Why we laugh PIPE Sophie...",
            "VideoId": "UxLRv0FEndM",
            "Controls": "start=372"
        },
        {
            "Text": " know an alphabet is a set of letters that forms the basis of all language and communication second the name provides a playful link back to the companies underneath g for google c for calico n for nest x and so on third the name encourages wall street investors buy this stock and you're making an alpha bet one that will",
            "Title": "How to create a great...",
            "VideoId": "rzbXht7MJVM",
            "Controls": "start=278"
        },
        {
            "Text": " The statement is short and direct, calling the child by name and addressing his role in her life. So how can you apply these lie-spotting techniques to your life? First, remember that many of the lies we encounter on a daily basis are far less serious that these examples, and may even be harmless.",
            "Title": "The language of lying —...",
            "VideoId": "H0-WkpmTPrM",
            "Controls": "start=291"
        },
        {
            "Text": " rapidly well life is really are sort of the perfect storm I think in many ways this basis species goes they have a lot of characteristics which make them very successful in the invaded range they reproduce very early in life so they reach maturity they grow very rapidly",
            "Title": "Divers Fight the...",
            "VideoId": "GzaeYzAC8Ro",
            "Controls": "start=15"
        },
        {
            "Text": " muscles need your constant attention because the way you treat them on a daily basis determines whether they will wither or grow. Say you're standing in front of a door, ready to pull it open. Your brain and muscles are perfectly poised to help you achieve this goal.",
            "Title": "What makes muscles grow?...",
            "VideoId": "2tM1LFFxeKg",
            "Controls": "start=20"
        },
        {
            "Text": " Allow young musicians to play and perform with accomplished musicians on a daily basis. Encourage young musicians to play more than they practice. The more they play the more they will practice on their own. Music comes from the musician, not the instrument.",
            "Title": "Music as a language -...",
            "VideoId": "3yRMbH36HRE",
            "Controls": "start=220"
        },
        {
            "Text": " because they're afraid it will dim their emotions and destroy their creativity. But modern psychiatry is actively trying to avoid that. Today, doctors work with patients on a case-by-case basis to administer a combination of treatments and therapies",
            "Title": "What is bipolar...",
            "VideoId": "RrWBhVlD1H8",
            "Controls": "start=276"
        },
        {
            "Text": " vomiting, and, in rare instances, seizures or death. But that's a pretty extreme situation. On a normal, day-to-day basis, maintaining a well-hydrated system is easy to manage for those of us fortunate enough to have access to clean drinking water.",
            "Title": "What would happen if you...",
            "VideoId": "9iMGFqMmUFs",
            "Controls": "start=181"
        },
        {
            "Text": " So how did it happen that people all over the world knock on wood, or avoid stepping on sidewalk cracks? Well, although they have no basis in science, many of these weirdly specific beliefs and practices",
            "Title": "Where do superstitions...",
            "VideoId": "quOdF1CAPXs",
            "Controls": "start=18"
        },
        {
            "Text": " camera tip and that bear broke that camera by setting multiple traps the team covers their bases so when we set up our character we checked the camera tap that one and it had very nice images",
            "Title": "Snow Leopards: Ghosts in...",
            "VideoId": "O1hfnMLqsDA",
            "Controls": "start=377"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yasmine-hamdan.webp",
            "Text": "Maybe I was blessed that my main drive was purely selfish. I needed to make something, make my life better, wider, have poetry in my life, have something that gives me hope on an everyday basis. That was my main drive all along, really.",
            "Title": "Lebanese Musician",
            "Name": "Yasmine Hamdan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erin-gruwell.webp",
            "Text": "I have learned that, although I am a good teacher, I am a much better student, and I was blessed to learn valuable lessons from my students on a daily basis. They taught me the importance of teaching to a student - and not to a test.",
            "Title": "American Writer",
            "Name": "Erin Gruwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/emily-procter.webp",
            "Text": "Getting pregnant wasn't easy, and I found that devastating. I really beat myself up for waiting so long when I'd always wanted children and family had been the basis of my happiness my whole life.",
            "Title": "American Actress",
            "Name": "Emily Procter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luka-modric.webp",
            "Text": "I believe that I've improved a lot as a player and a person, because being surrounded by great players on a daily basis helps your development out on the pitch.",
            "Title": "Croatian Athlete",
            "Name": "Luka Modric"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zbigniew-brzezinski.webp",
            "Text": "It is important to ask ourselves, as citizens, whether a world power can provide global leadership on the basis of fear and anxiety.",
            "Title": "American Politician",
            "Name": "Zbigniew Brzezinski"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henri-nouwen.webp",
            "Text": "Prayer is the beginning and the end, the source and the fruit, the core and the content, the basis and the goal of all peacemaking.",
            "Title": "Dutch Clergyman",
            "Name": "Henri Nouwen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oscar-wilde.webp",
            "Text": "Fathers should be neither seen nor heard. That is the only proper basis for family life.",
            "Title": "Irish Poet",
            "Name": "Oscar Wilde"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/peter-mullan.webp",
            "Text": "Truth is I don't think God on a daily basis. I think politics, science.",
            "Title": "Scottish Actor",
            "Name": "Peter Mullan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bryant-h-mcgill.webp",
            "Text": "Control thought-forms are the basis of our deepest moral crisis.",
            "Title": "American Author",
            "Name": "Bryant H. McGill"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/laurie-colwin.webp",
            "Text": "The sharing of food is the basis of social life.",
            "Title": "American Author",
            "Name": "Laurie Colwin"
        }
    ]
}