{
    "currentWord": {
        "wordRoot": "board",
        "id": 13573,
        "phonemic": "bɔːd|bɔːrd\r",
        "bigId": "aa257296-1bb8-4ee9-8d85-87621e6a0cb0",
        "wordForms": [
            "boards",
            "boarding",
            "boarded",
            "board"
        ]
    },
    "senses": [
        {
            "id": "aa257296-1bb8-4ee9-8d85-87621e6a0cb0",
            "de": "A long, flat, thin piece of wood or other hard material",
            "ty": "noun",
            "ex": "She cut the cheese on a wooden board.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "chopping board",
                " drawing board",
                " ironing board"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/aa257296-1bb8-4ee9-8d85-87621e6a0cb0.webp",
            "Tips": [
                {
                    "title": "Material Varieties",
                    "description": "The word 'board' can refer to materials other than wood, like plastic or metal boards.",
                    "example": "The students used a large plastic board for their project.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/lnUWCNy0HyF5eXz6a39CYVXtKG8.webp"
                },
                {
                    "title": "Physical Descriptions",
                    "description": "'Board' often implies a smooth, flat surface and can vary in size and thickness.",
                    "example": "The craftsman polished the board until it was perfectly smooth.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/RMNaKdRE7x8rCDTl65ucKIxBDY.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "4fe166d0-0418-4027-94d2-f1c2eb7b71ea",
            "de": "To get on a train, plane, or ship",
            "ty": "verb",
            "ex": "Passengers are now boarding.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "board the plane",
                " board the train",
                " boarding gate"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4fe166d0-0418-4027-94d2-f1c2eb7b71ea.webp",
            "Tips": [
                {
                    "title": "Transportation Context",
                    "description": "When used as a verb, 'board' typically involves a process or line before entry.",
                    "example": "We waited to board the ship, tickets in hand.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Immediacy",
                    "description": "Telling someone to 'board' can suggest urgency, like needing to hurry.",
                    "example": "Please board quickly, the bus is about to leave!",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "26246d8b-d36e-41ff-adc4-5e97ece9ec80",
            "de": "A group of people who have power to make decisions and control a company or other organization",
            "do": "Business",
            "ty": "noun",
            "ex": "The board of directors has approved the budget for next year.",
            "use": "",
            "co": "Business",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "board of directors",
                " governing board",
                " school board"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/26246d8b-d36e-41ff-adc4-5e97ece9ec80.webp",
            "Tips": [
                {
                    "title": "Decision Authority",
                    "description": "This 'board' is about people in charge; they make important decisions.",
                    "example": "The board will meet next week to decide on the merger.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Formality Level",
                    "description": "Discussing 'the board' usually occurs in formal or professional contexts.",
                    "example": "She presented her proposal to the board in the quarterly meeting.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "e7b7ae9f-f2bf-4040-ad26-b8ab685ca275",
            "de": "Meals provided regularly for money",
            "ty": "noun",
            "ex": "Room and board is included in the price.",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                "room and board",
                " board included",
                " board paid"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e7b7ae9f-f2bf-4040-ad26-b8ab685ca275.webp",
            "Tips": [
                {
                    "title": "Accommodation Inclusion",
                    "description": "Here, 'board' means meals are included with lodging for one price.",
                    "example": "The hotel offers room and board for all its guests.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Travel Relevance",
                    "description": "Understanding 'board' is useful when traveling, to know if meals are provided.",
                    "example": "Does the price include board, or should we find restaurants?",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "77cb1711-fbd6-4d75-a671-a1acb86c00b0",
            "de": "To cover or close with pieces of wood",
            "ty": "verb",
            "ex": "The windows were boarded up.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "board up the windows",
                " board up the doors",
                " boarded-up shop"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/77cb1711-fbd6-4d75-a671-a1acb86c00b0.webp",
            "Tips": [
                {
                    "title": "Protection or Privacy",
                    "description": "When you 'board up' something, it often suggests a need for security or privacy.",
                    "example": "They boarded up the house before the storm arrived.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Temporary Closure",
                    "description": "'Board up' can also mean that a place is temporarily closed or not in use.",
                    "example": "The boarded-up store will reopen after renovations.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "7a7c566a-8f09-47e6-8b33-9a776d169ebd",
            "de": "A thin, flat piece of material with a special function",
            "ty": "noun",
            "ex": "He got on his surfboard and rode the wave.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "surfboard",
                " snowboard",
                " circuit board",
                " ironing board"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7a7c566a-8f09-47e6-8b33-9a776d169ebd.webp",
            "Tips": [
                {
                    "title": "Specific Function",
                    "description": "This 'board' refers to items designed for specific activities or uses.",
                    "example": "He adjusted the bindings on his snowboard before heading downhill.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Sports Equipment",
                    "description": "'Board' can indicate specialized equipment in sports, like surfing or skateboarding.",
                    "example": "She waxed her surfboard to improve grip on the water.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Chart": {
            "wordRoot": "Chart",
            "wordDefinition": "Chart is a graphical representation of data or information.\n\nSo, in simple terms, a board is a surface, while a chart is a visual representation of data.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e09f5d09-a569-4c66-a65d-bc566af0a976.webp"
        },
        "Committee": {
            "wordRoot": "Committee",
            "wordDefinition": "A committee is a smaller group of people who are tasked with a specific project or objective, such as organizing an event or conducting research.\n\nCommittees are usually created by a larger group or governing body, such as a board, to focus on a particular area. A board is more general and has more power, while a committee is more specific and has less power.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9d52509a-5396-4c75-b98f-7b80ac7c36e7.webp"
        },
        "Council": {
            "wordRoot": "Council",
            "wordDefinition": "A council is a group of people who are elected or appointed to represent a larger group, such as a city or community. The council makes decisions and creates policies that affect the entire community.\n\nA board is used for managing a company or organization, while a council is used for governing a larger group or community.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8e246fcd-a06d-43e7-b708-d6a0e9ccb72c.webp"
        },
        "Panel": {
            "wordRoot": "Panel",
            "wordDefinition": "Panel generally refers to a flat section or piece of material that is one of many others, often used to make walls or screens.\n\nTo summarize, boards are generally stand-alone surfaces, while panels are part of a larger structure or system.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fdff8b14-83cd-47bd-8f72-80873fdce969.webp"
        },
        "Plank": {
            "wordRoot": "Plank",
            "wordDefinition": "A board is generally a flat rectangular piece of wood that is thicker and wider than a plank.\n\nA plank is a thinner and longer flat piece of wood that is often used for flooring, decking, and siding. Planks are also utilized in woodworking and crafting for creating decorative features and furniture.\n\nIn summary, while both are pieces of wood, boards are thicker and shorter, while planks are longer and thinner. Boards are primarily used in construction, while planks are used in both construction and woodworking.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/67ec4bda-902f-4ae4-a704-a96a5d4d7780.webp"
        },
        "Sheet": {
            "wordRoot": "Sheet",
            "wordDefinition": "Sheet typically refers to a thin, flat piece of material, such as paper or fabric.\n\nSheets can be used for a variety of purposes, such as wrapping, covering, or as a component of bedding.\n\nBoard refers to a flat, rigid surface used for writing, drawing or displaying information, while sheet refers to a thin, flat piece of material.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9e7dda07-7292-406a-ba36-b1937e533691.webp"
        },
        "Slab": {
            "wordRoot": "Slab",
            "wordDefinition": "Board and slab are both flat surfaces, but there are some differences:\n\nSlab is a thicker and heavier flat surface that is made of concrete, stone, or even wood. Slabs are commonly used for building foundations, countertops, or even as a decorative element.\n\nYou would use the term board in reference to a thin flat piece of wood, while slab is more appropriate when referring to a thicker, heavier and more durable surface, made of concrete or stone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/83d53cfb-0083-4948-a749-3887e7b72614.webp"
        },
        "Surface": {
            "wordRoot": "Surface",
            "wordDefinition": "Surface is a broader term that refers to the outermost layer of an object. This can include anything from the top of a table to the skin of an apple.\n\nBoard refers specifically to a flat, rectangular piece of material used for specific activities, while surface refers more broadly to the outer layer of any object.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dd00630f-784f-4ff5-94fe-608ef4ff4df5.webp"
        },
        "Table": {
            "wordRoot": "Table",
            "wordDefinition": "Both board and table refer to flat and usually rectangular surfaces, but they are used in different contexts.\n\nA table is a piece of furniture with a flat top and one or more legs used for supporting objects or people. Tables often have a specific use, such as dining tables, coffee tables, and study tables.\n\nIn summary, while both board and table refer to flat surfaces, a board is usually a functional surface used for specific tasks, while a table is a piece of furniture used for supporting objects or people.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7307fb46-dba5-42ca-ab70-f4122f84abbb.webp"
        }
    },
    "videos": [
        {
            "Text": " A lot of it is to do with your foot positioning on the board. -Okay. So, nice, wide stance... -Nice, wide stance always helps. Yeah. And you wanna keep your shoulders nice and straight. And then what am I doing with my hands? Just sort of Your hands can do whatever you wanna do. That's where the style comes in. Yeah. I imagine what my hands are gonna be doing is being alert.",
            "Title": "How To Levitate PIPE The...",
            "VideoId": "xDyJkFehDk0",
            "Controls": "start=1416"
        },
        {
            "Text": " So, ignoring the geometry lesson, and taking matters into their own hands, the bees went back to the drawing board to rethink their beehive design. One suggested triangles, \"We can use triangles. Look! They fit together perfectly.\" Another bee suggested squares. Finally, a third bee piped up and said,",
            "Title": "Why do honeybees love...",
            "VideoId": "QEzlsjAqADA",
            "Controls": "start=152"
        },
        {
            "Text": " As you notice, some of these, or all of the boards actually don't have leashes. So our mentor is going to be the leash. We're here and we're kind of here to be brave and courageous and move through the messiness of whatever comes up. We actually expect you to get somewhat triggered here,",
            "Title": "Surf Sisters - Ep. 2 PIPE...",
            "VideoId": "F3LS8CQJW4A",
            "Controls": "start=376"
        },
        {
            "Text": " but then I heard we had an assembly, so I came. And after listening to the students talk and seeing your performance, I thought I should organize my friends and we should go down to a board meeting and tell them that want to have advanced classes for A through G requirements.\"",
            "Title": "Stories: Legacies of who...",
            "VideoId": "5UD0RjZdUHk",
            "Controls": "start=476"
        },
        {
            "Text": " close all right guys we have a new project yes follow me there's some work we need to do to these old beams and old boards before we use them on the new cabin we have to go through and D mail them take every single nail out by hand well the gentleman said that these nails",
            "Title": "Deconstructing the Barn...",
            "VideoId": "9JK7rtGwnIM",
            "Controls": "start=11"
        },
        {
            "Text": " basically i i mean you are sure i don't like to lose i'm not sure many people do but the truth matters to me a lot really like sort of pathologically it matters to me okay so so you don't like to lose if in this case you are not successful in you know the board",
            "Title": "Elon Musk talks Twitter,...",
            "VideoId": "cdZZpaB2kDM",
            "Controls": "start=1856"
        },
        {
            "Text": " And two out of every three don't have an executive who's from a minority. And most of the minorities that are at that sort of level are non-executive board directors. So their influence isn't that great. I've told you a bunch of terrible things.",
            "Title": "What does my headscarf...",
            "VideoId": "18zvlz5CxPE",
            "Controls": "start=521"
        },
        {
            "Text": " and two passive parts, listening and reading. While a balanced bilingual has near equal abilities across the board in two languages, most bilinguals around the world know and use their languages in varying proportions.",
            "Title": "The benefits of a...",
            "VideoId": "MMmOLN5zBLY",
            "Controls": "start=41"
        },
        {
            "Text": " very fortunate when I was very little to learn the game of chess it gave me a lot it gave me a lot of success happiness over the chess board but it gave me much more it gave me life skills which I use",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=626"
        },
        {
            "Text": " between them they're making a life raft the ants most precious cargo the eggs and remaining pupae are safely stored on flying ants also board like helicopters on an aircraft carrier",
            "Title": "Ants Ingenious Survival...",
            "VideoId": "MJ4IjC512bg",
            "Controls": "start=56"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kenny-johnson.webp",
            "Text": "In my work, I just want to tell a story and help people go on a journey. I'm glad any fans that I do have, and I'm usually not aware of it until I get out there or read a message board. I want to thank everyone who follows my work.",
            "Title": "American Actor",
            "Name": "Kenny Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tupac-shakur.webp",
            "Text": "It's the game of life. Do I win or do I lose? One day they're gonna shut the game down. I gotta have as much fun and go around the board as many times as I can before it's my turn to leave.",
            "Title": "American Rapper",
            "Name": "Tupac Shakur"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kate-gosselin.webp",
            "Text": "With every positive, there is a negative across the board in life. It's about choosing to see the positive and working with the negative.",
            "Title": "American Celebrity",
            "Name": "Kate Gosselin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-anderson.webp",
            "Text": "A lot of teams see Lord's as a special place and up their games to try to get their names on the honours' board.",
            "Title": "English Athlete",
            "Name": "James Anderson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/julian-casablancas.webp",
            "Text": "Boarding school didn't feel like my world, I felt like an alien; people there had a lot of money.",
            "Title": "American Musician",
            "Name": "Julian Casablancas"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-rijkaard.webp",
            "Text": "Every manager feels a responsibility to his board of directors and the public and the players.",
            "Title": "Dutch Athlete",
            "Name": "Frank Rijkaard"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benson-henderson.webp",
            "Text": "Bellator is collecting talent, collecting world-level talent all across the board.",
            "Title": "American Mixed Martial Artist",
            "Name": "Benson Henderson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-schnatter.webp",
            "Text": "The board gets upset because I won't take a raise, but I've got plenty of money.",
            "Title": "American Businessman",
            "Name": "John Schnatter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yo-yo-honey-singh.webp",
            "Text": "It's very important to get friends on board, friends who make a difference.",
            "Title": "Indian Musician",
            "Name": "Yo Yo Honey Singh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/phil-mcgraw.webp",
            "Text": "Life is a full-contact sport, and there's a score up on the board.",
            "Title": "American Psychologist",
            "Name": "Phil McGraw"
        }
    ]
}