{
    "currentWord": {
        "wordRoot": "burden",
        "id": 19098,
        "phonemic": "ˈbɜːdn|ˈbɜːrdn\r",
        "bigId": "43769e46-bf98-4b00-88a8-5411156fb918",
        "wordForms": [
            "burdens",
            "burdening",
            "burdened",
            "burden"
        ]
    },
    "senses": [
        {
            "id": "43769e46-bf98-4b00-88a8-5411156fb918",
            "de": "Something heavy that you have to carry.",
            "ty": "noun",
            "ex": "The fireman lifted the burden of the old woman out of the burning house.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "carry a burden",
                " heavy burden",
                " bear the burden"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/43769e46-bf98-4b00-88a8-5411156fb918.webp",
            "Tips": [
                {
                    "title": "Physical Load",
                    "description": "Refers to actual objects that are difficult to carry due to weight or size.",
                    "example": "Hikers often share the burden of the group's supplies.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/LwOlT81TsboFCZzcUGTfkr4G80E.webp"
                },
                {
                    "title": "Not Always Literal",
                    "description": "Can describe emotional stress similar to carrying something heavy.",
                    "example": "After the loss, the grief became a heavy burden for her.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/EB7U00mE5XokvlBQtaqXhIAJT58.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "3bc269d0-e845-44ca-b04b-9ef617205261",
            "de": "A duty, responsibility, or obligation that causes worry or difficulty.",
            "ty": "noun",
            "ex": "The burden of proof rests on the prosecution in a criminal trial.",
            "use": "",
            "co": "General,Legal",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "bear the burden",
                " burden of proof",
                " ease the burden"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3bc269d0-e845-44ca-b04b-9ef617205261.webp",
            "Tips": [
                {
                    "title": "Emotional Weight",
                    "description": "Emphasizes that responsibilities can be emotionally draining, not just challenging.",
                    "example": "Being the sole provider for his family was a huge burden to him.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Legal Specificity",
                    "description": "In legal contexts, indicates specific responsibilities like 'burden of proof'.",
                    "example": "The defense lawyer explained the burden of proof to the jury.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Shared vs. Solo",
                    "description": "Can imply whether a responsibility is carried alone or with others.",
                    "example": "The community joined forces to ease the burden of rebuilding.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "127f3133-14e8-490c-bc83-5680902fde8c",
            "de": "To put a heavy load or responsibility on someone or something.",
            "ty": "verb",
            "ex": "She didn't want to burden him with her problems.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "burden with",
                " burden by",
                " burdened by debt"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/127f3133-14e8-490c-bc83-5680902fde8c.webp",
            "Tips": [
                {
                    "title": "Imposition Sense",
                    "description": "When used as a verb, it often suggests an unwelcome or unexpected imposition.",
                    "example": "He didn't want to burden his friend with his financial troubles.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Figurative Application",
                    "description": "Can refer to adding responsibilities that are not tangible or visible.",
                    "example": "The new regulations burdened the small business with extra paperwork.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "eb75fb61-5f70-4a36-ae52-67e413fc9de9",
            "de": "The main idea or theme in a speech, book, or other work.",
            "ty": "noun",
            "ex": "The burden of his speech was the importance of education.",
            "use": "",
            "co": "Literary,Academic",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "the burden of his speech",
                " the burden of the story",
                " the burden of the poem"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/eb75fb61-5f70-4a36-ae52-67e413fc9de9.webp",
            "Tips": [
                {
                    "title": "Core Message",
                    "description": "In creative works, 'burden' refers to a central message or takeaway.",
                    "example": "The burden of the novel is the protagonist's struggle with identity.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Interpretation Clue",
                    "description": "Indicates that understanding the 'burden' helps comprehend a work's full meaning.",
                    "example": "The teacher asked what the burden of the poem was to assess interpretation skills.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Duty": {
            "wordRoot": "Duty",
            "wordDefinition": "Burden refers to something that is heavy, oppressive or difficult to manage, whereas duty refers to a task or responsibility that needs to be fulfilled.\n\nDuty is something that you are responsible for, that you must fulfill or accomplish.\n\nDuties can be assigned or chosen, and they are often linked to personal, professional, or social expectations.\n\nFor example, a duty could be to attend school regularly, to do your homework, or to help your grandmother with grocery shopping.\n\nA burden is something difficult and unwanted that is imposed on you, while a duty is a task or responsibility that you are expected to accomplish as a matter of obligation or commitment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cfe1420e-b26e-4f5c-8633-1f0170966fe2.webp"
        },
        "Encumbrance": {
            "wordRoot": "Encumbrance",
            "wordDefinition": "Both burden and encumbrance refer to something that causes difficulty or inconvenience, but there is a slight difference in their usage.\n\nEncumbrance on the other hand, refers more specifically to something that is a hindrance or obstacle, such as a legal or financial burden that limits one's freedom or progress.\n\nFor example, a property with an encumbrance, such as a lien or mortgage, may be more difficult to sell.\n\nIn simpler terms, a burden is something that weighs you down, while an encumbrance is something that blocks your way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/25ec20c6-4790-49b2-aace-c66ab2405549.webp"
        },
        "Load": {
            "wordRoot": "Load",
            "wordDefinition": "Both burden and load refer to something that is heavy or difficult to carry or manage.\n\nHowever, burden often implies a more emotional or psychological weight, while load is generally used to describe a physical weight.\n\nYou might say that a truck is carrying a heavy load of bricks.\n\nBurden is more commonly used in figurative or emotional contexts, while load is used more often for physical, concrete objects.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a34b1675-564b-465d-a373-6662b65434c9.webp"
        },
        "Obligation": {
            "wordRoot": "Obligation",
            "wordDefinition": "Burden refers to something that is heavy or difficult to bear, while obligation refers to something that must be done because of a sense of duty or responsibility.\n\nOn the other hand, paying back a loan could be considered an obligation because it is required by a sense of responsibility to fulfill a financial commitment.\n\nWhile both words can be used in various contexts, burden is generally used to describe something that causes difficulty, while obligation describes something that is required or expected.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a56fcd05-e7ab-4e4c-9029-262fa52f9a98.webp"
        },
        "Onus": {
            "wordRoot": "Onus",
            "wordDefinition": "Both burden and onus refer to something that is difficult to bear or an obligation that is imposed upon someone.\n\nHowever, burden involves a feeling of weight or heaviness, while onus involves a legal or moral responsibility.\n\nA legal responsibility or duty imposed on an individual falls under the category of onus.\n\nBurden pertains to a heavy load or a difficult task, and onus pertains to a legal or moral obligation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f0d2d67e-d789-446f-b5a1-391dae8c7d40.webp"
        },
        "Pressure": {
            "wordRoot": "Pressure",
            "wordDefinition": "Pressure is a force that is exerted upon a person to do or achieve something.\n\nFor example, the pressure to do well on an exam can come from a student's desire to get good grades or from their parents' expectations.\n\nA burden is a difficult responsibility that a person has to deal with, while pressure is a force that pushes a person to perform or achieve something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ea98f6ac-450d-4701-9705-326a3215c943.webp"
        },
        "Responsibility": {
            "wordRoot": "Responsibility",
            "wordDefinition": "Responsibility refers to a duty or obligation that one has to fulfill, such as taking care of someone or completing a task.\n\nBurden refers to something negative that is difficult to handle while responsibility refers to something positive that one should take care of.\n\nThe term burden can be used when someone feels weighed down by something unpleasant, while responsibility can be applied when someone is expected to do something important or necessary.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e1aa0157-7e04-42ef-931f-32e1822a0685.webp"
        },
        "Weight": {
            "wordRoot": "Weight",
            "wordDefinition": "Both burden and weight refer to something that is heavy, but they are used in different contexts.\n\nWeight usually refers to the physical heaviness of an object or a person's body. For example, a box may be heavy in weight, or a person may be concerned about their weight if they are trying to lose or gain weight.\n\nBurden refers to heavy responsibilities, while weight refers to the physical heaviness of an object or person's body.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/19ead3f8-e96a-4169-883b-8c02fc670a50.webp"
        }
    },
    "videos": [
        {
            "Text": " one was an exporter of democracy and capitalism the other one is an exporter of soviet-style communism and there was an economic tension that's what kept the Cold War alive and well not coincidentally life liberty and the pursuit of happiness the only three things for which we will bear any burden",
            "Title": "What game theory teaches...",
            "VideoId": "0bFs6ZiynSU",
            "Controls": "start=288"
        },
        {
            "Text": " we can actually start to at least begin that process. And so when you talk about legibility and digital literacy, I find it difficult to imagine that we need to place the burden of digital literacy on users themselves. But whose responsibility is education in this new world?",
            "Title": "The nightmare videos of...",
            "VideoId": "v9EKV2nSU8w",
            "Controls": "start=923"
        },
        {
            "Text": " on limited, shared resources. An older female can further her genes without burdening her family by supporting her adult sons, who sire calves other families will raise. This might be why the females have evolved to stop reproducing entirely in middle age.",
            "Title": "Inside the killer whale...",
            "VideoId": "sQpGT1BgdX4",
            "Controls": "start=233"
        },
        {
            "Text": " in order not to lose the other. I will lose my freedom in order not to lose connection. And I will learn to love in a certain way that will become burdened with extra worry and extra responsibility and extra protection, and I won't know how to leave you",
            "Title": "The secret to desire in...",
            "VideoId": "sa0RUmGTCYY",
            "Controls": "start=946"
        },
        {
            "Text": " Lakota freed for a moment from all of his burdens wolves are not only social animals living together as families they are also a keystone species in that they help manage and bring stability",
            "Title": "Jim & Jamie Dutcher: The...",
            "VideoId": "d36MK94POaI",
            "Controls": "start=911"
        },
        {
            "Text": " can become a threat to my life, and I am tired. I am tired of carrying this invisible burden of other people's fears, and many of us are, and we shouldn't have to,",
            "Title": "How to deconstruct...",
            "VideoId": "RZgkjEdMbSw",
            "Controls": "start=948"
        },
        {
            "Text": " understanding the central importance of zangarbai places an even bigger burden on andrea's shoulders her presence here is not just preventing elephant deaths",
            "Title": "Protecting The Elephant...",
            "VideoId": "LZoX8jwlbSc",
            "Controls": "start=0"
        },
        {
            "Text": " maintenance is a real burden there will be no easy meals on this island walruses are the largest seals in the world they weigh over a ton and are",
            "Title": "ONE HOUR of Amazing...",
            "VideoId": "eEaZvEZye84",
            "Controls": "start=3477"
        },
        {
            "Text": " grooming or just playing it's he who shoulders the burden of responsibilities in truth his daughter is plenty big enough to keep up with the",
            "Title": "Parenthood Is Tough For...",
            "VideoId": "q5sogR8jh5w",
            "Controls": "start=145"
        },
        {
            "Text": " he has a mate for life both share the burden of raising their week old chick their puffling who needs five square meals a day",
            "Title": "Puffin Hunts Fish To...",
            "VideoId": "EIUJfXk3_3w",
            "Controls": "start=49"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "No other country in the world does what we do. On every issue, the world turns to us, not simply because of the size of our economy or our military might - but because of the ideals we stand for, and the burdens we bear to advance them.",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-schumacher.webp",
            "Text": "My kids are not known, and I think that is very important. So far they have lived a normal life, and will continue to do so. I feel they should have the possibility to live a free life without the burden of fame I have created.",
            "Title": "German Celebrity",
            "Name": "Michael Schumacher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hillary-clinton.webp",
            "Text": "And I will repeat today what I have said throughout this campaign. I will not raise taxes on the middle class. I will give you tax relief to help ease these burdens.",
            "Title": "American Politician",
            "Name": "Hillary Clinton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ernestine-rose.webp",
            "Text": "Much is said about the burdens and responsibilities of married men. Responsibilities indeed there are, if they but felt them: but as to burdens what are they?",
            "Title": "American Activist",
            "Name": "Ernestine Rose"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/samuel-johnson.webp",
            "Text": "Money and time are the heaviest burdens of life, and... the unhappiest of all mortals are those who have more of either than they know how to use.",
            "Title": "English Writer",
            "Name": "Samuel Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yvonne-orji.webp",
            "Text": "Any show that speaks to people of color feels the burden to never mess up, never make its characters look bad - to always get it right.",
            "Title": "Nigerian Actress",
            "Name": "Yvonne Orji"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oprah-winfrey.webp",
            "Text": "I'm black, I don't feel burdened by it and I don't think it's a huge responsibility. It's part of who I am. It does not define me.",
            "Title": "American Entertainer",
            "Name": "Oprah Winfrey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lin-dan.webp",
            "Text": "It is our responsibility, but not burden, to be champions.",
            "Title": "Chinese Athlete",
            "Name": "Lin Dan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tokugawa-ieyasu.webp",
            "Text": "Life is like unto a long journey with a heavy burden.",
            "Title": "Japanese Leader",
            "Name": "Tokugawa Ieyasu"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/napoleon-bonaparte.webp",
            "Text": "Respect the burden.",
            "Title": "French Statesman",
            "Name": "Napoleon Bonaparte"
        }
    ]
}