{
    "currentWord": {
        "wordRoot": "busy",
        "id": 13197,
        "phonemic": "ˈbɪzi|ˈbɪzi\r",
        "bigId": "51b0af2e-302d-47e1-902a-c6e319b7bc09",
        "wordForms": [
            "busier",
            "busiest",
            "busies",
            "busying",
            "busied",
            "busyness",
            "busy"
        ]
    },
    "senses": [
        {
            "id": "51b0af2e-302d-47e1-902a-c6e319b7bc09",
            "de": "Doing a lot of things",
            "ty": "adjective",
            "ex": "She's always busy with her schoolwork.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "busy day",
                " busy schedule",
                " busy life"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/51b0af2e-302d-47e1-902a-c6e319b7bc09.webp",
            "Tips": [
                {
                    "title": "Personal Priority",
                    "description": "Used to express that someone is focused on their personal tasks or goals.",
                    "example": "She's too busy to meet up; she's preparing for her exams.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/dWNGMYvZ6cIpmg5pZRgWiRZ8Isg.webp"
                },
                {
                    "title": "Not Always Negative",
                    "description": "'Busy' can be neutral or positive, describing a fulfilling life.",
                    "example": "He has a busy, happy life volunteering and traveling.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/OTrwLZQhavSmW4QV3HLB8Vg.webp"
                }
            ]
        },
        {
            "id": "d943df86-3c91-4a27-8a46-2f95544ada3e",
            "de": "Full of activity",
            "ty": "adjective",
            "ex": "The market is always busy on Saturdays.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "busy street",
                " busy place",
                " busy town"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d943df86-3c91-4a27-8a46-2f95544ada3e.webp",
            "Tips": [
                {
                    "title": "Energetic Atmosphere",
                    "description": "Describes places with lots of people or things happening.",
                    "example": "The festival was busy with music, dance, and food stalls.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Potential Overwhelm",
                    "description": "Can imply feeling overwhelmed by too much activity.",
                    "example": "The busy airport made her feel anxious.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "4081ac26-e10f-4339-abcd-138fc9d687f5",
            "de": "Overly decorated or intricate",
            "ty": "adjective",
            "ex": "Her dress was a bit too busy for my taste.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "busy pattern",
                " busy print",
                " busy design"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4081ac26-e10f-4339-abcd-138fc9d687f5.webp",
            "Tips": [
                {
                    "title": "Visually Overwhelming",
                    "description": "Refers to visual designs that draw a lot of attention, sometimes too much.",
                    "example": "His shirt had such a busy pattern, it made my eyes hurt.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subjective Taste",
                    "description": "What is 'busy' for one may not be for another; it's a matter of personal taste.",
                    "example": "Some may find this artwork busy, but I find it fascinating.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "b4cffa77-4339-4dae-8b1e-06577e9cf799",
            "de": "Unable to talk or do other things because you are doing something",
            "ty": "adjective",
            "ex": "I'm a little busy right now, can we chat later?",
            "use": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "i'm busy",
                " quite busy",
                " really busy"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b4cffa77-4339-4dae-8b1e-06577e9cf799.webp",
            "Tips": [
                {
                    "title": "Temporary State",
                    "description": "Indicates a temporary state of being occupied.",
                    "example": "He's busy now but will call you once he's finished.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Excuse for Delay",
                    "description": "Often used as a polite excuse for not doing something right away.",
                    "example": "I'm busy at the moment, can I get back to you later?",
                    "imageUrl": ""
                }
            ],
            "sy": ""
        },
        {
            "id": "be8a6fc9-577d-4a9e-9863-09b465d5393f",
            "de": "To make someone have a lot to do",
            "ty": "verb",
            "ex": "The project kept me busy for a few months.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "keep busy",
                " stay busy",
                " keep oneself busy"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/be8a6fc9-577d-4a9e-9863-09b465d5393f.webp",
            "Tips": [
                {
                    "title": "Emotional Satisfaction",
                    "description": "Being busy can relate to personal fulfillment in doing tasks.",
                    "example": "Painting landscapes busies me and calms my mind.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Avoiding Boredom",
                    "description": "Being busy is a way to prevent feeling bored or idle.",
                    "example": "Stay busy on the trip by reading or playing games.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Active": {
            "wordRoot": "Active",
            "wordDefinition": "The words active and busy both describe a state of being engaged in activity, but they differ in their connotations.\n\nActive implies being involved in meaningful or intentional activity, such as playing a sport or actively engaging in a conversation.\n\nActive suggests purposeful engagement in meaningful tasks or activities, while busy suggests being occupied with a lot of tasks or responsibilities, regardless of their purpose or value.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fb3b1282-e9a6-4c88-b530-f7f2b438e217.webp"
        },
        "Bustle": {
            "wordRoot": "Bustle",
            "wordDefinition": "Bustle means to move around quickly and noisily, often with a sense of purpose or urgency.\n\nEssentially, bustle implies movement and noise, while busy implies productivity and occupation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/73520673-4e1e-44d3-83d0-c57a919ed983.webp"
        },
        "Engage": {
            "wordRoot": "Engage",
            "wordDefinition": "Engage means actively participating in something, showing interest or involvement, or making a commitment to a task or activity.\n\nFor example, a person can engage in a conversation, engage in sports or outdoor activities, or engage in volunteer work.\n\nBusy refers to the quantity of activities or tasks a person has, while engage refers to the quality of involvement and commitment in a particular task or activity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/57b50e24-a47a-455a-851d-79d8b5894869.webp"
        },
        "Frantic": {
            "wordRoot": "Frantic",
            "wordDefinition": "Frantic means a state of wild excitement or confusion, usually accompanied by a sense of urgency or panic.\n\nHowever, if the homework is due the next day and the person has not started yet, they might become frantic as they rush to finish it on time.\n\nBusy refers to being occupied while frantic refers to a state of urgency and panic.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ab4e26fe-1f0a-464b-9ec4-e9f080713d4a.webp"
        },
        "Hectic": {
            "wordRoot": "Hectic",
            "wordDefinition": "Busy means having a lot of things to do, but still being in control and having enough time to complete them. Whereas, hectic means having a lot of things to do, but feeling overwhelmed and stressed, with not enough time to complete them all.\n\nHectic describes a situation where there is chaos, confusion and high levels of stress due to excessive work. For example, a student might be busy with school assignments but still have time for extracurricular activities, while a CEO might have a hectic schedule with multiple meetings and deadlines to meet.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fa50d5a3-8a1b-40c7-871f-fa80292a022c.webp"
        },
        "Occupy": {
            "wordRoot": "Occupy",
            "wordDefinition": "Busy means having a lot of things to do or being actively engaged in activities. It describes a state of being occupied with different tasks or responsibilities without necessarily specifying what those tasks are.\n\nOccupy means to be actively using or residing in a specific space or location. It is a more specific term than busy as it refers to a particular place or thing.\n\nFor example, a group of protesters occupies a public park to demand government action on a certain issue.\n\nBusy refers to a state of being engaged in activities, while occupy refers to being actively present in a certain place or space.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d6b7d183-def8-4394-ab7e-88ab1bf8b5bc.webp"
        },
        "Productive": {
            "wordRoot": "Productive",
            "wordDefinition": "Busy means having a lot to do or being occupied with tasks, while productive means doing things that actually achieve something or have a tangible outcome.\n\nA person who spends a few focused hours on a project and completes a task or milestone could be considered productive, even if they appear to have less overall activity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cc0beedd-cd76-451f-844f-881fb76f5e68.webp"
        },
        "Rush": {
            "wordRoot": "Rush",
            "wordDefinition": "Rush refers to moving quickly in order to complete a task or arrive at a destination on time. For example, someone might rush to catch a train or get to an appointment on time.\n\nBusy refers to having a lot on one's plate, while rush refers to moving quickly to complete a specific task or meet a specific deadline.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c0beb8c3-5734-4ea0-939b-f9aa969511b5.webp"
        }
    },
    "videos": [
        {
            "Text": " But when we flipped the whole image over, the most important parts of the face, the eyes and mouth, were now upside down, and you realized something fishy was up. You realized your brain had taken a short cut and missed something. But your brain wasn't really being lazy, it's just very busy.",
            "Title": "How optical illusions...",
            "VideoId": "rfdJyDfIHIc",
            "Controls": "start=236"
        },
        {
            "Text": " where nodes would be friends and links would be your friendships. Now, we all know that some of those nodes, or friends, are busier than others, like that friend who is always sending out group messages. Well, it's the same in forests, and these nodes in forests, we call them hubs,",
            "Title": "The networked beauty of...",
            "VideoId": "dRSPy3ZwpBk",
            "Controls": "start=238"
        },
        {
            "Text": " we come together, we brainstorm, and take up on that issue. So our most powerful tool is art, because we live in a very busy world where people are so busy in their life, and they don't have time to read. So we package our activism and we package our message in art.",
            "Title": "Boniface Mwangi: The day...",
            "VideoId": "W1KIgMXPR28",
            "Controls": "start=382"
        },
        {
            "Text": " reading voraciously about the subject matter, and reviewing previous talks on the topic. Finally, interpreters work in pairs. While one colleague is busy translating incoming speeches in real time, the other gives support by locating documents, looking up words,",
            "Title": "How interpreters juggle...",
            "VideoId": "cXNTArhA0Jg",
            "Controls": "start=221"
        },
        {
            "Text": " dr. guessin said the next several months Katie will be a professional patient lots of rehab lots of strength training doctor's appointments trying to get all her meds settled which one she'll have to stay on you just know in your head it's going to be busy",
            "Title": "Watch One Family's...",
            "VideoId": "fFua9-Rc4pw",
            "Controls": "start=856"
        },
        {
            "Text": " and law not quality we ditch our friends when we fall in love and we ignore them when we're busy with work and family on the other hand when we're with our friends we often treat them with more respect than we do our relatives and",
            "Title": "The science of...",
            "VideoId": "8DbP34U3buY",
            "Controls": "start=212"
        },
        {
            "Text": " now survived by scavenging from fishermen the kittens are brought up in the perfect playground but they're busy mums have to juggle childcare with the important job of getting a mule and their chance comes just once a day",
            "Title": "10 Day Old Kitten Falls...",
            "VideoId": "56J16JWXaAc",
            "Controls": "start=18"
        },
        {
            "Text": " for the hope that we get links coming past in this really busy area this cat is so rare you just think it's going to be tucked away in a remote corner that",
            "Title": "The Elusive Iberian Lynx...",
            "VideoId": "YjPHR2uHbds",
            "Controls": "start=137"
        },
        {
            "Text": " is a busy living world shrimp like krill a staple food in the antarctic come here for their winter growth",
            "Title": "Fighting Over Abandoned...",
            "VideoId": "lXv7sfmTysM",
            "Controls": "start=215"
        },
        {
            "Text": " in the midst of our busy lives the natural world can offer us a place of tranquility and rest",
            "Title": "Slow Down With Snow...",
            "VideoId": "d4c87NfCQ74",
            "Controls": "start=7"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sergio-ramos.webp",
            "Text": "Music is a way of expressing my mood, and it definitely helps to motivate me before a game. It also helps me move on from past defeats or keeps my mind busy when I'm not playing, so music is definitely something that follows me every step of every day.",
            "Title": "Spanish Athlete",
            "Name": "Sergio Ramos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/demi-lovato.webp",
            "Text": "I try to keep it real. I don't have time to worry about what I'm projecting to the world. I'm just busy being myself.",
            "Title": "American Musician",
            "Name": "Demi Lovato"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brian-may.webp",
            "Text": "I like to go for a walk or swimming or in the garden when I can. It's a busy kind of life, but I guess I'm lucky.",
            "Title": "English Musician",
            "Name": "Brian May"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/meryl-streep.webp",
            "Text": "I have a very busy life, and not many people who have a career and four kids go out a lot to the movies.",
            "Title": "American Actress",
            "Name": "Meryl Streep"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-hart.webp",
            "Text": "I don't care how busy I am - I will always make time for what's most important to me.",
            "Title": "American Actor",
            "Name": "Kevin Hart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/grandma-moses.webp",
            "Text": "Painting's not important. The important thing is keeping busy.",
            "Title": "American Artist",
            "Name": "Grandma Moses"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-lennon.webp",
            "Text": "Life is what happens while you are busy making other plans.",
            "Title": "English Musician",
            "Name": "John Lennon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josephine-de-la-baume.webp",
            "Text": "You can really only enjoy life when you're extremely busy.",
            "Title": "French Actress",
            "Name": "Josephine de La Baume"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mason-cooley.webp",
            "Text": "In every death, a busy world comes to an end.",
            "Title": "American Writer",
            "Name": "Mason Cooley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-radcliffe.webp",
            "Text": "I have a very busy personality.",
            "Title": "British Actor",
            "Name": "Daniel Radcliffe"
        }
    ]
}