{
    "currentWord": {
        "wordRoot": "candidate",
        "id": 17783,
        "phonemic": "ˈkændɪdeɪt|ˈkændɪdət\r",
        "bigId": "13804397-9010-4803-9e2e-683439be7c17",
        "wordForms": [
            "candidates",
            "candidate"
        ]
    },
    "senses": [
        {
            "id": "13804397-9010-4803-9e2e-683439be7c17",
            "de": "A person who is competing to get a job or elected position",
            "ty": "noun",
            "ex": "There are many candidates applying for this job.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "job candidate",
                " election candidate",
                " potential candidate"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/13804397-9010-4803-9e2e-683439be7c17.webp",
            "Tips": [
                {
                    "title": "Job Hunt",
                    "description": "Used when discussing employment opportunities or seeking positions in a company.",
                    "example": "She is a candidate for the marketing manager position.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/bsLugDj80cSxxwB7xFzr5RLDGBs.webp"
                },
                {
                    "title": "Political Races",
                    "description": "Refers to individuals running in elections for public office.",
                    "example": "The local election has five candidates for mayor.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Rsku7KYR4AjVoFB7mNoIWCJtcE.webp"
                },
                {
                    "title": "Education and Scholarships",
                    "description": "Describes students or scholars competing for entrance or awards.",
                    "example": "Candidates for the scholarship must submit their essays by Friday.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/m0BhAitEU1m8OyKTt1WnWXFw.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "572b783b-f344-4b3f-bb4b-c85ae46ad28f",
            "de": "A person or thing regarded as suitable or likely for a particular fate or position.",
            "ty": "noun",
            "ex": "The old factory is a prime candidate for redevelopment.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "prime candidate",
                " likely candidate",
                " suitable candidate"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/572b783b-f344-4b3f-bb4b-c85ae46ad28f.webp",
            "Tips": [
                {
                    "title": "Potential Fit",
                    "description": "Indicates an option regarded as appropriate or fitting for a role or purpose.",
                    "example": "He is a good candidate for the new training program.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Object Candidacy",
                    "description": "Used not just for people, but for objects or places seen as suitable for a particular use.",
                    "example": "This site is an excellent candidate for our new office building.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Casual Conversations",
                    "description": "Often used informally to speculate about what might happen or who might be suitable for something.",
                    "example": "Your idea is a great candidate for the project proposal.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Applicant": {
            "wordRoot": "Applicant",
            "wordDefinition": "An applicant is someone who applies for a job or position, while a candidate is someone who is being considered for a job or position.\n\nIn other words, when someone fills out an application for a job, they become an applicant. If the employer decides to bring that person in for an interview, they become a candidate.\n\nAn applicant is someone who is applying for a position, while a candidate is someone who has made it past the initial application stage and is being considered for the position.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/439dcba7-2a33-4eda-9ccf-7185c9a190a5.webp"
        },
        "Aspirant": {
            "wordRoot": "Aspirant",
            "wordDefinition": "Aspirant refers to someone who has a strong desire or ambition to achieve something, while a candidate refers to someone who is being considered for a specific position or role.\n\nIn simpler terms, an aspirant is someone who wants to achieve a goal, while a candidate is someone who is being evaluated for a job or position.\n\nAn aspirant can be applicable in many areas such as personal goals, dreams, and aspirations while a candidate is applicable in job applications and political campaigns.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fc72934c-1795-4196-a51c-a1151e0e9a7f.webp"
        },
        "Competitor": {
            "wordRoot": "Competitor",
            "wordDefinition": "A competitor is someone who is vying against others to win a prize or recognition. It's applicable in situations like sports competitions or contests.\n\nA candidate is someone who is seeking something, while a competitor is someone who is fighting to win something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/281f7ede-a76f-48c1-9a1d-169d6565f66b.webp"
        },
        "Contender": {
            "wordRoot": "Contender",
            "wordDefinition": "A contender is a person who is competing for something, often in a contest, game, or sport.\n\nA candidate is someone who is being considered for a position, while a contender is someone who is actively competing for something.\n\nThe term candidate is more applicable in the context of an election or job interview, while contender is more applicable in the context of a competition or challenge.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6eb3c78f-9dde-447c-affa-c2e52077a356.webp"
        },
        "Hopeful": {
            "wordRoot": "Hopeful",
            "wordDefinition": "A hopeful is someone who is optimistic about becoming a candidate or achieving a certain goal. They may desire to become a candidate or attain a specific position, but they have not yet taken the necessary steps to make it happen.\n\nFor example, a student might be hopeful that they will get accepted into a particular college, but until they actually apply, they are not yet a candidate.\n\nA candidate refers to someone who is officially running for a position, while a hopeful is someone who is optimistic about achieving a goal but has not yet taken the necessary steps to make it happen.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ade3df4f-772f-464f-a2e5-0599d91778af.webp"
        },
        "Nominee": {
            "wordRoot": "Nominee",
            "wordDefinition": "A nominee, however, is a person who has been selected or nominated by someone else. For example, a political party may nominate a person as its nominee for a particular election.\n\nIn simpler terms, candidate is someone who applies for a position, while nominee is someone who has been chosen by someone else for a position.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1de79303-6118-4193-bdf7-c4e43a1976af.webp"
        },
        "Runner": {
            "wordRoot": "Runner",
            "wordDefinition": "A runner is someone who participates in a race, such as a marathon or track and field event.\n\nSo, while a candidate is seeking a job or position, a runner is participating in a race. Each word is applicable in different situations based on their respective definitions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f693d770-0224-4d69-899e-b19be07c3f59.webp"
        },
        "Suitor": {
            "wordRoot": "Suitor",
            "wordDefinition": "A suitor typically refers to someone who is interested in pursuing a romantic relationship or marriage with another person.\n\nA candidate is someone being considered for a position or job, while a suitor is someone pursuing a romantic relationship with another person.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/15d67e87-9386-4fb2-81af-ab7eb67e9d24.webp"
        }
    },
    "videos": [
        {
            "Text": " But, this is only a single characteristic in a very high-dimensional space. With a clustering tool called Principal Component Analysis, we can reduce the multidimensional space into simple principal components that collectively measure the variance in Shakespeare's works. We can then test the works of our candidates",
            "Title": "Did Shakespeare write...",
            "VideoId": "K-aAUwAFZlQ",
            "Controls": "start=120"
        },
        {
            "Text": " You see nine presidential candidates running against Lukashenko, you all know the outcome. So unity is a big thing. And this can be achieved. Same with planning. Somebody has lied to you about the successful and spontaneous nonviolent revolution. That thing doesn't exist in the world.",
            "Title": "Srdja Popovic: How to...",
            "VideoId": "uo7w3g24DWo",
            "Controls": "start=284"
        },
        {
            "Text": " primitive so the question would be how could somebody in massachusetts judge a presidential candidate from north carolina and even if they were informed direct popular election that will just mean the big states are going to elect the president others said let the state legislatures",
            "Title": "Why the Electoral...",
            "VideoId": "Q1zmbVcMiEM",
            "Controls": "start=182"
        },
        {
            "Text": " Many other factors come up for consideration, as well, including experience, personal loyalties, ethnicity, and gender. The candidates are then thoroughly vetted down to their tax records and payments to domestic help. Once the president interviews the candidate",
            "Title": "How do US Supreme Court...",
            "VideoId": "0xnzGSV66x4",
            "Controls": "start=97"
        },
        {
            "Text": " an unintended consequence that's important to think about. explore other points of view. Ask yourself why so many people are drawn to the policies of the opposing political candidate. Even if you disagree with everything that candidate says,",
            "Title": "5 tips to improve your...",
            "VideoId": "dItUGF8GdTw",
            "Controls": "start=194"
        },
        {
            "Text": " that no candidate for popular election dare affirm it in public. If I'm right, this means that high office in the greatest country in the world is barred to the very people best qualified to hold it -- the intelligentsia --",
            "Title": "Militant atheism PIPE...",
            "VideoId": "VxGMqKCcN6A",
            "Controls": "start=1105"
        },
        {
            "Text": " There were several factors that made smallpox an ideal candidate for eradication. First, humans are essential to the smallpox lifecycle, so breaking the chain of human to human transmission causes the virus to die out.",
            "Title": "Learning from smallpox:...",
            "VideoId": "oBSandHijDc",
            "Controls": "start=163"
        },
        {
            "Text": " want to see authenticity in their candidates Haleh said something else about civility etc and money in campaigns I truly believe that we will turn everything upside down in terms of women's participation in leadership",
            "Title": "On sincere and authentic...",
            "VideoId": "BJ-W6VAnSKY",
            "Controls": "start=384"
        },
        {
            "Text": " best candidate is pinpin he's brought to the nursery and placed in an adjoining pen to help things along one of the vets uses a stem of bamboo to touch the glands under Yosh wands tail",
            "Title": "Giant Pandas' Mating...",
            "VideoId": "RbfiXSO6dy4",
            "Controls": "start=12"
        },
        {
            "Text": " to inauguration day. But I want to say to you, I will support the winner of a free and fair election no matter which candidate wins, and I will oppose any so-called winner",
            "Title": "What if a US presidential...",
            "VideoId": "WZWRhLW7Y8w",
            "Controls": "start=952"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kathryn-minshew.webp",
            "Text": "Sure, it's fun to chat with people with interesting backgrounds who seem to have a passion for your company. But a job interview is not a friendly chat. You need to determine whether candidates, can they really do the job. So ask them to prove it.",
            "Title": "American Businesswoman",
            "Name": "Kathryn Minshew"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jaime-harrison.webp",
            "Text": "I'm hoping that college students and young professionals in general will pay very close attention to what is being said by both parties and all the candidates in the parties and pick the best person that best reflects the values that we all have.",
            "Title": "American Politician",
            "Name": "Jaime Harrison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nina-shaw.webp",
            "Text": "Often, when we support the 'right' causes and candidates, we fail to recognize that with progress comes sacrifice. That sacrifice might mean that you are no longer the obvious choice for the job. Your job security may no longer be a given.",
            "Title": "American Lawyer",
            "Name": "Nina Shaw"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erik-paulsen.webp",
            "Text": "Minnesotans are ticket splitters. They look to the candidate, not the party, which is the way it should be, and that's only going to help me.",
            "Title": "Algerian Politician",
            "Name": "Erik Paulsen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-densmore.webp",
            "Text": "Most of what is said by candidates on the right is half-baked truths and fabrications coated in 'patriotism or family values.",
            "Title": "American Musician",
            "Name": "John Densmore"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jon-taffer.webp",
            "Text": "If a candidate puts together a small business platform, I'll go out on the road for him. You know, I'll support him.",
            "Title": "American Businessman",
            "Name": "Jon Taffer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/samuel-l-jackson.webp",
            "Text": "Because of where I come from, I never thought I'd see in my life a black candidate running for President.",
            "Title": "Actor",
            "Name": "Samuel L. Jackson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lara-trump.webp",
            "Text": "You can have all the money in the world, but if you're not a good candidate, it doesn't matter.",
            "Title": "American Producer",
            "Name": "Lara Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/j-b-pritzker.webp",
            "Text": "When candidates have asked me for support before, they have asked for more than a check.",
            "Title": "Argentinian Businessman",
            "Name": "J. B. Pritzker"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-mnuchin.webp",
            "Text": "I've always believed in supporting the best candidate at the time.",
            "Title": "American Public Servant",
            "Name": "Steve Mnuchin"
        }
    ]
}