{
    "currentWord": {
        "wordRoot": "common",
        "id": 5364,
        "phonemic": "ˈkɒmən|ˈkɑːmən\r",
        "bigId": "af247a1c-4ca1-4fff-983e-d20bda0907d4",
        "wordForms": [
            "commoner",
            "commonest",
            "commons",
            "commonness",
            "uncommon",
            "commonly",
            "common"
        ]
    },
    "senses": [
        {
            "id": "af247a1c-4ca1-4fff-983e-d20bda0907d4",
            "de": "If something is common, it is found in large numbers or it happens often.",
            "ty": "adjective",
            "ex": "This type of bird is very common in our area.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/af247a1c-4ca1-4fff-983e-d20bda0907d4.webp",
            "Tips": [
                {
                    "title": "Frequent Occurrence",
                    "description": "Used to indicate something you encounter often in everyday life.",
                    "example": "Seeing smartphones is common nowadays.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/NLs2a8YiV01KjMMmV9gR6xKOnJQ.webp"
                },
                {
                    "title": "Not Unique",
                    "description": "Suggests a lack of uniqueness or specialness.",
                    "example": "Using plastic bags is still common, unfortunately.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/kydxg9EETpY26gk9lvNm6o5UFL0.webp"
                },
                {
                    "title": "General Truth",
                    "description": "Refers to a widely accepted fact or situation.",
                    "example": "It is common knowledge that the Earth orbits the Sun.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/MAWWgvsH1wS5AM18yY02X0X2p8.webp"
                }
            ]
        },
        {
            "id": "0f1623da-e5da-4956-b2c3-74a2e912ff5b",
            "de": "A common is an area of grassy land, usually in or near a village or small town, where the public is allowed to go.",
            "ty": "noun",
            "ex": "They used the village common to play football.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0f1623da-e5da-4956-b2c3-74a2e912ff5b.webp",
            "Tips": [
                {
                    "title": "Open for All",
                    "description": "Emphasizes that a common is accessible to everyone in the community.",
                    "example": "The common is open for all to enjoy a picnic.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Public Space",
                    "description": "Highlights that a common is a shared outdoor area not owned by anyone privately.",
                    "example": "Families gathered at the common to watch the fireworks.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "fa851bef-f19f-4768-8e50-c2d9493ad534",
            "de": "Common can also describe something that is the same and shared by two or more people or things.",
            "ty": "adjective",
            "ex": "They discovered they had a lot in common.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/fa851bef-f19f-4768-8e50-c2d9493ad534.webp",
            "Tips": [
                {
                    "title": "Joint Interests",
                    "description": "Can be a basis for forming relationships or connections.",
                    "example": "They both love hiking and have that in common.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Shared Characteristics",
                    "description": "Describes traits or features that are the same between entities.",
                    "example": "Many languages have common roots in Latin.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Common Ground",
                    "description": "Suggests an area of mutual agreement or interest in a discussion or negotiation.",
                    "example": "They found common ground on the business strategy.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "fc477e99-e45c-42c3-a01c-354fef3e2dbb",
            "de": "If you describe a person or their behavior as common, you mean that they are low in social status or lack refinement.",
            "ty": "adjective",
            "ex": "She was criticized for her common manners at the dinner table.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/fc477e99-e45c-42c3-a01c-354fef3e2dbb.webp",
            "Tips": [
                {
                    "title": "Negative Connotation",
                    "description": "Implies a judgmental tone, often perceived as insulting.",
                    "example": "Referring to someone as 'common' can be considered rude.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Social Implication",
                    "description": "May be used to suggest a lower perceived social standing.",
                    "example": "He avoided using common expressions to seem more sophisticated.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5f187bee-897c-4f45-8caf-2eb58d703057",
            "de": "Commonly means frequently or typically.",
            "ty": "adverb",
            "ex": "Birds are commonly found in this area.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5f187bee-897c-4f45-8caf-2eb58d703057.webp",
            "Tips": [
                {
                    "title": "Typical Behavior",
                    "description": "Adverb form relating to what is usually done or experienced.",
                    "example": "The birds commonly seen here migrate in winter.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Regularly Happening",
                    "description": "Refers to actions or events that occur with normal regularity.",
                    "example": "It is commonly understood that this road is always congested.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Average": {
            "wordRoot": "Average",
            "wordDefinition": "Average refers to a numerical value calculated by adding up a set of numbers and dividing by the total number of values, whereas common means something that is frequently seen or found in a particular place or situation.\n\nFor example, if we take a class of 20 students and ask for their grades in a test, we can calculate the average (or mean) score by adding all the scores and dividing the total by 20.\n\nThis gives us a numerical value that represents the average performance of the class.\n\nAverage is used when talking about numbers, while common describes things or situations that are often seen or experienced.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/37b86109-cdee-4f13-980b-d196466c93b1.webp"
        },
        "Conventional": {
            "wordRoot": "Conventional",
            "wordDefinition": "Conventional refers to something that is done or used according to standards, customs, or traditional practices.\n\nFor example, it is conventional to shake hands when meeting someone for the first time.\n\nCommon describes things that are usual or widespread, while conventional refers to things that follow accepted norms or traditions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b8b97770-0bfe-4aba-8cc1-6814a895f652.webp"
        },
        "Everyday": {
            "wordRoot": "Everyday",
            "wordDefinition": "While both common and everyday describe things that are familiar or ordinary, common often refers to things that are shared or widely distributed among a group of people.\n\nFor example, \"English is a common language spoken in many countries.\" Everyday usually describes things we do regularly or encounter regularly on a personal level, like \"I wake up early every day.\"\n\nCommon is applicable when talking about things that are universal or widely shared, while everyday applies to things that are part of our daily routine or individual lives.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5342fa13-2dec-4e10-a15c-8cf531786b98.webp"
        },
        "Familiar": {
            "wordRoot": "Familiar",
            "wordDefinition": "Familiar refers to something that we know well or have encountered before.\n\nIt describes things that we recognize or remember. For example, \"This song is familiar to me because I heard it on the radio last week.\".\n\nCommon is used to indicate how often something occurs while familiar is used to indicate our personal experience or awareness of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/faade12c-a6dd-4346-b45c-a9a3445795dd.webp"
        },
        "Ordinary": {
            "wordRoot": "Ordinary",
            "wordDefinition": "Ordinary means something that is plain or average. For example, an ordinary day is a routine day with no special events or activities.\n\nCommon describes something that happens often, while ordinary describes something that is not remarkable or special.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6613882e-4ec1-4fae-91ea-a6bc9fef452e.webp"
        },
        "Regular": {
            "wordRoot": "Regular",
            "wordDefinition": "Regular means something that happens at fixed or consistent intervals. For example, a person who goes to the gym every day is referred to as a regular gym-goer.\n\nCommon refers to something that is normal or widespread, while regular refers to something that happens frequently or consistently.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ec5b5991-1fd9-4b30-b9f8-04e4455e947d.webp"
        },
        "Routine": {
            "wordRoot": "Routine",
            "wordDefinition": "Routine, on the other hand, refers to a series of actions or behaviors that are performed regularly, often as part of a schedule or habit.\n\nFor example, brushing your teeth every morning and night is a routine.\n\nBoth words can be used in different contexts, but common describes something that is widespread or prevalent, while routine describes a set of repeated actions or behaviors.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b4e68cbb-0d92-45e3-aa52-aa75ad0aeee4.webp"
        },
        "Typical": {
            "wordRoot": "Typical",
            "wordDefinition": "Typical refers to something that is usual or expected based on past experiences or knowledge.\n\nIt can describe things that are representative of a particular group or category, like typical behavior for a certain age group.\n\nIn simpler terms, common means it happens a lot or is well known, while typical means it's normal or expected based on what we already know.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/49c0ea1b-4a8c-48a5-9918-a66102ff5436.webp"
        },
        "Usual": {
            "wordRoot": "Usual",
            "wordDefinition": "Usual means typical or normal for a specific situation or person. For example, it's usual for me to have cereal for breakfast.\n\nCommon refers to things that are widespread or generally happening all the time, while usual describes things that are typical or expected in a specific context or for a particular person.\n\nCommon describes things that happen often or are widely seen, while usual describes things that are normal or expected in a certain situation or for a specific person.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c4de0cda-d32a-467d-b356-947e5392f32d.webp"
        }
    },
    "videos": [
        {
            "Text": " are qualitatively different from those based on real experiences. This suggests that creating a false story about a personal topic takes work and results in a different pattern of language use. A technology known as linguistic text analysis has helped to identify four such common patterns",
            "Title": "The language of lying —...",
            "VideoId": "H0-WkpmTPrM",
            "Controls": "start=92"
        },
        {
            "Text": " and then taught them about his heavenly father -- affectionate, forgiving, and attentive. Then, he would invite everyone to a common table to illustrate his Kingdom of God, outcasts, sinners, and saints all eating together. He had only three years before his unconventional wisdom",
            "Title": "The five major world...",
            "VideoId": "m6dCxo7t_aE",
            "Controls": "start=424"
        },
        {
            "Text": " Taking aspirin, which thins the blood, and nitroglycerin, which opens up the artery, can help keep the heart attack from getting worse. In the emergency room, doctors can diagnose a heart attack. They commonly use an electrocardiogram to measure the heart's electrical activity",
            "Title": "What happens during a...",
            "VideoId": "3_PYnWVoUzM",
            "Controls": "start=131"
        },
        {
            "Text": " including the brain. That's what inhalational anesthetics do. In Western medicine, diethyl ether was the first common one. It was best known as a recreational drug until doctors started to realize that people sometimes didn't notice injuries they received under the influence.",
            "Title": "How does anesthesia...",
            "VideoId": "B_tTymvDWXk",
            "Controls": "start=107"
        },
        {
            "Text": " but the people around them suffer. Taken to the extreme, this behavior is classified as a psychological disorder called narcissistic personality disorder. It affects one to two percent of the population, more commonly men. It is also a diagnosis reserved for adults.",
            "Title": "The psychology of...",
            "VideoId": "arJLy3hX1E8",
            "Controls": "start=145"
        },
        {
            "Text": " nearly seven billion of us on the planet we must all be on our very best behavior please I'm counting on each and every one of you to exercise common courtesy thank you an uncommon history of common courtesy how manners shaped the world is available now",
            "Title": "Uncommon History of...",
            "VideoId": "RVZShJH55aU",
            "Controls": "start=79"
        },
        {
            "Text": " for more than a hundred years. Whether these two great civilizations, these two great countries, can in fact carve out a common future for themselves and for the world? In short, can we carve out a future which is peaceful and mutually prosperous,",
            "Title": "Are China and the US...",
            "VideoId": "8XQ1onjXJK0",
            "Controls": "start=242"
        },
        {
            "Text": " listing over a hundred common dreams and their meanings. And in the years since, we haven't paused in our quest to understand why we dream. So, after a great deal of scientific research, technological advancement, and persistence,",
            "Title": "Why do we dream? - Amy...",
            "VideoId": "2W85Dwxx218",
            "Controls": "start=15"
        },
        {
            "Text": " uncomfortable they think they know bipolar disorder but they don't and here are the three things that they most commonly get wrong what bipolar disorder is uncommon I go to a peer support group",
            "Title": "Understanding bipolar...",
            "VideoId": "ioJEx4eFPtE",
            "Controls": "start=101"
        },
        {
            "Text": " it's such a successful strategy the jellies are one of the most common life forms on the planet but among the jellies and looking somewhat like them is a rather more complex and sinister",
            "Title": "The Deadly Portuguese...",
            "VideoId": "aIovmgzyuL0",
            "Controls": "start=82"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oprah-winfrey.webp",
            "Text": "No matter who we are or what we look like or what we may believe, it is both possible and, more importantly, it becomes powerful to come together in common purpose and common effort.",
            "Title": "American Entertainer",
            "Name": "Oprah Winfrey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rush-limbaugh.webp",
            "Text": "The truth of anything doesn't matter anymore. What's right doesn't matter. What makes economic common sense doesn't matter. I'm blue in the face over it.",
            "Title": "American Entertainer",
            "Name": "Rush Limbaugh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joyce-meyer.webp",
            "Text": "Traditions are a common part of our lives. They can be good, and not all traditions are wrong, but sometimes they can take the joy out of life.",
            "Title": "American Author",
            "Name": "Joyce Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeff-bezos.webp",
            "Text": "The thing that motivates me is a very common form of motivation. And that is, with other folks counting on me, it's so easy to be motivated.",
            "Title": "American Businessman",
            "Name": "Jeff Bezos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/plutarch.webp",
            "Text": "All men whilst they are awake are in one common world: but each of them, when he is asleep, is in a world of his own.",
            "Title": "Greek Philosopher",
            "Name": "Plutarch"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-washington-carver.webp",
            "Text": "When you can do the common things of life in an uncommon way, you will command the attention of the world.",
            "Title": "American Scientist",
            "Name": "George Washington Carver"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/abraham-lincoln.webp",
            "Text": "Common looking people are the best in the world: that is the reason the Lord makes so many of them.",
            "Title": "American President",
            "Name": "Abraham Lincoln"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/francois-hollande.webp",
            "Text": "Our common responsibility is to put Europe's interests first.",
            "Title": "French Statesman",
            "Name": "Francois Hollande"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ian-hislop.webp",
            "Text": "I get paid to do what I enjoy, not that common a condition.",
            "Title": "Welsh Editor",
            "Name": "Ian Hislop"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johann-wolfgang-von-goethe.webp",
            "Text": "Common sense is the genius of humanity.",
            "Title": "German Writer",
            "Name": "Johann Wolfgang von Goethe"
        }
    ]
}