{
    "currentWord": {
        "wordRoot": "commensurate",
        "id": 22681,
        "phonemic": "kəˈmenʃərət|kəˈmenʃərət\r",
        "bigId": "feebfc2e-2078-4d38-8d48-490f5ab1de70",
        "wordForms": [
            "commensurately",
            "incommensurate",
            "commensurate"
        ]
    },
    "senses": [
        {
            "id": "feebfc2e-2078-4d38-8d48-490f5ab1de70",
            "de": "Being of equal size, value, or importance to something else.",
            "ty": "adjective",
            "ex": "Your salary will be commensurate with your experience and skills.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "commensurate with",
                " commensurate to",
                " commensurate step"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/feebfc2e-2078-4d38-8d48-490f5ab1de70.webp",
            "Tips": [
                {
                    "title": "Equal Contribution",
                    "description": "Use 'commensurate' to discuss fairness in terms of input and output, like effort and reward.",
                    "example": "They sought a division of profits commensurate with their investments.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/QcIaGQCxj7kep6HUYCqxs33BB8.webp"
                },
                {
                    "title": "Balance",
                    "description": "'Commensurate' implies a sensible balance between items being compared.",
                    "example": "The punishment should be commensurate with the crime.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/aHmoKdFLparfEOFLTrZ1lTeISvQ.webp"
                },
                {
                    "title": "Professional Context",
                    "description": "'Commensurate' is often used in professional settings to talk about salaries and responsibilities.",
                    "example": "Job benefits will be commensurate with the level of the position.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/2Ib7JXgJxLGzaIKJj4XRtlpSv8A.webp"
                }
            ]
        }
    ],
    "comparisons": {
        "Compare": {
            "wordRoot": "Compare",
            "wordDefinition": "Compare means to examine two or more things to see how they are similar or different. It's used when we want to point out similarities or differences between things.\n\nFor example, you might compare two different cars to decide which one is a better fit for your needs.\n\nCommensurate relates to the equal or equivalent value of two things, while compare relates to similarities or differences between two or more things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/92962732-4f88-442c-8b9d-a7782fea26cd.webp"
        },
        "Correspond": {
            "wordRoot": "Correspond",
            "wordDefinition": "Correspond means that two things match or are similar to each other. For example, if you say that someone's story about their day doesn't correspond with the facts, you mean that what they're saying doesn't match up with what actually happened.\n\nCommensurate is used when talking about the proportionality or balance between two things, while correspond is used when talking about similarity or matching between two things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/862dff42-ec45-4dbb-9f13-8b31e1d72e39.webp"
        },
        "Equivalent": {
            "wordRoot": "Equivalent",
            "wordDefinition": "On the other hand, when something is equivalent, it means that it is equal in value, function or meaning to something else.\n\nFor example, a dollar bill is equivalent to four quarters in terms of their value.\n\nCommensurate describes something that is proportional to something else, while equivalent describes something that is equal in value or function to something else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1d1bd6a7-cab1-467c-9bbf-9bbe3c8f2f5a.webp"
        },
        "Harmonious": {
            "wordRoot": "Harmonious",
            "wordDefinition": "Harmonious means that two things work together well, like different musical notes that sound good when played together.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/20e00ff8-1279-4dfa-b49d-c155cf862f97.webp"
        },
        "Parallel": {
            "wordRoot": "Parallel",
            "wordDefinition": "Parallel means two things that are similar or closely related, but they don't have to be equal or identical. For example, two roads can be parallel to each other even if they have different lengths or features.\n\nCommensurate refers to equality or proportionality while parallel refers to similarity or resemblance. Both words can be used in various contexts such as math, science, or everyday language.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a77c712c-9c63-4541-9642-a9c56ab85c9f.webp"
        },
        "Proportional": {
            "wordRoot": "Proportional",
            "wordDefinition": "Proportional means corresponding in size or amount to something else. It suggests that two things are related in terms of size or quantity.\n\nFor example, if you are baking a cake, the ingredients must be proportional to each other in order for the cake to turn out well.\n\nBoth words deal with the idea of comparability, but commensurate is more about degree or importance, while proportional is more about size or quantity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a205d68e-f7df-471c-88c3-474a26de4a57.webp"
        },
        "Symmetrical": {
            "wordRoot": "Symmetrical",
            "wordDefinition": "Symmetrical means that something is balanced or equal on both sides. For example, if a butterfly has symmetrical wings, it means that both wings are the same size and shape.\n\nCommensurate refers to matching up in proportion, while symmetrical refers to being equal on both sides. Commensurate applies more to things that are related to value, achievement or skill, whereas symmetrical refers more to things that have a balanced design or structure, like shapes, buildings, and patterns.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aca52065-cbd6-48af-9016-30367f56fa84.webp"
        },
        "Uniform": {
            "wordRoot": "Uniform",
            "wordDefinition": "Uniform means being the same in form, nature or quality. It is applicable when discussing things that are identical or consistent with each other - for instance, soldiers wear uniforms to have a similar appearance in order to be identified as part of a group.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9e09b35f-c71a-4884-b5fe-3efa210a3fd0.webp"
        }
    },
    "videos": [
        {
            "Text": " but feel miserable all the time, you think, \"Why do I feel like this? I must have depression.\" And you set out to find treatment for it. But if you have a perfectly awful life, and you feel miserable all the time, the way you feel is commensurate with your life, and it doesn't occur to you to think,",
            "Title": "Depression, the secret...",
            "VideoId": "-eBUcBfkVCo",
            "Controls": "start=1165"
        },
        {
            "Text": " \"Objective considerations of contemporary phenomena compel the conclusion that success or failure in competitive activities exhibits no tendency to be commensurate with innate capacity, but that a considerable element of the unpredictable must invariably be taken into account.\"",
            "Title": "Beware of nominalizations...",
            "VideoId": "dNlkHtMgcPQ",
            "Controls": "start=182"
        },
        {
            "Text": " the global output they and the producing countries rarely get to see a commensurate percentage of the colored gemstone value to try and change things from the ground up I found it a social enterprise called somani which is a Swahili word meaning value we",
            "Title": "Justice for gem miners ...",
            "VideoId": "GdLu28zvacQ",
            "Controls": "start=233"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/morris-gleitzman.webp",
            "Text": "Because kids are physically smaller, there's an assumption by people who haven't read a kids' book for a long time that their ideas and themes and problems and ambitions must be commensurately smaller and less important. I would venture that sometimes the opposite is true.",
            "Title": "English Author",
            "Name": "Morris Gleitzman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/woody-harrelson.webp",
            "Text": "When I had just started 'Cheers,' my nerves were ajangle, to put it mildly. I was absolutely terrified. What you're learning is to not show the fear, and to ultimately overcome it so that the level of relaxation is commensurate with the level of tension.",
            "Title": "American Actor",
            "Name": "Woody Harrelson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tristan-harris.webp",
            "Text": "Our online news feeds aggregate all of the world's pain and cruelty, dragging our brains into a kind of learned helplessness. Technology that provides us with near-complete knowledge without a commensurate level of agency isn't humane.",
            "Title": "American Activist",
            "Name": "Tristan Harris"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sylvia-earle.webp",
            "Text": "It's a fact of life that there will be oil spills, as long as oil is moved from place to place, but we must have provisions to deal with them, and a capability that is commensurate with the size of the oil shipments.",
            "Title": "American Scientist",
            "Name": "Sylvia Earle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hu-jintao.webp",
            "Text": "The overall strength of Chinese culture and its international influence is not commensurate with China's international status. The international culture of the West is strong while we are weak.",
            "Title": "Chinese Statesman",
            "Name": "Hu Jintao"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/melissa-leong.webp",
            "Text": "Perceived value is paramount for most diners; a feeling of satisfaction that what you've paid for is commensurate with what you've received. That is, provided your expectations are rational.",
            "Title": "",
            "Name": "Melissa Leong"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/phyllida-lloyd.webp",
            "Text": "I think courage is commensurate with your fear - if you lack imagination and you're fearless, that's not courage to me.",
            "Title": "English Director",
            "Name": "Phyllida Lloyd"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/boris-johnson.webp",
            "Text": "We can find our voice in the world again: a voice that is commensurate with the fifth-biggest economy on Earth.",
            "Title": "British Politician",
            "Name": "Boris Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/franz-kafka.webp",
            "Text": "The fact that our task is exactly commensurate with our life gives it the appearance of being infinite.",
            "Title": "Novelist",
            "Name": "Franz Kafka"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-kahneman.webp",
            "Text": "The effort invested in 'getting it right' should be commensurate with the importance of the decision.",
            "Title": "Israeli Psychologist",
            "Name": "Daniel Kahneman"
        }
    ]
}