{
    "currentWord": {
        "wordRoot": "compare",
        "id": 18,
        "phonemic": "kəmˈpeə(r)|kəmˈper\r",
        "bigId": "92962732-4f88-442c-8b9d-a7782fea26cd",
        "wordForms": [
            "compares",
            "comparing",
            "compared",
            "comparable",
            "compare"
        ]
    },
    "senses": [
        {
            "id": "92962732-4f88-442c-8b9d-a7782fea26cd",
            "de": "To note the similarity or dissimilarity between things or people.",
            "ty": "verb",
            "ex": "Please compare these two dresses and tell me which one you like better.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "compare and contrast",
                " compare to",
                " compare with"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/92962732-4f88-442c-8b9d-a7782fea26cd.webp",
            "Tips": [
                {
                    "title": "Comparison Basis",
                    "description": "Be clear on what basis items or people are compared; look for shared characteristics or purposes.",
                    "example": "Compare the fuel efficiency of these cars, not their color.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/cRjd9d0Rtzw0PQeRAoAMelAbUI.webp"
                },
                {
                    "title": "Critical Thinking",
                    "description": "Use comparing to analyze pros and cons or make informed decisions.",
                    "example": "Compare the candidates' policies carefully before voting.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/E7dQg70lRmqdFwzXfCf4Jybyag.webp"
                },
                {
                    "title": "Objective vs. Subjective",
                    "description": "Understand when comparison is based on facts (objective) or personal preference (subjective).",
                    "example": "Comparing test scores is objective; comparing beauty is subjective.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Hx2SyIyS8qEqULlPgLZFn6QV4.webp"
                }
            ]
        },
        {
            "id": "6f6c9759-35b4-4f7b-bd07-44b88ba9cdb3",
            "de": "To be equivalent or identical to, or capable of being compared with.",
            "ty": "verb",
            "ex": "Nothing can compare with a mother's love.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "nothing compares to",
                " beyond compare",
                " compare favorably with"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6f6c9759-35b4-4f7b-bd07-44b88ba9cdb3.webp",
            "Tips": [
                {
                    "title": "Equality in Comparison",
                    "description": "Use 'compare with' when stating two things are on the same level or standard.",
                    "example": "This wine compares favorably with expensive brands.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Unique Comparisons",
                    "description": "Use 'beyond compare' for something so unique, it stands out among others.",
                    "example": "Her singing talent is beyond compare.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Impact",
                    "description": "Understand that some comparisons might carry emotional weight or imply strong preferences.",
                    "example": "Nothing can compare to my grandmother's cooking.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "66ddb330-1dba-43ee-82fa-23dff074b0b0",
            "de": "To regard or represent as analogous or similar; to liken.",
            "ty": "verb",
            "ex": "He compared her eyes to stars.",
            "use": "",
            "co": "Poetic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "compare to",
                " compare with",
                " compare oneself to"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/66ddb330-1dba-43ee-82fa-23dff074b0b0.webp",
            "Tips": [
                {
                    "title": "Poetic Comparisons",
                    "description": "Use 'compare to' to create vivid imagery or for artistic expression.",
                    "example": "The poet compared her smile to the first rays of sunshine.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Metaphorical Usage",
                    "description": "Understand that comparisons can be metaphorical, not literal.",
                    "example": "Comparing life to a journey suggests many ups and downs.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Similarity Not Equality",
                    "description": "Comparing implies similarity, not necessarily equality or identity.",
                    "example": "He compared the twins' talents, noting their unique yet similar gifts.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Analyse": {
            "wordRoot": "Analyse",
            "wordDefinition": "Analyse means to study or examine something closely and break it down into smaller parts to understand how it works, why it happens or how it affects something.\n\nYou would use analyse when you want to understand how something works, while you would use compare when you want to understand how two different things are the same or different.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e4906935-5663-44a7-a9ee-eb4719d2801c.webp"
        },
        "Balance": {
            "wordRoot": "Balance",
            "wordDefinition": "Balance refers to finding an equilibrium or equal distribution of weight between two or more things. For example, balancing a scale means that both sides of the scale have an equal amount of weight.\n\nThis word is typically used when discussing physical objects or financial matters, such as balancing a bank account or balancing on one foot.\n\nBalance is used when there is a need to achieve equal distribution of weight, while compare is used when there is a need to find similarities and differences between two things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/84cbbb2f-d484-4c04-80f0-43adc840181a.webp"
        },
        "Check": {
            "wordRoot": "Check",
            "wordDefinition": "Check means to verify or confirm something, while compare means to examine the similarities and differences between two or more things.\n\nCheck is applicable when you want to ensure accuracy, like checking your homework for errors or checking if you have all the items on a grocery list.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3358b0cb-8094-47da-81a8-349bd29dc7f1.webp"
        },
        "Collate": {
            "wordRoot": "Collate",
            "wordDefinition": "Collate means to gather and arrange information or data in a particular order or sequence while compare means to examine two or more things in order to observe their similarities and differences.\n\nFor example, if you have a large set of papers and you want to arrange them in a specific order, you would use collate.\n\nCollate is used to organize and arrange information in a structured way, while compare is used to analyze and evaluate similarities and differences between different things or data sets.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/58f0c1e8-3569-4099-852e-93523d8efdff.webp"
        },
        "Contrast": {
            "wordRoot": "Contrast",
            "wordDefinition": "Contrast means to look at two or more things and find differences between them. For example, you might contrast two different kinds of ice cream to see which one is sweeter or has more chocolate chips.\n\nHowever, you would use compare when you want to focus on similarities and contrast when you want to focus on differences.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/24fcb177-63ed-4bfa-8068-706d6ed55145.webp"
        },
        "Equate": {
            "wordRoot": "Equate",
            "wordDefinition": "Equate means to consider two things as being equal or of the same value or importance. For example, you can equate the value of two different currencies, or equate the importance of two different tasks.\n\nEquations focus on similarities rather than differences, and imply that the two things being equated are equivalent in some way.\n\nCompare is used when you want to talk about the differences and similarities between two or more things, while equate is used when you want to suggest that two things have the same value or importance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ffcfaa8a-2771-4b4b-b59a-ee201652ca95.webp"
        },
        "Match": {
            "wordRoot": "Match",
            "wordDefinition": "Match means to find something that is identical or very similar to something else. For example, you might match a sock to its pair.\n\nMatch is used when you want to find something that is identical or compatible with another thing.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/db5a0515-be0d-4606-9d6b-296e05d956af.webp"
        },
        "Parallel": {
            "wordRoot": "Parallel",
            "wordDefinition": "Parallel means to extend or run alongside something without intersecting it. It is applicable when you want to describe things that are similar in certain ways but do not necessarily have anything in common.\n\nFor example, you can say that two rivers are parallel, meaning that they flow side by side without mixing.\n\nCompare is used when you want to find similarities and differences between things, while parallel is used when you want to describe things that are similar but not necessarily related.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a77c712c-9c63-4541-9642-a9c56ab85c9f.webp"
        }
    },
    "videos": [
        {
            "Text": " who showed the same levels of cognitive function and neural processing at the start, found that those who were exposed to a period of music learning showed enhancement in multiple brain areas, compared to the others. This recent research about the mental benefits of playing music has advanced our understanding of mental function,",
            "Title": "How playing an...",
            "VideoId": "R0JKCYZ8hng",
            "Controls": "start=242"
        },
        {
            "Text": " thousands of new stories you have seen this year tell me one just one that has allowed you to make better decisions for your private life or business life compared to not knowing it be truthful most people have a difficult time coming up with a single example now people push me and they say but you have to know if",
            "Title": "Four reasons you should...",
            "VideoId": "-miTTiaqFlI",
            "Controls": "start=150"
        },
        {
            "Text": " studies show that chronically sleeping fewer than six hours a night increases stroke risk by four and half times compared to those getting a consistent seven to eight hours of shuteye. For a handful of people on the planet who carry a rare inherited genetic mutation,",
            "Title": "What would happen if you...",
            "VideoId": "dqONk48l5vY",
            "Controls": "start=128"
        },
        {
            "Text": " It's not a weakness or a personality trait, and they shouldn't expect themselves to just get over it anymore than they could will themselves to get over a broken arm. If you haven't experienced depression yourself, avoid comparing it to times you've felt down.",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=205"
        },
        {
            "Text": " But even that number is minuscule compared to another infinity. Some physicists think the space-time continuum is literally infinite, and that it contains an infinite number of so-called pocket universes with varying properties. How's your brain doing?",
            "Title": "How many universes are...",
            "VideoId": "a1bWKZFP2Tc",
            "Controls": "start=185"
        },
        {
            "Text": " But even that number is minuscule compared to another infinity. Some physicists think the space-time continuum is literally infinite and that it contains an infinite number of so-called pocket universes with varying properties. How's your brain doing?",
            "Title": "Questions No One Knows...",
            "VideoId": "7SWvDHvWXok",
            "Controls": "start=285"
        },
        {
            "Text": " that could work very, very quickly. Now I don't have an exact budget for what this would cost, but I'm quite sure it's very modest compared to the potential harm. The World Bank estimates that if we have a worldwide flu epidemic,",
            "Title": "Bill Gates: The next...",
            "VideoId": "6Af6b_wyiwI",
            "Controls": "start=435"
        },
        {
            "Text": " it's very yang. Toothpicks are yin compared with a telephone pole. The back of a person is more yang than the front. The top of a person is the yang end. Taoism teaches that there is a power in the universe.",
            "Title": "The hidden meanings of...",
            "VideoId": "ezmR9Attpyc",
            "Controls": "start=147"
        },
        {
            "Text": " compared to other planets, making the blue world the solar system's coldest. In addition to its extreme temperatures and orbit, Uranus has a dramatic orientation.",
            "Title": "Uranus 101 PIPE National...",
            "VideoId": "m4NXbFOiOGk",
            "Controls": "start=92"
        },
        {
            "Text": " may lose another of its iconic wildlife species compared parent fish nearly a metre and",
            "Title": "Nature's Oddest Looking...",
            "VideoId": "GLPjP3hjhMM",
            "Controls": "start=556"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brene-brown.webp",
            "Text": "I'm just going to say it: I'm pro-guilt. Guilt is good. Guilt helps us stay on track because it's about our behavior. It occurs when we compare something we've done - or failed to do - with our personal values.",
            "Title": "American Author",
            "Name": "Brene Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mahatma-gandhi.webp",
            "Text": "Let everyone try and find that as a result of daily prayer he adds something new to his life, something with which nothing can be compared.",
            "Title": "Indian Leader",
            "Name": "Mahatma Gandhi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/woodrow-wilson.webp",
            "Text": "Property as compared with humanity, as compared with the red blood in the American people, must take second place, not first place.",
            "Title": "American President",
            "Name": "Woodrow Wilson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lao-tzu.webp",
            "Text": "When you are content to be simply yourself and don't compare or compete, everybody will respect you.",
            "Title": "Chinese Philosopher",
            "Name": "Lao Tzu"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michel-de-montaigne.webp",
            "Text": "Those who have compared our life to a dream were right... we were sleeping wake, and waking sleep.",
            "Title": "French Philosopher",
            "Name": "Michel de Montaigne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shehbaz-sharif.webp",
            "Text": "Personal interests have no importance compared to national interests.",
            "Title": "Pakistani Politician",
            "Name": "Shehbaz Sharif"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ed-skrein.webp",
            "Text": "We're always compared to somebody in all walks of life, aren't we?",
            "Title": "English Musician",
            "Name": "Ed Skrein"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-forbert.webp",
            "Text": "It's often said that life is strange. But compared to what?",
            "Title": "American Musician",
            "Name": "Steve Forbert"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mick-schumacher.webp",
            "Text": "Many world champions compare themselves to my father.",
            "Title": "German Driver",
            "Name": "Mick Schumacher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kathy-acker.webp",
            "Text": "I'm very staid compared to my students, actually.",
            "Title": "American Activist",
            "Name": "Kathy Acker"
        }
    ]
}