{
    "currentWord": {
        "wordRoot": "conclude",
        "id": 218,
        "phonemic": "kənˈkluːd|kənˈkluːd\r",
        "bigId": "a39296ec-9be4-46c3-83c7-d8ddc763054a",
        "wordForms": [
            "concludes",
            "concluding",
            "concluded",
            "conclude"
        ]
    },
    "senses": [
        {
            "id": "a39296ec-9be4-46c3-83c7-d8ddc763054a",
            "de": "To decide or determine something after a period of thought or research",
            "ty": "verb",
            "ex": "After examining all the evidence, the detective concluded that the butler was the culprit",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "conclude a deal",
                " conclude an argument",
                " conclude a meeting"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a39296ec-9be4-46c3-83c7-d8ddc763054a.webp",
            "Tips": [
                {
                    "title": "After Investigation",
                    "description": "Used when making a final decision after careful thought or research.",
                    "example": "The jury concluded that the defendant was innocent.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/IGiSgjgmjpisRe3dQ25N72hBA0.webp"
                },
                {
                    "title": "Final Decision",
                    "description": "Indicates a decision is the last step after exploring all options.",
                    "example": "We concluded to choose the blue design after seeing all samples.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/q7jZ8NEKqUk5CQwdjegMsGbxwcM.webp"
                }
            ]
        },
        {
            "id": "c008b97f-7fe2-44b7-8577-9185c6c9ca0b",
            "de": "To finish or bring something to an end",
            "ty": "verb",
            "ex": "The concert concluded with a spectacular fireworks display",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "conclude a performance",
                " conclude a speech",
                " conclude a ceremony"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c008b97f-7fe2-44b7-8577-9185c6c9ca0b.webp",
            "Tips": [
                {
                    "title": "Closing Events",
                    "description": "Refers to the last part or final moments of an event or action.",
                    "example": "The meeting concluded with a round of applause.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Wrap It Up",
                    "description": "Suggests completion of an action, speech, or written work.",
                    "example": "She concluded her essay with a poignant quote.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "20f4ee6a-d037-44a1-aa0f-98a4d675eaad",
            "de": "To formally and legally settle or arrange something such as a contract",
            "ty": "verb",
            "ex": "They concluded an agreement for a new trade treaty",
            "use": "",
            "co": "Legal",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "conclude a contract",
                " conclude an agreement",
                " conclude a treaty"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/20f4ee6a-d037-44a1-aa0f-98a4d675eaad.webp",
            "Tips": [
                {
                    "title": "Agreement Formality",
                    "description": "Indicates the formal finalization of agreements, especially legal ones.",
                    "example": "The nations concluded a peace treaty after long negotiations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Legally Binding",
                    "description": "Used to express the completion of a contract that is official and enforceable by law.",
                    "example": "The company concluded a binding agreement with its employees.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0ffb4c17-a7ea-4d47-85e4-2f90f3383632",
            "de": "To infer or judge from evidence or premises",
            "ty": "verb",
            "ex": "From the clues left at the scene, the detective concluded that it was an inside job",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "conclude from evidence",
                " conclude from data",
                " conclude from facts"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0ffb4c17-a7ea-4d47-85e4-2f90f3383632.webp",
            "Tips": [
                {
                    "title": "Deriving Conclusions",
                    "description": "Used when forming an opinion or explanation based on available information.",
                    "example": "Examining the data, she concluded that the hypothesis was correct.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Evidence to Judgment",
                    "description": "Marks the move from specific details to general understanding or judgement.",
                    "example": "He concluded from the symptoms that the patient had a rare disease.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Decider": {
            "wordRoot": "Decider",
            "wordDefinition": "A decider is a person or thing that performs the action of making a decision. For example, in a sports match, the final shot or goal that determines the winner can be called the 'decider.'.\n\nConclude describes the process of making a decision, while decider describes the person or thing that makes the final decision.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/385c4ccc-c250-48aa-a7b6-139b65de56a1.webp"
        },
        "Deduce": {
            "wordRoot": "Deduce",
            "wordDefinition": "Deduce means to reach a conclusion or inference through reasoning, especially from something known or assumed.\n\nIt is used when you are making an assumption based on known facts or logical deductions. For example, \"Based on the evidence we have collected, we can deduce that the suspect was at the scene of the crime.\".\n\nIn simpler terms, conclude is used when you have arrived at a decision based on evidence or reasoning, while deduce is used when you make a conclusion based on the facts presented to you.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a6b79c9a-ebee-4eeb-bcb3-59fe50ff38d7.webp"
        },
        "Determine": {
            "wordRoot": "Determine",
            "wordDefinition": "Determine means to establish or find out something through investigation, testing or calculation. It is applicable when trying to establish a fact, solution or outcome.\n\nFor example, \"The doctors ran several tests to determine the cause of the patient's symptoms.\"\n\nConclude is used when making a decision or judgment based on evidence, while determine is used when trying to establish a fact or solution through investigation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7bb3c1d7-4dc7-4a4a-9a95-c1c82766d7be.webp"
        },
        "Finish": {
            "wordRoot": "Finish",
            "wordDefinition": "Finish means to come to an end or complete a task. It suggests that something has been accomplished or completed.\n\nFor example, \"I need to finish my essay before the deadline.\"\n\nConclude is used when a decision is made based on evidence or facts, while finish is used when a task is completed.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/52fc860f-c77a-4aef-bd6f-4c6cd2d3f73d.webp"
        },
        "Infer": {
            "wordRoot": "Infer",
            "wordDefinition": "Infer means to make an educated guess or draw a conclusion based on evidence or reasoning.\n\nFor example, if we see a broken glass on the floor, we can infer that someone dropped it. But if we investigate further and find fingerprints and witness statements identifying the person who dropped the glass, we can conclude that it was that person who broke the glass.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/33206914-5738-4eea-a76a-c76d061bfb3d.webp"
        },
        "Resolve": {
            "wordRoot": "Resolve",
            "wordDefinition": "Resolve means to find a solution to a problem or difficult situation. It is applicable when there is a need to fix a problem or resolve a conflict.\n\nConclude is about making a decision and resolve is about solving a problem.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/01ad0f7a-9739-420f-a204-a5d1beb3ec2b.webp"
        },
        "Settle": {
            "wordRoot": "Settle",
            "wordDefinition": "Settle, on the other hand, means to resolve a dispute or come to an agreement. It's often used to describe the end of a conflict, typically between two parties, where a compromise has been reached.\n\nSo, for example, you might conclude a project after reviewing all the results and presenting them to your boss. But you might settle a disagreement with a friend by finding a compromise that makes both of you happy.\n\nConclude is often used to describe the end of a process or discussion, whereas settle is often used to describe the resolution of a dispute or conflict.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4b152a5b-ce31-4e56-a1a8-b93e5c39fc32.webp"
        }
    },
    "videos": [
        {
            "Text": " He concluded that his response was an ancient reaction unaffected by the nuances of modern civilization. So, to your conscious modern mind, it's a speech. To the rest of your brain, built up to code with the law of the jungle, when you perceive the possible consequences of blowing a speech, it's time to run for your life or fight to the death.",
            "Title": "The science of stage...",
            "VideoId": "K93fMnFKwfI",
            "Controls": "start=76"
        },
        {
            "Text": " depended solely on the element's quantity, and was not affected by physical or chemical changes. This led her to conclude that radiation was coming from something fundamental within the atoms of each element. The idea was radical and helped to disprove the long-standing model of atoms as indivisible objects.",
            "Title": "The genius of Marie...",
            "VideoId": "w6JFRi0Qm_s",
            "Controls": "start=113"
        },
        {
            "Text": " from her owner but what these signals are he can't explain there is something that's going on in the room when Jessie is there that's not going on when she's not so we can conclude from that that Maggie in some way is taking some cues from something that Jessie is doing whether or not she's aware of it",
            "Title": "Is Maths Dog Maggie a...",
            "VideoId": "Zfw1FXXhgRk",
            "Controls": "start=109"
        },
        {
            "Text": " the boy seemed to recover. Two months later, Jenner inoculated the boy again, this time with matter from a fresh smallpox lesion. No disease developed, and Jenner concluded that protection was complete. His plan had worked. Jenner later used the cowpox virus in several other people",
            "Title": "How we conquered the...",
            "VideoId": "yqUFy-t4MlQ",
            "Controls": "start=186"
        },
        {
            "Text": " From the curves measured for pixel separations, they concluded that paintings from Van Gogh's period of psychotic agitation behave remarkably similar to fluid turbulence. His self-portrait with a pipe, from a calmer period in Van Gogh's life, showed no sign of this correspondence.",
            "Title": "The unexpected math...",
            "VideoId": "PMerSm2ToFY",
            "Controls": "start=204"
        },
        {
            "Text": " So I'll conclude with just one final video that shows how this comes to bear on the pick worker's actual day in the life of. So as we mentioned, the process is to move inventory along the highway and then find your way into these pick stations. And our software in the background",
            "Title": "Mick Mountz: What...",
            "VideoId": "9UiK4llJOXc",
            "Controls": "start=591"
        },
        {
            "Text": " about the size of a planet that drain energy out of a much bigger star. It would be much too premature to conclude that this is evidence of life in the universe. There are also explanations for these observations that don't involve alien life forms.",
            "Title": "Is there a limit to...",
            "VideoId": "zVsHzS70krg",
            "Controls": "start=251"
        },
        {
            "Text": " a spoken word artist an entrepreneur and a creator most importantly she was a thriver she had suffered emotional abuse and molestation abandonment and violence in her family yet she had learned to heal herself by realizing and concluding",
            "Title": "Girls helping girls PIPE...",
            "VideoId": "THSig3OTvI8",
            "Controls": "start=81"
        },
        {
            "Text": " by thousands of independent scientists, every major scientific organization in the world has concluded that the crops currently on the market are safe to eat and that the process of genetic engineering",
            "Title": "Pamela Ronald: The case...",
            "VideoId": "wZ2TF8-PGQ4",
            "Controls": "start=775"
        },
        {
            "Text": " and that concludes this very graphic motivational seminar",
            "Title": "Cobra Devours Rat PIPE...",
            "VideoId": "8WQFJXuiLp8",
            "Controls": "start=91"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-adams.webp",
            "Text": "I began making pictures because I wanted to record what supports hope: the untranslatable mystery and beauty of the world. Along the way, however, the camera also caught evidence against hope, and I eventually concluded that this, too, belonged in pictures if they were to be truthful and thus useful.",
            "Title": "American Photographer",
            "Name": "Robert Adams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/colin-powell.webp",
            "Text": "Leadership is solving problems. The day soldiers stop bringing you their problems is the day you have stopped leading them. They have either lost confidence that you can help or concluded you do not care. Either case is a failure of leadership.",
            "Title": "American Statesman",
            "Name": "Colin Powell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christopher-voss.webp",
            "Text": "Very few negotiations are begun and concluded in the same sitting. It's really rare. In fact, If you sit down and actually complete your negotiation in one sitting, you left stuff on the table.",
            "Title": "American Businessman",
            "Name": "Christopher Voss"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/italo-calvino.webp",
            "Text": "Rarely does an interviewer ask questions you did not expect. I have given a lot of interviews, and I have concluded that the questions always look alike. I could always give the same answers.",
            "Title": "Italian Journalist",
            "Name": "Italo Calvino"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/felix-bloch.webp",
            "Text": "Thanking you once more, I want to wish you the best of luck for your future life and to conclude by saying to you: Dream your dreams and may they come true!",
            "Title": "Swiss Scientist",
            "Name": "Felix Bloch"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brad-holland.webp",
            "Text": "Many people have observed that truth is stranger than fiction. This has led some intellectuals to conclude that it's stranger than non-fiction as well.",
            "Title": "American Artist",
            "Name": "Brad Holland"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-de-la-bruyere.webp",
            "Text": "There is not in the world so toilsome a trade as the pursuit of fame; life concludes before you have so much as sketched your work.",
            "Title": "French Philosopher",
            "Name": "Jean de la Bruyere"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sana-khan.webp",
            "Text": "After watching a movie, you can't conclude that I am the same person in real life too.",
            "Title": "",
            "Name": "Sana Khan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/donna-shalala.webp",
            "Text": "We have not yet concluded that needle-exchange programs do not encourage drug use.",
            "Title": "American Public Servant",
            "Name": "Donna Shalala"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michio-kaku.webp",
            "Text": "I have concluded that we are in a world made by rules created by an intelligence.",
            "Title": "American Physicist",
            "Name": "Michio Kaku"
        }
    ]
}