{
    "currentWord": {
        "wordRoot": "confirm",
        "id": 5861,
        "phonemic": "kənˈfɜːm|kənˈfɜːrm\r",
        "bigId": "60a1350a-9353-40cd-a11e-833b106b8e3a",
        "wordForms": [
            "confirms",
            "confirming",
            "confirmed",
            "confirm"
        ]
    },
    "senses": [
        {
            "id": "60a1350a-9353-40cd-a11e-833b106b8e3a",
            "de": "To state or show that a fact is true.",
            "ty": "verb",
            "ex": "The doctor can do a test to confirm you are not sick.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "confirm a reservation",
                " confirm your identity",
                " confirm your email address"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/60a1350a-9353-40cd-a11e-833b106b8e3a.webp",
            "Tips": [
                {
                    "title": "Proof Required",
                    "description": "Use 'confirm' to talk about showing evidence or proof that something is true.",
                    "example": "The email you received confirms your concert tickets are booked.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/cCuHVqaIMRiDRehs1h1jCDkfmw.webp"
                },
                {
                    "title": "No Doubt Left",
                    "description": "'Confirm' suggests eliminating any doubt about a fact or information.",
                    "example": "This signature confirms the authenticity of the document.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/56LBDWSUt1GPKkWbKbQgn6beNuo.webp"
                }
            ]
        },
        {
            "id": "b7e6a380-9788-4ea4-9b46-ef674253855c",
            "de": "To make arrangements certain.",
            "ty": "verb",
            "ex": "Please confirm your attendance at the meeting.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "confirm your flight",
                " confirm your appointment",
                " confirm a booking"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b7e6a380-9788-4ea4-9b46-ef674253855c.webp",
            "Tips": [
                {
                    "title": "Finalize Plans",
                    "description": "'Confirm' often indicates making plans definite or official.",
                    "example": "I will confirm the venue for our meeting tomorrow.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Pre-event Usage",
                    "description": "Use 'confirm' before an event, to ensure arrangements are made.",
                    "example": "Can you confirm your hotel check-in date?",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6b14c35b-0ac3-40ae-978e-a21619216115",
            "de": "To give approval to something, especially by saying it is correct.",
            "ty": "verb",
            "ex": "The manager needs to confirm your report before it can be sent.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "confirm your selection",
                " confirm your order",
                " confirm your vote"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6b14c35b-0ac3-40ae-978e-a21619216115.webp",
            "Tips": [
                {
                    "title": "Formal Endorsement",
                    "description": "'Confirm' can imply formal or official approval of something.",
                    "example": "The board will confirm the new policy next week.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Last Step",
                    "description": "It's often the last step before an action can proceed.",
                    "example": "You need to confirm receipt of the package to start the return process.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "689b1062-0cc5-4c2d-b11b-c23f32593376",
            "de": "In a religious context, it means to make a Christian baptism complete by confirming faith in God.",
            "do": "Religion",
            "ty": "verb",
            "ex": "The bishop will confirm the new believers in the church.",
            "use": "",
            "co": "Religious",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "confirm in faith",
                " confirm in the church",
                " confirm a belief"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/689b1062-0cc5-4c2d-b11b-c23f32593376.webp",
            "Tips": [
                {
                    "title": "Spiritual Commitment",
                    "description": "In religion, 'confirm' indicates a commitment to faith.",
                    "example": "After being baptized, he will be confirmed at Easter.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ritual Importance",
                    "description": "The use of 'confirm' implies a significant religious ceremony or ritual.",
                    "example": "Her family attended her confirmation ceremony.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Affirm": {
            "wordRoot": "Affirm",
            "wordDefinition": "Affirm means to state positively or to declare to be true.\n\nIt is used to express agreement or support for something. For example, you might affirm your belief in a certain political party or affirm your commitment to a relationship.\n\nThe main difference between these two words is that affirm is used to declare support or belief in something while confirm is used to verify or establish the truth of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4d7ee8a6-c1ac-4b1e-bf74-35670210d8b4.webp"
        },
        "Approve": {
            "wordRoot": "Approve",
            "wordDefinition": "Approve means to give permission or agreement to something. For example, a teacher could approve a student's project proposal.\n\nAlternatively, a boss could approve an employee's leave of absence request.\n\nSo, in brief, approve is about giving permission or agreement, while confirm is about verifying the truth or accuracy of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6fb1d5e8-037d-4744-8137-b3a38373a4a2.webp"
        },
        "Assert": {
            "wordRoot": "Assert",
            "wordDefinition": "Assert means to state or declare something confidently, typically without providing any proof or evidence. It is applicable when you are expressing your opinion or belief.\n\nFor example, if you say, \"I assert that pineapple does not belong on pizza,\" you are expressing your opinion. But if someone says, \"Can you confirm if the sun is a star?\" you are being asked to verify a fact.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5b9e7961-33e4-4f93-b2de-b479b878a91d.webp"
        },
        "Certify": {
            "wordRoot": "Certify",
            "wordDefinition": "Certify means to officially verify or attest to something through an official process or documentation. For example, a document can be certified by a notary public, meaning the notary has verified that the document is genuine.\n\nIt can be used in a broader sense than certify, and does not necessarily involve an official process or documentation.\n\nCertify is used in more formal, official contexts, while confirm can be used in a wider range of situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b3172738-92e2-4b4a-bb7b-7937029af9fb.webp"
        },
        "Endorse": {
            "wordRoot": "Endorse",
            "wordDefinition": "Endorse means to express support or approval of something or someone. For example, if you endorse a product, you are saying that you like it and think that others should use it too.\n\nEndorse is usually used when there is a positive opinion or feeling towards something, and it is being recommended to others.\n\nConfirm is used to make sure something is true, while endorse is used to express support or approval of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d6371da8-9f69-4d21-bebb-f06a8cfd4a80.webp"
        },
        "Ratify": {
            "wordRoot": "Ratify",
            "wordDefinition": "Ratify means to give formal approval to something that has been negotiated or agreed upon. This typically refers to a more significant or legally binding agreement, such as a treaty or a contract.\n\nTo put it simply, confirming is like double-checking something that's already been decided, while ratifying is like officially approving something that's still being negotiated.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/48b48379-e310-4de5-8c5c-54e0201bb4b9.webp"
        },
        "Support": {
            "wordRoot": "Support",
            "wordDefinition": "Support means to provide assistance or help to something or someone.\n\nIf a student wants to help a friend who is struggling with the same math problem, they can offer to support their friend by explaining the concept or working through the problem together.\n\nConfirm is used when you want to make sure something is true or correct, while support is used when you want to help something or someone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1f630745-f3a5-4454-92eb-c75d98a5f411.webp"
        },
        "Validate": {
            "wordRoot": "Validate",
            "wordDefinition": "Validate means to evaluate, authenticate, or give official approval or recognition to something. For example, if a scientist performs an experiment, they may need to validate their results with other scientists or through additional experiments to ensure their findings are accurate and reliable.\n\nConfirm is used to ensure that something is correct or true, while validate is used to give official approval or recognition to something or make sure it is reliable or accurate.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/448bb058-21fd-4217-877d-3aef10565172.webp"
        },
        "Verify": {
            "wordRoot": "Verify",
            "wordDefinition": "The main difference between the words confirm and verify is that confirm means to make sure something that you already know is true or to agree with something that someone else has said or told you.\n\nVerify means to check if something is true or correct. For example, if you receive an email from your bank asking you to verify your identity by answering some security questions, you might need to confirm your name, address, and date of birth to prove that it's really you.\n\nTo sum up, confirm is used when you already know something and want to make it certain, while verify is used when you need to check if something is true or correct.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7ace7617-c006-447b-ade7-4680f89ecc15.webp"
        }
    },
    "videos": [
        {
            "Text": " Once attraction is confirmed, your bloodstream is flooded with norepinephrine, activating your fight or flight system. Your heart beats faster, your pupils dilate, and your body releases glucose for additional energy, not because you're in danger but because your body is telling you that something important is happening. To help you focus,",
            "Title": "The science of...",
            "VideoId": "169N81xAffQ",
            "Controls": "start=206"
        },
        {
            "Text": " But it turns out that quantum entanglement has been confirmed in real world lab experiments. Two subatomic particles entangled in a superposition state, where if one spins one way then the other must spin the other way, will do just that, even when there's no way for information to pass from one particle to the other",
            "Title": "What can Schrödinger's...",
            "VideoId": "z1GCnycbMeA",
            "Controls": "start=244"
        },
        {
            "Text": " She had a hunch that this strange, 1.5 meter long specimen was important but couldn't preserve it in time to be studied and had it taxidermied. When she finally was able to reach J.L.B. Smith, a local fish expert, he was able to confirm, at first site, that the creature was indeed a coelacanth.",
            "Title": "The coelacanth: A living...",
            "VideoId": "ujKL1pUHDfo",
            "Controls": "start=59"
        },
        {
            "Text": " in order to ease replication efforts. The peer review process can also be strengthened to more efficiently weed out weak papers prior to publication. And we could temper the pressure to find big results by publishing more papers that fail to confirm the original hypothesis,",
            "Title": "Is there a reproducibilit...",
            "VideoId": "FpCrY7x5nEE",
            "Controls": "start=225"
        },
        {
            "Text": " The drive to do things cause they matter. And here's the best part. We already know this. The science confirms what we know in our hearts. So, if we repair this mismatch between science and business, if we bring our motivation, notions of motivation into the 21st century,",
            "Title": "The puzzle of motivation...",
            "VideoId": "rrkrvAUbU9Y",
            "Controls": "start=1069"
        },
        {
            "Text": " and started moving, touching the baby with her nose in the mouth just to check. I think she was checking whether the baby was alright. I mean, the baby was moving or if she was simply dead. And then the driver confirmed it, said that baby's dead.",
            "Title": "Disturbing Encounter...",
            "VideoId": "hhdEH55Zaj8",
            "Controls": "start=181"
        },
        {
            "Text": " and Juno's actually confirmed that in the lower part of the atmosphere, one out of 400 molecules is a water molecule. That's a lot of water. Does that mean that there is life in Jupiter's atmosphere? Well, ultimately, we don't know.",
            "Title": "Uncovering Jupiter's...",
            "VideoId": "qDLWe9FKgso",
            "Controls": "start=287"
        },
        {
            "Text": " between its star and Earth, thereby deeming its star's light. Scientists have suspected the existence of worlds outside of our solar system for thousands of years. But the first confirmed existence of an exoplanet",
            "Title": "Exoplanets 101 PIPE...",
            "VideoId": "EUU0-ZpFoK4",
            "Controls": "start=133"
        },
        {
            "Text": " When blood tests suggest the possibility of celiac, the diagnosis is confirmed with a biopsy. The most effective treatment is a gluten-free diet, which helps heal intestinal damage and improve symptoms.",
            "Title": "What’s the big deal with...",
            "VideoId": "uEM2iDT-VAk",
            "Controls": "start=135"
        },
        {
            "Text": " line I felt validation because here was this person who had actually witnessed what I knew to be true and it confirmed what I knew so he had said two options suicide or",
            "Title": "How to deal with...",
            "VideoId": "v4P2Qwh1QCU",
            "Controls": "start=123"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sally-hawkins.webp",
            "Text": "When an audience is affected in a way that I've seen with some people, it's so inspiring to me an actor. You know that you're on the right track and you're doing work that can affect people. When that goes hand-in-hand with important issues that we're still living with, and we will be for a long time, sadly, it's so confirming of everything.",
            "Title": "English Actress",
            "Name": "Sally Hawkins"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-dennett.webp",
            "Text": "We should get used to the idea that we'll probably never be able to find - and confirm - a good explanation of the ultimate origin of the universe, though I see no reason to believe that we can't press much further on this question than we have managed to date.",
            "Title": "American Philosopher",
            "Name": "Daniel Dennett"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rachel-cusk.webp",
            "Text": "Having your second child, in case you were wondering, is a lot harder than having your first, except for those people who find it easier. I'm afraid I don't have the latest figures to confirm this.",
            "Title": "Canadian Novelist",
            "Name": "Rachel Cusk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anthony-russo.webp",
            "Text": "Our experience making 'Pieces,' all it did was confirm our passion for film making to ourselves. We were having the time of our lives, and we were in love with what we were doing.",
            "Title": "American Director",
            "Name": "Anthony Russo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kathleen-edwards.webp",
            "Text": "There's nothing more confirming in your life than looking in front of you and seeing some really amazing people who you care a lot about who care a lot about you.",
            "Title": "Canadian Musician",
            "Name": "Kathleen Edwards"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/william-herschel.webp",
            "Text": "All human discoveries seem to be made only for the purpose of confirming more strongly the truths come from on high, and contained in the sacred writings.",
            "Title": "British Scientist",
            "Name": "William Herschel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-ratcliffe.webp",
            "Text": "I want to make it very clear, if confirmed as DNI, every whistleblower - past, present and future - will enjoy every protection under the law.",
            "Title": "",
            "Name": "John Ratcliffe"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daisaku-ikeda.webp",
            "Text": "All people have a natural desire to be needed, to have their importance to others tangibly confirmed.",
            "Title": "Japanese Writer",
            "Name": "Daisaku Ikeda"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-malthus.webp",
            "Text": "It is an acknowledged truth in philosophy that a just theory will always be confirmed by experiment.",
            "Title": "English Economist",
            "Name": "Thomas Malthus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/danny-boyle.webp",
            "Text": "I want people to leave the cinema feeling that something's been confirmed for them about life.",
            "Title": "English Director",
            "Name": "Danny Boyle"
        }
    ]
}