{
    "currentWord": {
        "wordRoot": "consider",
        "id": 4926,
        "phonemic": "kənˈsɪdə(r)|kənˈsɪdər\r",
        "bigId": "059f111b-f8ba-4c4d-b5a8-fb0bf1a8de44",
        "wordForms": [
            "considers",
            "considering",
            "considered",
            "consider"
        ]
    },
    "senses": [
        {
            "id": "059f111b-f8ba-4c4d-b5a8-fb0bf1a8de44",
            "de": "To think carefully about something, usually before making a decision",
            "ty": "verb",
            "ex": "You should consider the consequences before making a decision",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "consider the consequences",
                " consider the options",
                " consider the possibilities"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/059f111b-f8ba-4c4d-b5a8-fb0bf1a8de44.webp",
            "Tips": [
                {
                    "title": "Prior Consideration",
                    "description": "Use 'consider' when you need time to think before deciding.",
                    "example": "Let's consider all our options first.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/M0NyLJ4GFxciPEXeHS5A8B71M.webp"
                },
                {
                    "title": "Weighing Choices",
                    "description": "'Consider' suggests comparing different choices thoughtfully.",
                    "example": "I will consider your advice while making my choice.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/lcf1pQuhqszdQu2HwTiIerfk.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "f5944615-91d4-486b-9535-7c890dbf6046",
            "de": "To regard or view in a certain way",
            "ty": "verb",
            "ex": "I consider you a friend",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "consider someone a friend",
                " consider it done",
                " consider it a compliment"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f5944615-91d4-486b-9535-7c890dbf6046.webp",
            "Tips": [
                {
                    "title": "Subjective View",
                    "description": "'Consider' can express a personal opinion or viewpoint.",
                    "example": "She considers herself quite lucky.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Matter of Perspective",
                    "description": "When using 'consider' in this sense, it’s subjective and can vary from person to person.",
                    "example": "You may consider the task easy, but others find it hard.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "62bf2ba6-a3aa-4f01-bce2-8659741b4c8a",
            "de": "To take something into account when making plans or decisions",
            "ty": "verb",
            "ex": "We'll need to consider our budget when planning the event",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "consider the budget",
                " consider the weather",
                " consider the facts"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/62bf2ba6-a3aa-4f01-bce2-8659741b4c8a.webp",
            "Tips": [
                {
                    "title": "Planning Ahead",
                    "description": "Use 'consider' when factors affect future plans or decisions.",
                    "example": "Consider the weather when packing for your trip.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Informed Decisions",
                    "description": "'Consider' implies looking at all aspects to make a well-informed decision.",
                    "example": "Consider both the pros and cons carefully.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "31465ecd-275e-4947-a01d-a4a4855d03a6",
            "de": "To think about and discuss something before reaching a conclusion",
            "ty": "verb",
            "ex": "The jury is still considering the evidence",
            "use": "",
            "co": "Legal",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "consider the evidence",
                " consider a proposal",
                " consider the options"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/31465ecd-275e-4947-a01d-a4a4855d03a6.webp",
            "Tips": [
                {
                    "title": "Legal Decisions",
                    "description": "In a legal context, 'consider' means to deliberate on evidence before a conclusion.",
                    "example": "The judges will consider the new testimony.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Discuss First",
                    "description": "Before agreeing to a proposal, 'consider' signals the need for a discussion.",
                    "example": "We should consider his offer before responding.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Assess": {
            "wordRoot": "Assess",
            "wordDefinition": "Assess means to evaluate or measure something to determine its value or quality. It's often used in more technical or formal settings like when someone is grading your performance or when a doctor is examining your health.\n\nAssess is objective and based on data or evidence, while consider is more subjective and involves weighing options or perspectives.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/442852dd-d9fe-4767-94a3-78d50c1c82d6.webp"
        },
        "Contemplate": {
            "wordRoot": "Contemplate",
            "wordDefinition": "Both consider and contemplate mean to think about something, but consider is used when you are thinking about something seriously and trying to make a decision, while contemplate is used when you are trying to understand something deeper or when you are reflecting on something.\n\nFor example, you might consider which college to attend, but you might contemplate the meaning of life.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/90b3e452-748c-410f-b5f7-786283532ebb.webp"
        },
        "Deliberate": {
            "wordRoot": "Deliberate",
            "wordDefinition": "Deliberate means to think about something very carefully and slowly, making sure that you are considering all possible options and outcomes.\n\nHowever, consider is used when you are thinking about a decision, while deliberate is used when you are thinking about a decision very deeply and slowly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4f4aa6b2-ae7f-46dd-8d00-49b178a00551.webp"
        },
        "Examine": {
            "wordRoot": "Examine",
            "wordDefinition": "Both consider and examine mean to think about something carefully, but consider implies more of a general contemplation or evaluation, while examine indicates a more detailed inspection or analysis.\n\nFor example, you might consider which college to attend, weighing factors such as location, reputation, and cost. You might examine a specimen in a science lab, looking closely at its physical characteristics under a microscope.\n\nConsider is used for more abstract or conceptual things, while examine is used for more concrete or tangible things that can be inspected or studied in detail.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9624135c-7cec-4c0a-a399-a81e6fe400d4.webp"
        },
        "Ponder": {
            "wordRoot": "Ponder",
            "wordDefinition": "Both consider and ponder are verbs that are used to describe the act of thinking about something carefully.\n\nPonder suggests a deeper, more contemplative kind of thinking. It means to think deeply about something, often with a sense of wonder or awe.\n\nFor example, you might ponder the mysteries of the universe or the meaning of life.\n\nIn summary, both words involve careful thought, but consider tends to imply a more practical, decision-making process, while ponder suggests a more philosophical, reflective type of thinking.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e6dafc56-143a-4ee7-b9fb-9383598434a7.webp"
        },
        "Reflect": {
            "wordRoot": "Reflect",
            "wordDefinition": "Reflect means to think deeply about something and to try and understand it from different perspectives. It is applicable when you need to analyze your own thoughts and feelings, or to gain insight into the actions or motivations of others.\n\nIn essence, consider is more about making a decision, while reflect is more about gaining understanding.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a10e22ab-b858-4df6-895f-0eaf5eb848d0.webp"
        },
        "Scrutinize": {
            "wordRoot": "Scrutinize",
            "wordDefinition": "Scrutinize means to examine something closely or to inspect it thoroughly. For example, if you are scrutinizing a document, you might be looking for errors or discrepancies.\n\nConsider is used when you are weighing different options or perspectives, while scrutinize is used when you are examining something in detail or looking for specific information.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/53f17615-8dfe-4eba-9d1e-aef39e0ff54e.webp"
        },
        "Weigh": {
            "wordRoot": "Weigh",
            "wordDefinition": "Weigh means to carefully evaluate and compare the different factors or options involved in a decision. It involves determining the pros and cons of each option and deciding which one has more benefits or advantages.\n\nFor example, if you are trying to decide whether or not to take a new job, you would weigh the benefits like salary and career growth opportunities against the factors like work-life balance and commute time.\n\nIn summary, 'considering' is when you think about something to form an opinion or make a decision, while 'weighing' involves evaluating and comparing the different factors or options involved in a decision.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e662478c-9b66-4cd1-bb98-0ee3858034b9.webp"
        }
    },
    "videos": [
        {
            "Text": " consider the way you think about your abilities and talents. Do you think they are fixed at birth, or that they can be developed, like a muscle? These beliefs matter because they can influence how you act when you're faced with setbacks. If you have a fixed mindset, meaning that you think your talents are locked in place,",
            "Title": "3 tips to boost your...",
            "VideoId": "l_NYrWqUR40",
            "Controls": "start=124"
        },
        {
            "Text": " eye trackers, infrared brain scanners, and even the 400-pound electroencephalogram. But although such tools have worked under certain circumstances, most can be fooled with enough preparation, and none are considered reliable enough to even be admissible in court. But, what if the problem is not with the techniques,",
            "Title": "The language of lying —...",
            "VideoId": "H0-WkpmTPrM",
            "Controls": "start=34"
        },
        {
            "Text": " When we consider all this evidence, along with the fact that elephants are one of the few species who can recognize themselves in a mirror, it's hard to escape the conclusion that they are conscious, intelligent, and emotional beings. Unfortunately, humanity's treatment of elephants does not reflect this,",
            "Title": "Why elephants never...",
            "VideoId": "lSXNqsOoURg",
            "Controls": "start=261"
        },
        {
            "Text": " is real, there are questions on whether it is phosphine or potentially other molecules that can mimic the same signal like sulfur dioxide. If the signal is real and it is phosphine, we still have to be able to explain what or who is making it. And only then could we consider that we have found life.",
            "Title": "Are There Aliens on...",
            "VideoId": "9fzhHiYDGhg",
            "Controls": "start=330"
        },
        {
            "Text": " The frustrating answer is we don't really know. However, we have some important clues. OCD is considered a neurobiological disorder. In other words, research suggests that OCD sufferers brains are actually hardwired to behave in a certain fashion. Research has implicated three regions of the brain",
            "Title": "Debunking the myths of...",
            "VideoId": "DhlRgwdDc-E",
            "Controls": "start=171"
        },
        {
            "Text": " and made to go through a bewildering process where neither the cause of his arrest, nor the nature of the judicial proceedings are made clear to him. This sort of scenario is considered so characteristic of Kafka's work that scholars came up with a new word for it.",
            "Title": "What makes something...",
            "VideoId": "wkPR4Rcf4ww",
            "Controls": "start=22"
        },
        {
            "Text": " contests new players started to him if you consider how the Cold War existed it really existed on three tensions there was a nuclear tension both both states had nuclear weapons to end all life there was an ideological tension one was an exporter of democracy and",
            "Title": "What game theory teaches...",
            "VideoId": "0bFs6ZiynSU",
            "Controls": "start=269"
        },
        {
            "Text": " a vast, spherical collection of icy debris. It is considered the edge of the solar system since that is where the gravitational and physical influences of the sun end. Our solar system's particular configuration of planets and other celestial objects,",
            "Title": "Solar System 101 PIPE...",
            "VideoId": "libKVRa01L8",
            "Controls": "start=208"
        },
        {
            "Text": " but the pressure for women is to hide, minimize and deny, which isn't surprising when you consider that there are still nine countries where women can be killed for straying. Now, monogamy used to be one person for life.",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=153"
        },
        {
            "Text": " And because the rank order is known in advance, each can accurately predict how the others would vote in any situation and adjust their own votes accordingly. Because Eliza's last, she has the most outcomes to consider,",
            "Title": "Can you solve the pirate...",
            "VideoId": "Mc6VA7Q1vXQ",
            "Controls": "start=143"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sergio-ramos.webp",
            "Text": "Throughout my career, I have faced the best forward players in the world - many of them who are considered among the greatest ever. For me, there is never a fear. A respect, yes, but never a fear.",
            "Title": "Spanish Athlete",
            "Name": "Sergio Ramos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maya-angelou.webp",
            "Text": "I'm considered wise, and sometimes I see myself as knowing. Most of the time, I see myself as wanting to know. And I see myself as a very interested person. I've never been bored in my life.",
            "Title": "American Poet",
            "Name": "Maya Angelou"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/selena-gomez.webp",
            "Text": "If you have three people in your life that you can trust, you can consider yourself the luckiest person in the whole world.",
            "Title": "American Actress",
            "Name": "Selena Gomez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/susan-minot.webp",
            "Text": "I don't consider the first-world concerns any less important than the third-world ones.",
            "Title": "American Novelist",
            "Name": "Susan Minot"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/idi-amin.webp",
            "Text": "I myself consider myself the most powerful figure in the world.",
            "Title": "Statesman",
            "Name": "Idi Amin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nyjah-huston.webp",
            "Text": "I consider myself really lucky to have had such a good life.",
            "Title": "American Athlete",
            "Name": "Nyjah Huston"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-pogba.webp",
            "Text": "My deepest respect to the clubs who considered having me.",
            "Title": "French Athlete",
            "Name": "Paul Pogba"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gerard-depardieu.webp",
            "Text": "I consider myself a free man and a citizen of the world.",
            "Title": "French Actor",
            "Name": "Gerard Depardieu"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-huston.webp",
            "Text": "I've always considered myself a character actor.",
            "Title": "English Actor",
            "Name": "Jack Huston"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/pavel-durov.webp",
            "Text": "I consider myself a legal citizen of the world.",
            "Title": "Russian Businessman",
            "Name": "Pavel Durov"
        }
    ]
}