{
    "currentWord": {
        "wordRoot": "conservative",
        "id": 15707,
        "phonemic": "kənˈsɜːvətɪv|kənˈsɜːrvətɪv\r",
        "bigId": "408bb7cd-65de-4b75-8f6e-51d52ece1564",
        "wordForms": [
            "conservatives",
            "conservatively",
            "conservative"
        ]
    },
    "senses": [
        {
            "id": "408bb7cd-65de-4b75-8f6e-51d52ece1564",
            "de": "Opposed to great or sudden social change; showing that you prefer traditional styles and values.",
            "ty": "adj",
            "ex": "He is a conservative politician.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "conservative beliefs",
                " conservative approach",
                " conservative values"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/408bb7cd-65de-4b75-8f6e-51d52ece1564.webp",
            "Tips": [
                {
                    "title": "Political Stance",
                    "description": "Often relates to political ideology favouring traditional values and established institutions.",
                    "example": "His conservative stance is reflected in his political voting.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sqB6EBHEHBaR7hR43wDBezo859k.webp"
                },
                {
                    "title": "Resistant to Change",
                    "description": "Can suggest reluctance to adopt new policies or progressive trends in society.",
                    "example": "The conservative viewpoint resists changing the established school curriculum.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/DODQ1qcxd2bjAFRbU3rdAP0UBes.webp"
                },
                {
                    "title": "Cultural Preferences",
                    "description": "May refer to a preference for classical or traditional art, music, and literature.",
                    "example": "She has a conservative taste in music, preferring classical over modern genres.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/jnQu4QvS82DFA9IF9AB9KPoDqs8.webp"
                }
            ]
        },
        {
            "id": "a7b5aca6-c5a8-45b6-a2b8-c7ec09fe2650",
            "de": "Used to describe a person who carefully manages resources, like money or energy, and avoids waste.",
            "ty": "adj",
            "ex": "She's conservative with her money, preferring to save rather than spend.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "conservative spending",
                " conservative use",
                " conservative estimates"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a7b5aca6-c5a8-45b6-a2b8-c7ec09fe2650.webp",
            "Tips": [
                {
                    "title": "Budget Wise",
                    "description": "Suggests careful planning and allocation of resources to avoid unnecessary expenditure.",
                    "example": "Their conservative budget allowed them to save for future investments.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Risk-averse",
                    "description": "Implies being cautious and avoiding risky decisions, especially financially.",
                    "example": "Her conservative financial choices protected her from the market crash.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "64e1ba9b-8494-4e99-8172-33963168a9a8",
            "de": "A person who is averse to change and holds to traditional values and attitudes, typically in relation to politics.",
            "ty": "noun",
            "ex": "My aunt is a staunch Conservative and will never vote for a liberal party.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "vote conservative",
                " self-identified conservative",
                " staunch conservative"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/64e1ba9b-8494-4e99-8172-33963168a9a8.webp",
            "Tips": [
                {
                    "title": "Not Political 'liberal'",
                    "description": "Indicates a person who does not align with political liberalism.",
                    "example": "As a conservative, he often debates against liberal policies.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Traditional Morals",
                    "description": "May imply adherence to traditional social norms and moral values.",
                    "example": "He's conservative in his lifestyle, upholding family traditions.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "ccec7450-54e9-46eb-9bdc-5e6a605eda51",
            "de": "A member or supporter of a Conservative Party, especially the one existing in the UK.",
            "do": "political",
            "ty": "noun",
            "ex": "The Conservatives won the last general election.",
            "use": "",
            "re": "Neutral",
            "br": true,
            "tp": "",
            "cl": [
                "vote conservatives",
                " conservative government",
                " conservative party member"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ccec7450-54e9-46eb-9bdc-5e6a605eda51.webp",
            "Tips": [
                {
                    "title": "Specific Party",
                    "description": "Specific to supporters of the UK's Conservative Party, not conservatives in general.",
                    "example": "She canvasses for the Conservatives every election.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Context-Dependent",
                    "description": "In a UK context, it always refers to the Conservative Party, not to conservative ideology.",
                    "example": "The Conservatives' policies differ from those of other UK parties.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Conventional": {
            "wordRoot": "Conventional",
            "wordDefinition": "Conventional refers to a practice or idea that is widely accepted or used by society. It is based on an established set of rules or norms and may not necessarily be traditional or conservative.\n\nConventional ideas are applicable in fields like science, engineering, and technology, where widely accepted practices are followed to achieve certain outcomes.\n\nConservative means sticking to traditional beliefs, and conventional means following generally accepted practices.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b8b97770-0bfe-4aba-8cc1-6814a895f652.webp"
        },
        "Orthodox": {
            "wordRoot": "Orthodox",
            "wordDefinition": "Orthodox means someone who adheres strictly to established beliefs or doctrines, especially in religion or politics.\n\nIt can also be applicable in different areas such as culture, philosophy, or medicine. For example, an orthodox Christian would follow the traditional teachings of the Bible, while an orthodox physician would adhere to established medical practices and procedures.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5f9fc12c-c935-4901-ad79-cdb84ce3b5fd.webp"
        },
        "Reactionary": {
            "wordRoot": "Reactionary",
            "wordDefinition": "Reactionary is a more extreme form of conservatism that seeks to return society to a previous, often idealized state. They are opposed to social or political change, and can be militant in their opposition to perceived threats to their beliefs.\n\nIn practical terms, conservatism might mean supporting lower taxes and limited government interference in the economy, while reactionary beliefs might include opposing marriage equality or racial integration.\n\nGenerally, conservatism is a more moderate and mainstream political ideology, while reactionaries are often viewed as fringe or radical.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a82abee5-6abb-4ded-89fd-b26dd0421abf.webp"
        },
        "Regressive": {
            "wordRoot": "Regressive",
            "wordDefinition": "Regressive, on the other hand, refers to policies, movements, or ideas that seek to return to a less advanced or progressive state.\n\nIn simple terms, being conservative means wanting to maintain what exists, while being regressive means wanting to reverse the progress that has been made.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9c00772f-4db5-4a41-ae23-deb3dae04107.webp"
        },
        "Republican": {
            "wordRoot": "Republican",
            "wordDefinition": "Republican refers to a political party in the United States that aligns with conservative values, but also supports specific policies and candidates.\n\nConservative is a broader term that can be applied to individuals or groups with a particular belief system, while Republican is a specific political organization.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cb1e58c3-abd7-4185-aad9-ecbe98d72635.webp"
        },
        "Retrogressive": {
            "wordRoot": "Retrogressive",
            "wordDefinition": "Retrogressive means becoming less advanced or progressive, going back in time or reversing progress.\n\nIn simpler terms, conservative means wanting to keep things the same, while retrogressive means going backwards.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cb273f22-01dc-48a1-b1b8-238fbd8c8406.webp"
        },
        "Tory": {
            "wordRoot": "Tory",
            "wordDefinition": "On the other hand, Tory is a specific term used to refer to members of the Conservative Party in the UK. It has historical roots and is often used in the context of British politics.\n\nConservative is a broader term that describes a political ideology, while Tory refers specifically to members of the Conservative Party in the UK.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/74562622-84c8-4906-8953-72673c721c2d.webp"
        },
        "Traditional": {
            "wordRoot": "Traditional",
            "wordDefinition": "Traditional refers to something that has been done a certain way for a long time, usually because of cultural or historical reasons.\n\nWhile there is some overlap between the two words, conservative is more about resisting change and traditional is more about following established practices.\n\nEach one can be applicable depending on the context. For example, a conservative politician might want to maintain existing laws and policies, while someone who values traditional family structures might prioritize marriage and gender roles.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c4a2a804-0f61-4dcf-b24b-721e3083d70f.webp"
        }
    },
    "videos": [
        {
            "Text": " to what we think we have. Now, we can ask these questions, by the way, not just about wealth. We can ask it about other things as well. So for example, we asked people from different parts of the world about this question, people who are liberals and conservatives, and they gave us basically the same answer.",
            "Title": "How equal do we want the...",
            "VideoId": "2tCcoSRZqVY",
            "Controls": "start=320"
        },
        {
            "Text": " a playful mindful brand what is your brand if somebody actually described your brand identity your brand personality what would you be are you an up attribute are you something that gets the blood flowing are you more of a Down attribute are you something a little more calm reserved conservative up",
            "Title": "The greatest TED Talk...",
            "VideoId": "Y2jyjfcp1as",
            "Controls": "start=865"
        },
        {
            "Text": " for al gore i don't need to show of hands because we all have the same political stereotypes we all know that it's uh that it's bill in this case the stereotype corresponds to a reality it really is a fact that liberals are much higher than conservatives on a major personality trait",
            "Title": "The moral roots of...",
            "VideoId": "8SOQduoLgRw",
            "Controls": "start=40"
        },
        {
            "Text": " You can see we're playing up the fears and really taking a conservative look at the upside. So if you attempted whatever you're considering, might you build confidence, develop skills, emotionally, financially, otherwise? What might be the benefits of, say, a base hit?",
            "Title": "Why you should define...",
            "VideoId": "5J6jAC6XxAI",
            "Controls": "start=497"
        },
        {
            "Text": " But just enough compassion to understand how they got to where they are. And to be honest, there were a couple of fair points. One of them was how liberals have this wide acceptance for everybody except for those with honestly held conservative viewpoints.",
            "Title": "A Black man goes...",
            "VideoId": "OqUaEJLfrLo",
            "Controls": "start=619"
        },
        {
            "Text": " on the right, conservatives, you're always talking about taxes and regulations and big government. And on the left, liberals, you're talking about economics, it's always about income inequality. Right? Now those are important things,",
            "Title": "A conservative's plea:...",
            "VideoId": "87AEeLpodnE",
            "Controls": "start=669"
        },
        {
            "Text": " alive numbers are conservative odds are you know someone with bipolar disorder who's undiagnosed odds are you know someone with bipolar disorder and who is afraid of seeking treatment because of the stigma the taboo I've shared my",
            "Title": "Understanding bipolar...",
            "VideoId": "ioJEx4eFPtE",
            "Controls": "start=255"
        },
        {
            "Text": " top of being really conservative lds we also went to a mormon private school my sister and i both so being lds was our life it's one of the reasons that you know i didn't find out about what being trans was until i was an adult",
            "Title": "Growing Up Transgender...",
            "VideoId": "Z8FZewEPAAk",
            "Controls": "start=301"
        },
        {
            "Text": " training period the ones that we have are pretty exceptional but all that training is worth it because conservative estimates put the value of one police horse on duty the same as ten",
            "Title": "Police Horse Training PIPE...",
            "VideoId": "phXXvbSLidU",
            "Controls": "start=89"
        },
        {
            "Text": " I want to talk about what we learn from conservatives. And I'm at a stage in life where I'm yearning for my old days, so I want to confess to you that when I was a kid,",
            "Title": "Lawrence Lessig:...",
            "VideoId": "xyf_0SMAsFA",
            "Controls": "start=14"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/p-j-orourke.webp",
            "Text": "Liberals are always proposing perfectly insane ideas, laws that will make everybody happy, laws that will make everything right, make us live forever, and all be rich. Conservatives are never that stupid.",
            "Title": "American Comedian",
            "Name": "P. J. O'Rourke"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-phelps.webp",
            "Text": "I live a pretty conservative life, so I probably really haven't done anything crazy.",
            "Title": "American Athlete",
            "Name": "Michael Phelps"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-moore.webp",
            "Text": "I'm actually a fairly conservative person. I live a very conservative lifestyle.",
            "Title": "American Activist",
            "Name": "Michael Moore"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kim-alexis.webp",
            "Text": "I'm conservative. I was raised conservative, and that's the way I will vote.",
            "Title": "American Model",
            "Name": "Kim Alexis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/leo-rosten.webp",
            "Text": "A conservative is one who admires radicals centuries after they're dead.",
            "Title": "American Novelist",
            "Name": "Leo Rosten"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bill-flores.webp",
            "Text": "By trying to advance the perfect conservative solution, nobody wins.",
            "Title": "American Politician",
            "Name": "Bill Flores"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dean-cain.webp",
            "Text": "The truth is, I am conservative, but socially, I'm very liberal.",
            "Title": "American Actor",
            "Name": "Dean Cain"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-miller.webp",
            "Text": "I do think it's possible to have a conservative personality.",
            "Title": "American Public Servant",
            "Name": "Stephen Miller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/radha-mitchell.webp",
            "Text": "I think my parents see my life now as very conservative.",
            "Title": "Australian Actress",
            "Name": "Radha Mitchell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kellyanne-conway.webp",
            "Text": "Women overwhelmingly support conservative policies.",
            "Title": "American Businesswoman",
            "Name": "Kellyanne Conway"
        }
    ]
}