{
    "currentWord": {
        "wordRoot": "continue",
        "id": 11516,
        "phonemic": "kənˈtɪnjuː|kənˈtɪnjuː\r",
        "bigId": "03a07759-f76d-4927-9aa9-46592935af69",
        "wordForms": [
            "continues",
            "continuing",
            "continued",
            "continue"
        ]
    },
    "senses": [
        {
            "id": "03a07759-f76d-4927-9aa9-46592935af69",
            "de": "to not stop doing something",
            "ty": "verb",
            "ex": "Despite the heavy rain, the game continued.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "continue doing something",
                " continue to do something",
                " continue with something"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/03a07759-f76d-4927-9aa9-46592935af69.webp",
            "Tips": [
                {
                    "title": "Action Persistence",
                    "description": "Used when actions or activities persist despite challenges or changes.",
                    "example": "She continued reading even as the lights dimmed.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/yzZSbyM3XWeQyQtpqdZ7LEHL4.webp"
                },
                {
                    "title": "With Adverbs",
                    "description": "Often paired with adverbs to describe the manner of continuation, such as 'quietly' or 'steadily'.",
                    "example": "They continued quietly discussing the issue.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/J9ssLyyGn71QJVSis2XdtoDluiI.webp"
                }
            ]
        },
        {
            "id": "ae040abb-5d8e-4ee2-af54-1cb7f5f7d76c",
            "de": "to stay in the same situation or condition",
            "ty": "verb",
            "ex": "Her condition continued to improve.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "continue to improve",
                " continue much the same",
                " continue as"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ae040abb-5d8e-4ee2-af54-1cb7f5f7d76c.webp",
            "Tips": [
                {
                    "title": "State Stability",
                    "description": "Emphasizes stability or lack of change in a situation, condition, or state over time.",
                    "example": "The weather continued to be sunny all week.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Progressive Improvement",
                    "description": "Indicates ongoing positive change, often related to health, performance, or quality.",
                    "example": "His grades continued to rise throughout the semester.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "1fc5d6c6-c2b7-4770-a0dc-0db44bc612a1",
            "de": "to carry on a lawsuit or other legal process",
            "do": "legal",
            "ty": "verb",
            "ex": "The attorney decided to continue the case.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "continue a lawsuit",
                " continue legal proceedings",
                " continue the case"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1fc5d6c6-c2b7-4770-a0dc-0db44bc612a1.webp",
            "Tips": [
                {
                    "title": "Legal Continuation",
                    "description": "Specific to legal context, referring to the progression of legal proceedings or actions.",
                    "example": "The judge granted a motion to continue the trial to a later date.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Case Duration",
                    "description": "Can imply the lengthening of legal action or delay in reaching a conclusion.",
                    "example": "Due to new evidence, we will continue our investigation.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6a09697c-657a-4858-9d16-06fc40d65779",
            "de": "to extend in a particular direction",
            "ty": "verb",
            "ex": "The path continues for another mile.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "continue to",
                " continue for",
                " continue along"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6a09697c-657a-4858-9d16-06fc40d65779.webp",
            "Tips": [
                {
                    "title": "Physical Extension",
                    "description": "Describes something physical, such as a path or road, extending from one point to another.",
                    "example": "The highway continues beyond the city limits.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Directional Use",
                    "description": "Can indicate direction of extension, often used with prepositions like 'to', 'into', 'through'.",
                    "example": "The forest continues into the mountains.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Carry on": {
            "wordRoot": "Carry on",
            "wordDefinition": "The words carry on and continue are very similar in meaning, but there is a slight difference between the two.\n\nContinue means to keep doing something that you were already doing, without any interruptions or changes. For example, if you were reading a book and someone enters the room and leaves, you would continue reading after they leave.\n\nCarry on also means to keep doing something, but usually implies a situation where there have been interruptions or distractions.\n\nFor example, if you were having a conversation with someone and then someone else interrupts, you might say \"let's carry on with our conversation\" to signal that you want to continue, even though you were interrupted.\n\nContinue is more straightforward and can be used in most situations where you want to say that you're going to keep doing something.\n\nCarry on is more specific and usually implies a situation where you are continuing despite interruptions or distractions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f3395f07-7a3d-4eba-9f92-5d865f3ad4c9.webp"
        },
        "Endure": {
            "wordRoot": "Endure",
            "wordDefinition": "Endure means to go through something difficult or painful while trying to remain strong or patient. It is applicable when talking about situations that require resilience or perseverance, such as enduring a difficult illness or enduring hardships in life.\n\nContinue means to keep going, while endure means to keep going despite hardships or difficulties.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/40ebae8f-7454-4294-90a5-7609b5ce23c3.webp"
        },
        "Go on": {
            "wordRoot": "Go on",
            "wordDefinition": "The words continue and go on have very similar meanings, but they can be used in slightly different contexts.\n\nContinue is typically used when you want to say that you're going to keep doing something that you've already started. For example, if you're studying for a test and someone interrupts you, you might say \"I'm going to continue studying after you leave\" to indicate that you plan to pick up where you left off.\n\nGo on, on the other hand, can be used in a couple of different ways.\n\nIt can be used as an encouragement to someone who is telling a story or trying to explain something: \"Go on, I'm listening.\"\n\nIt can also be used to mean \"keep happening\" or \"keep moving forward.\" For example, you might say \"The meeting went on for three hours\" to indicate that it lasted a long time.\n\nOverall, both words can be used to indicate that something is going to keep happening or that someone is going to continue doing something, but continue is typically used in more formal contexts, while go on is more casual and can be used in a broader range of situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1a7fdbbc-eaa3-4e35-950c-e79ba778fb85.webp"
        },
        "Maintain": {
            "wordRoot": "Maintain",
            "wordDefinition": "Maintain, on the other hand, means to keep something in a particular state or condition. For example, if you say \"I need to maintain my car regularly so it doesn't break down,\" this means you should keep your car in good condition by regularly servicing it.\n\nBoth words are applicable in different contexts. Continue is useful when talking about ongoing activities, while maintain is useful when talking about keeping something in a certain state or condition over time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1d69b783-d8ec-4343-a862-bd0ae1a9caac.webp"
        },
        "Persevere": {
            "wordRoot": "Persevere",
            "wordDefinition": "Persevere implies that you're facing some kind of challenge or obstacle and that you're determined to overcome it.\n\nFor example, you might say \"I'm going to persevere in my studies of Spanish, even if it's difficult\" if you're struggling with the language but still want to achieve a certain level of proficiency.\n\nSo to summarize: continue means to keep doing something, while persevere means to keep doing something in spite of obstacles or challenges.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/41f933c8-4da6-40dc-aca8-5c3adb57ecfe.webp"
        },
        "Persist": {
            "wordRoot": "Persist",
            "wordDefinition": "Persist means to keep trying even when faced with difficulties or obstacles.\n\nIt is used in situations where someone is determined to achieve something despite setbacks. For example, \"She persisted in her efforts to learn the piano, even though it was difficult\" means that she didn't give up on learning the piano even when it was challenging.\n\nContinue refers to an action being carried out without interruption, while persist refers to someone's determination to pursue a goal despite obstacles.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/31f89020-a422-4252-aa1b-18f47e661522.webp"
        },
        "Proceed": {
            "wordRoot": "Proceed",
            "wordDefinition": "Proceed means to move forward or to begin something.\n\nFor example, if you were finished one part of the project and now moving on to the next part, you would proceed to the next task.\n\nContinue is used when you want to keep doing something you have already started, while proceed is used when you want to move forward to a new task or step.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6843c8a0-ebbd-49d4-9808-5fcfc84b11ca.webp"
        },
        "Sustain": {
            "wordRoot": "Sustain",
            "wordDefinition": "Sustain means to support, nourish, or maintain something over time. For example, if you are growing plants, you need to sustain them by giving them enough water and sunlight to grow properly.\n\nContinue is applicable when we want something to keep going without interruption, while sustain is applicable when we want something to continue for a longer period of time and require support or nourishment to keep it going.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/daac1394-d0f1-429d-8c42-f41773b09132.webp"
        }
    },
    "videos": [
        {
            "Text": " What secrets do its pages contain? He purchased the manuscript from the cash-strapped priest at the college, and eventually brought it to the U.S., where experts have continued to puzzle over it for more than a century. Cryptologists say the writing has all the characteristics of a real language, just one that no one's ever seen before.",
            "Title": "The world’s most...",
            "VideoId": "8NS4CbBJQ84",
            "Controls": "start=62"
        },
        {
            "Text": " And the different stages of sleep have been shown to help consolidate different types of memories. During the non-REM slow-wave sleep, declarative memory is encoded into a temporary store in the anterior part of the hippocampus. Through a continuing dialogue between the cortex and hippocampus,",
            "Title": "The benefits of a good...",
            "VideoId": "gedoSfZvBgE",
            "Controls": "start=251"
        },
        {
            "Text": " you eat sugar-rich food instead? If you rarely eat sugar or don't eat much at a time, the effect is similar to that of the balanced meal. But if you eat too much, the dopamine response does not level out. In other words, eating lots of sugar will continue to feel rewarding.",
            "Title": "How sugar affects the...",
            "VideoId": "lEXBxijQREo",
            "Controls": "start=240"
        },
        {
            "Text": " because I discovered who I really am, as in, that's what I want to do, and there's such beauty in doing that. There's nothing as powerful as that, knowing that I'm meant to do this, because you don't get scared, you just continue living your life. Thank you.",
            "Title": "Boniface Mwangi: The day...",
            "VideoId": "W1KIgMXPR28",
            "Controls": "start=418"
        },
        {
            "Text": " And as the days roll by, the cubs continue to thrive under Giles's watchful eye. So, we try and spend a little bit of time with them every day. It's really important, because, ultimately, from day one,",
            "Title": "Handraising Twin Tiger...",
            "VideoId": "fcRRJHVtGPw",
            "Controls": "start=25"
        },
        {
            "Text": " but if it's closed, she'll open it. This pattern will continue until all 100 of you have gone. The words in the lockers that remain open at the end will help you crack the code for the safe.",
            "Title": "Can you solve the locker...",
            "VideoId": "c18GjbnZXMw",
            "Controls": "start=81"
        },
        {
            "Text": " continued that I'm convinced that it's almost impossible almost as a matter of fact it was he was not the only world champion thinking similarly about",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=298"
        },
        {
            "Text": " But this can't go on forever. As summer continues, temperatures are rising.",
            "Title": "Hungry Polar Bear...",
            "VideoId": "zNO0kxTClYo",
            "Controls": "start=195"
        },
        {
            "Text": " sometimes but but if we're prepared we're continuing on his life",
            "Title": "When Food Can Kill You:...",
            "VideoId": "muGnmvJDszM",
            "Controls": "start=19"
        },
        {
            "Text": " distance but the bachelors continue their advance",
            "Title": "The Life Story...",
            "VideoId": "v3jbM_baHb4",
            "Controls": "start=935"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joyce-meyer.webp",
            "Text": "A lot of times, people feel that if they forgive the person who hurt them, then they will continue to take advantage of them or not take responsibility for what they did wrong.",
            "Title": "American Author",
            "Name": "Joyce Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/francois-de-la-rochefoucauld.webp",
            "Text": "Love can no more continue without a constant motion than fire can; and when once you take hope and fear away, you take from it its very life and being.",
            "Title": "French Writer",
            "Name": "Francois de La Rochefoucauld"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/albert-camus.webp",
            "Text": "You will never be happy if you continue to search for what happiness consists of. You will never live if you are looking for the meaning of life.",
            "Title": "French Philosopher",
            "Name": "Albert Camus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alicia-keys.webp",
            "Text": "I want to continue to produce film, television, and theater, and to make the most amazing music that I've made in my life.",
            "Title": "American Musician",
            "Name": "Alicia Keys"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joe-biden.webp",
            "Text": "I've known and continue to know every one of these major world leaders by their first names, and I have access to them.",
            "Title": "American President",
            "Name": "Joe Biden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/walt-disney.webp",
            "Text": "Disneyland will never be completed. It will continue to grow as long as there is imagination left in the world.",
            "Title": "American Businessman",
            "Name": "Walt Disney"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-j-blige.webp",
            "Text": "If you're here right now in your life, your journey continues and you've lived to tell the story.",
            "Title": "American Musician",
            "Name": "Mary J. Blige"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ben-carson.webp",
            "Text": "I would prefer to just continue to speak about truth and to speak about what makes sense.",
            "Title": "American Scientist",
            "Name": "Ben Carson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-hart.webp",
            "Text": "Expect me to continue what I've been doing, which is trying to take over the world.",
            "Title": "American Actor",
            "Name": "Kevin Hart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bill-watterson.webp",
            "Text": "Reality continues to ruin my life.",
            "Title": "American Cartoonist",
            "Name": "Bill Watterson"
        }
    ]
}