{
    "currentWord": {
        "wordRoot": "courier",
        "id": 18880,
        "phonemic": "ˈkʊriə(r)|ˈkʊriər\r",
        "bigId": "8985de3e-a129-4668-a769-a93551d1882d",
        "wordForms": [
            "couriers",
            "courier"
        ]
    },
    "senses": [
        {
            "id": "8985de3e-a129-4668-a769-a93551d1882d",
            "de": "A person or company that carries and delivers letters, packages, or important documents quickly",
            "ty": "noun",
            "ex": "He works as a delivery courier for a local restaurant.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "delivery courier",
                " courier service",
                " courier company"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8985de3e-a129-4668-a769-a93551d1882d.webp",
            "Tips": [
                {
                    "title": "Speed Emphasis",
                    "description": "Focus on the fast delivery aspect that 'courier' implies versus regular mail services.",
                    "example": "I sent the documents via a courier to ensure they arrived by tomorrow.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/AjuudlqfKZqbJGdBCpYG7JB9w.webp"
                },
                {
                    "title": "Package Handling",
                    "description": "Remember, couriers often handle packages carefully, especially if they are fragile or valuable.",
                    "example": "The courier carefully packed the antique vase for shipment.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Hgx44bDTGRsD2TBIuTdUdPpMIKc.webp"
                },
                {
                    "title": "Business Usage",
                    "description": "Companies frequently use couriers for business, emphasizing reliability and efficiency.",
                    "example": "Our firm always hires a reputable courier for contract deliveries.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/9J2xIW8KzJvfw6bAv5Kr4Slr37U.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "bd10adbc-2795-4a42-af56-4a896227e044",
            "de": "A representative of a travel company who helps tourists on their holiday",
            "ty": "noun",
            "ex": "The holiday courier gave us a guided tour of the city.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "holiday courier",
                " tour courier",
                " courier-guided tour"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bd10adbc-2795-4a42-af56-4a896227e044.webp",
            "Tips": [
                {
                    "title": "Travel Context",
                    "description": "The word is associated with travel and holidays, not just sending items.",
                    "example": "The tour operator provided a courier to help us at the airport.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Assistance Role",
                    "description": "Think of a courier in travel as someone who assists and guides tourists.",
                    "example": "Our holiday courier was excellent, helping us with hotel reservations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Just Guides",
                    "description": "Besides guiding, couriers manage travel details like tickets and schedules.",
                    "example": "The company's courier quickly resolved the issue with our missing tickets.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Carrier": {
            "wordRoot": "Carrier",
            "wordDefinition": "Carrier refers to a person or company that transports goods or people from one place to another. For example, a trucking company that moves goods from a warehouse to a store is a carrier.\n\nThe main difference is that carriers generally transport goods or people, while couriers are focused on delivering important documents or parcels quickly and safely.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0367351b-a74b-4013-856c-6f8d6b626b92.webp"
        },
        "Dispatcher": {
            "wordRoot": "Dispatcher",
            "wordDefinition": "A dispatcher is someone who coordinates and schedules deliveries or services. They're responsible for making sure that the right courier is assigned to the right task, and that packages are picked up and delivered on time.\n\nA courier is the person actually doing the delivery, while a dispatcher is the person managing the delivery. Couriers are applicable when physical items need to be transported, while dispatchers are applicable in situations where coordination and organization are necessary, such as managing emergency services or transportation companies.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9d066b11-78ad-4b53-bbea-954015220af3.webp"
        },
        "Messenger": {
            "wordRoot": "Messenger",
            "wordDefinition": "A messenger is someone who typically delivers messages or small items, such as letters or small packages, from one person to another.\n\nMessengers typically travel by foot, bike, or public transportation.\n\nIn summary, couriers are generally used for larger and more valuable packages that need to be transported quickly and securely, while messengers are used for smaller and less valuable items, such as documents or letters, that need to be delivered quickly within a city or town.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f413b551-edff-4ce1-925a-e687a47f5e14.webp"
        },
        "Postman": {
            "wordRoot": "Postman",
            "wordDefinition": "A postman is a person who works for a postal service such as the USPS in the United States, or the Royal Mail in the UK.\n\nThe main difference between a courier and a postman is that a courier charges for their services, while a postman's services are paid for by the postal service's customers.\n\nA courier is often used for urgent or important deliveries, while a postman serves a broader range of customers on a regular schedule.\n\nA postman is most applicable for delivering everyday mail items to people's homes and businesses.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/072a4c8e-1055-4519-8f25-867b6db2b382.webp"
        },
        "Runner": {
            "wordRoot": "Runner",
            "wordDefinition": "A runner is someone who is tasked with physically delivering something, without the specialized training and qualifications of a courier.\n\nFor example, you might ask your friend to be a runner and deliver a package to someone in the same neighborhood.\n\nRunners are more typical for casual or personal situations where speed and security are not as important.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f693d770-0224-4d69-899e-b19be07c3f59.webp"
        },
        "Transport": {
            "wordRoot": "Transport",
            "wordDefinition": "Transport generally refers to the movement of goods or people from one location to another over longer distances, usually by truck, train, or plane.\n\nTransportation can involve several modes of transport and often involves the movement of large quantities of goods or people.\n\nIn summary, couriers are usually for short distances and deliver smaller packages and documents quickly, while transport involves longer distances and the movement of larger amounts of goods or people.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/013addf6-9435-47bf-825b-e2d25976534a.webp"
        }
    },
    "videos": [
        {
            "Text": " Augustus’s accomplishments were almost too many to name. He established consistent taxation for all provinces, ending private exploitation by local tax officials. He personally financed a network of roads and employed couriers so news and troops could travel easily throughout the realm. And it was under Augustus",
            "Title": "History vs. Augustus -...",
            "VideoId": "QrcmojhFmzY",
            "Controls": "start=189"
        },
        {
            "Text": " that whenever you're on holiday and somebody collapses, might it be your own relative or someone just in front of you, you can find this. The other thing we would like to ask is of companies also all over the world that will be able to help us validate these AEDs. These might be courier services",
            "Title": "Lucien Engelen:...",
            "VideoId": "dWZP8cUEB7Y",
            "Controls": "start=333"
        },
        {
            "Text": " breaking up the fat and preparing it for absorption through the intestinal wall. Because fat-soluble vitamins can't make use of the blood's watery nature, they need something else to move them around, and that comes from proteins that attach to the vitamins and act like couriers,",
            "Title": "How do vitamins work? -...",
            "VideoId": "ISZLTJH5lYg",
            "Controls": "start=124"
        },
        {
            "Text": " might admit your own relative or someone just in front of you you can find this the other thing we'd like to ask is companies also all of the world that will be able to help us validate these IEDs this might be courier services or cable guys for instance just to see",
            "Title": "Crowdsource your health...",
            "VideoId": "Y8I7YiZ68jE",
            "Controls": "start=336"
        },
        {
            "Text": " And it's walked away -- I mean, it's that mechanical. It's molecular clockwork. This is how you work at the molecular scale. So with a little bit of molecular eye candy, we've got kinesins, the orange ones. They're little molecular courier molecules walking one way.",
            "Title": "Drew Berry: Animations...",
            "VideoId": "WFCvkkDSfIU",
            "Controls": "start=478"
        },
        {
            "Text": " SIRUM gets surplus medications by putting recycling bins into these hundreds of facilities that have surplus. They fill the bin, and when the box is full, SIRUM initiates a courier pickup to pick up that medication,",
            "Title": "You shouldn't have to...",
            "VideoId": "ztivogVTp7s",
            "Controls": "start=214"
        },
        {
            "Text": " back to the map that we have seen earlier again and again and again let me tell you when I first started myself courier at HP my district manager I took a pay cut moved to Silicon Valley and my",
            "Title": "Globalizing communication...",
            "VideoId": "j-b0o4zhrzk",
            "Controls": "start=735"
        },
        {
            "Text": " So what is this bizarre architecture configuration that makes the network sing and be so unusual? Well, to move data around from one place to another -- again, it's not like a package courier.",
            "Title": "Jonathan Zittrain: The...",
            "VideoId": "P65XdTlk4vA",
            "Controls": "start=225"
        },
        {
            "Text": " think see them as US military so so many have half died in the line of duty being a truck owner in this park is actually risking your life for the lives of couriers and for the benefit of",
            "Title": "Mountain Gorillas'...",
            "VideoId": "CWnk6PTsZNo",
            "Controls": "start=620"
        },
        {
            "Text": " we had a ghost detaining a known al-qaeda courier lead us to the suspected location of a high-value target",
            "Title": "THE RAID ON OSAMA BIN...",
            "VideoId": "M6vtiaNqtv4",
            "Controls": "start=3"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/adam-lashinsky.webp",
            "Text": "Amazon is pursuing something called Amazon Key, which lets its couriers unlock Prime customers' doors and deliver packages. It's pairing the service, which it plans to make available in 37 cities next month, with a camera so users will have intelligence inside and outside their homes, presumably boosting trust and lowering creepiness.",
            "Title": "American Editor",
            "Name": "Adam Lashinsky"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-dorsey.webp",
            "Text": "I loved couriers. You had this transfer of physical information happening throughout the city and the world. Someone picking up the package, putting it in a bag, going somewhere, taking it out of the bag, giving it to someone else. I thought that was so cool. I wanted to map it, to see that flow on a big screen.",
            "Title": "American Businessman",
            "Name": "Jack Dorsey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephenie-meyer.webp",
            "Text": "I had the easiest publishing experience in the entire world. I sent out fifteen courier letters to agents, got five no replies, nine rejections and one I want to see it. A month later I had an agent. Another month later I had a three book deal with Little Brown.",
            "Title": "American Author",
            "Name": "Stephenie Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shepard-fairey.webp",
            "Text": "Art shows and the institutions end up being the couriers for culture for the next generation and are an important component as well. It may seem ironic from one perspective, but I think if you look at my overall strategy, it's actually not out of step.",
            "Title": "American Artist",
            "Name": "Shepard Fairey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dan-hill.webp",
            "Text": "When you think of bike couriers, you think of hyper speed. They get paid by how fast they can drop stuff off. The faster you go, the more chances you take. And the more chances you take, the greater the war between cyclists and cars.",
            "Title": "Canadian Musician",
            "Name": "Dan Hill"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gary-numan.webp",
            "Text": "Before breaking into music, I had various jobs: forklift driver, driving a courier. But I was forced into working rather than doing it off my own bat because that was my dad's way: you got a job and paid your way.",
            "Title": "British Musician",
            "Name": "Gary Numan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-mccaul.webp",
            "Text": "The threat is real, and it comes from the Internet. This is a new generation of terrorist. This is not Bin Laden in caves with couriers anymore. This is what the new threat of terrorism looks like.",
            "Title": "American Politician",
            "Name": "Michael McCaul"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oliver-north.webp",
            "Text": "The terrorists that we are up against today do not rely upon cell phones and SAT phones and emails. They rely on couriers. You cannot intercept what a courier is telling somebody.",
            "Title": "American Soldier",
            "Name": "Oliver North"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christopher-fowler.webp",
            "Text": "I left school on a wet Thursday afternoon, found a room in a shared house in North London, and started my first job on the following Monday as a courier for an advertising agency.",
            "Title": "English Writer",
            "Name": "Christopher Fowler"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-rigby.webp",
            "Text": "My nana used to tape 'The Simpsons' when it aired on Sky. We'd get the VHS tapes - my dad would courier them from Nana's house to us - and we'd watch them on Sunday nights.",
            "Title": "English Actor",
            "Name": "Daniel Rigby"
        }
    ]
}