{
    "currentWord": {
        "wordRoot": "creative",
        "id": 11237,
        "phonemic": "kriˈeɪtɪv|kriˈeɪtɪv\r",
        "bigId": "a9ddc7e4-4cb1-40b9-9f49-61f666de2570",
        "wordForms": [
            "creatively",
            "creativeness",
            "creatives",
            "uncreative",
            "creative"
        ]
    },
    "senses": [
        {
            "id": "a9ddc7e4-4cb1-40b9-9f49-61f666de2570",
            "de": "Having or showing an ability to make new things or think of new ideas",
            "ty": "adjective",
            "ex": "She's a very creative person",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "creative person",
                " creative thinking",
                " creative work"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a9ddc7e4-4cb1-40b9-9f49-61f666de2570.webp",
            "Tips": [
                {
                    "title": "Idea Generation",
                    "description": "Focuses on originality and thinking outside the box to come up with unique solutions or concepts.",
                    "example": "His creative solution resolved the issue no one else could crack.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3NZSIF0Qzn5giu1ZOZVHXuVwDc.webp"
                },
                {
                    "title": "Expressiveness",
                    "description": "Reflects a personal or unique style, especially in arts and writing; emphasizes expressing oneself.",
                    "example": "Her creative writing captures the readers' imagination.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Tcq9cqipMprL8coyH23cGFmv5jc.webp"
                },
                {
                    "title": "Problem Solving",
                    "description": "Used when someone invents or devises a non-standard approach to a problem.",
                    "example": "He offered a creative workaround for the software bug.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/UqWTyKdPxBME2WYFli91LRac.webp"
                }
            ]
        },
        {
            "id": "d125e6c2-817c-4a5b-a245-fd35d69a02d8",
            "de": "Person who creates or innovates",
            "ty": "noun",
            "ex": "She's one of the best creatives in advertising",
            "use": "",
            "co": "Business",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "advertising creative",
                " talented creative",
                " digital creative"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d125e6c2-817c-4a5b-a245-fd35d69a02d8.webp",
            "Tips": [
                {
                    "title": "Professional Creator",
                    "description": "Refers to individuals dedicated to creating uniquely in their professional field, not hobbyists.",
                    "example": "The firm hired a creative known for groundbreaking campaigns.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Innovation Highlight",
                    "description": "Indicates a person renowned for consistently producing revolutionary ideas or items.",
                    "example": "She was recognized as a leading creative in tech innovations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Creative Industry",
                    "description": "Often linked to fields like advertising, marketing, design, where originality is key.",
                    "example": "He thrived as a creative in the bustling graphic design industry.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "559dae5b-5b92-469d-8bf7-a61464f5ced7",
            "de": "Involved in the production of artistic work",
            "ty": "adjective",
            "ex": "Her creative process involves a lot of brainstorming",
            "use": "",
            "co": "Artistic, Literacy",
            "re": "",
            "tp": "",
            "cl": [
                "creative process",
                " creative project",
                " creative venture"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/559dae5b-5b92-469d-8bf7-a61464f5ced7.webp",
            "Tips": [
                {
                    "title": "Artistic Involvement",
                    "description": "Implies being actively engaged in the creation of art or using artistic skills.",
                    "example": "Her creative involvement gave the play a fresh, new vibe.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Process Focus",
                    "description": "Highlights the methods or steps taken in creative activities, often unique to the individual.",
                    "example": "His creative process includes meditating before painting.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Original Works",
                    "description": "Used when discussing one-of-a-kind pieces or outputs in the arts, such as music, literature.",
                    "example": "The gallery showcased her creative works from the past decade.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Artistic": {
            "wordRoot": "Artistic",
            "wordDefinition": "Artistic refers to skills and talents related to visual arts, music, dance, theater or any other form of creative expression.\n\nArtistic is applicable when talking about specific skills related to art, whereas creative is applicable more broadly to any kind of inventive or imaginative thinking.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/188b5cb0-e384-4f0e-a287-a2c87140506b.webp"
        },
        "Imaginative": {
            "wordRoot": "Imaginative",
            "wordDefinition": "It can also refer to the ability to solve problems in new and innovative ways. Imaginative refers to the ability to imagine or visualize things that may not actually exist or to come up with fictional stories or scenarios.\n\nBoth words are applicable in different situations - for example, a graphic designer might be described as creative for their ability to come up with eye-catching designs, while a writer might be described as imaginative for their ability to create fantastic worlds and characters in their stories.\n\nHowever, someone who is creative might also be imaginative, and vice versa.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/acfaebc2-5871-4e89-a752-879b9fe5239b.webp"
        },
        "Innovative": {
            "wordRoot": "Innovative",
            "wordDefinition": "Both words, creative and innovative, are about coming up with new ideas.\n\nHowever, creative is more about taking existing ideas and making them better, while innovative is about creating entirely new ideas or completely changing an existing idea.\n\nCreative is applicable to areas that require improvement or enhancement, such as design, art, and marketing. Innovative is applicable to areas that require a whole new approach or invention, such as technology, science, and business.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e1dc3dc5-6edf-498e-adc0-1d861b1ca97b.webp"
        },
        "Inspire": {
            "wordRoot": "Inspire",
            "wordDefinition": "Inspire refers to the act of motivating or encouraging someone to do or create something. It applies to the process of providing someone with the spark of an idea or a feeling of enthusiasm that drives them to create or accomplish something.\n\nIn essence, being creative involves coming up with new ideas and using them to create something, while inspiring involves motivating others to do the same.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2c029d93-bd0a-4a30-9656-5548e2e5e661.webp"
        },
        "Inventive": {
            "wordRoot": "Inventive",
            "wordDefinition": "Both creative and inventive refer to the ability to come up with new ideas, but there is a slight difference in their meanings.\n\nCreative is more about expressing oneself in an original and unique way, while inventive focuses more on creating something new and useful that didn’t exist before.\n\nFor example, a painter who creates a unique piece of art could be considered creative, while an engineer who invents a new type of engine could be considered inventive.\n\nCreative is applicable in fields such as art, writing, and music, while inventive is more applicable in fields such as science, engineering, and technology.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/58984e06-c336-4817-a30b-0b7d838c9a91.webp"
        },
        "Original": {
            "wordRoot": "Original",
            "wordDefinition": "Creative refers to the ability to create something new or imaginative using existing ideas or materials, while original refers to something that is entirely new or unique, not borrowed or copied from anything else.\n\nFor example, designing a new outfit using existing fabrics and patterns would be considered creative, while inventing a new type of fabric or pattern would be considered original.\n\nBoth terms are applicable in various fields, such as art, literature, music, and science. Being creative can help individuals come up with new ways to solve problems or express themselves, while being original can lead to groundbreaking discoveries or innovations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/315d1780-6fd6-4681-93d9-b276deed793a.webp"
        },
        "Resourceful": {
            "wordRoot": "Resourceful",
            "wordDefinition": "Creative and resourceful are both adjectives that describe different types of problem-solving skills. Creative refers to the ability to come up with new and original ideas, while resourceful refers to the ability to solve problems using the resources that are available at hand, even if they are limited.\n\nA resourceful person might be able to solve the same problem by finding a way to use the tools and resources that are already available, such as repurposing old materials or finding a creative way to use existing technology.\n\nBoth skills are valuable in different situations. Being creative is useful when you need to think outside the box and come up with a unique solution, while being resourceful is useful when you need to find a solution quickly using the resources that you have available.\n\nUltimately, both creative and resourceful people are able to find solutions to problems, but they approach the problem-solving process in different ways.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/07a6c3e3-04ce-40be-b318-449c1c5de964.webp"
        },
        "Visionary": {
            "wordRoot": "Visionary",
            "wordDefinition": "Visionary usually refers to someone who has a clear and imaginative understanding of the future, especially when it comes to new and innovative ideas.\n\nFor example, a visionary person might have a plan to create a new type of technology that no one has thought of yet.\n\nVisionary people are useful in fields that require long-term planning and leadership, like in business or technology.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/175c884e-7ed3-457e-b4d1-cfdf0802ba49.webp"
        }
    },
    "videos": [
        {
            "Text": " wildlife situations in terms of climate change we do face crises and gorillas geography is about saying you know what we need to think differently we need to be creative about places and you start seeing that already you see people in campaigns working creatively and using geographies of concept to achieve that",
            "Title": "Daniel Raven-Ellison:...",
            "VideoId": "ESUIDD6e8KU",
            "Controls": "start=242"
        },
        {
            "Text": " try being playful with math and focusing on the creative aspects. That can build the numerical skills that help students approach math with confidence later on. Importantly, you should give children the time and space to work through their answers. And if you're an administrator,",
            "Title": "Why do people get so...",
            "VideoId": "7snnRaC4t5c",
            "Controls": "start=198"
        },
        {
            "Text": " but this varies by system rather than by person. There isn't any evidence to suggest that individuals have dominant sides of the brain, or to support the idea of a left-right split between logic and creativity. Some people may be particularly logical or creative,",
            "Title": "The left brain vs. right...",
            "VideoId": "ZMSbDwpIyF4",
            "Controls": "start=183"
        },
        {
            "Text": " in what, to their eyes, was a pretty barbaric world. An educated, civilized person was expected to be proficient in all aspects of creative thought inspired by the Muses, and the common medium through which these disciplines were taught, studied, and disseminated",
            "Title": "Music and creativity in...",
            "VideoId": "-1aAunaw1GA",
            "Controls": "start=95"
        },
        {
            "Text": " That kind of creative freedom sounds so liberating, doesn't it? Or does it? If you're like most people, you'd probably be paralyzed by this task. Without more guidance, where would you even begin? As it turns out, boundless freedom isn't always helpful.",
            "Title": "The power of creative...",
            "VideoId": "v5FL9VTBZzQ",
            "Controls": "start=15"
        },
        {
            "Text": " something creative and feel very happy and energized thanks to being encouraged I wrote and published a book called Simran's diary which is about a girl called children who goes to many twists turns and adventures along with her",
            "Title": "A message from the next...",
            "VideoId": "-QIi_MPo0b0",
            "Controls": "start=98"
        },
        {
            "Text": " it has a really hairy chest and so it was nicknamed the hoff crab after david hasselhoff i mean really we get creative and it can often be quite fun going through that process because the deep ocean is such a",
            "Title": "The Astronaut of the...",
            "VideoId": "RXpMSsvhcmQ",
            "Controls": "start=330"
        },
        {
            "Text": " Most of the young people who were out there on the streets are just trying to make it on the streets. And we also found out that some of the most intelligent and creative and magnificent and wise",
            "Title": "Jeffrey Brown: How we...",
            "VideoId": "yeVz0rtXCmw",
            "Controls": "start=718"
        },
        {
            "Text": " religious, or practical approaches to dying, but the ever-increasing demand for burial space might give us a push to be creative about where our bodies go after the final stages of life.",
            "Title": "What happens to our...",
            "VideoId": "mRsa2wb0aTs",
            "Controls": "start=250"
        },
        {
            "Text": " With the metal trap in the way, that's not too successful. But that huge brain helps the octopus to get creative and to think up a dramatically different strategy.",
            "Title": "Octopus Steals Crab from...",
            "VideoId": "abRPaXgJGQg",
            "Controls": "start=114"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/deepak-chopra.webp",
            "Text": "Being more aware creates responsibility. What does responsibility mean? It means the ability to respond. The more conscious you are in your ability to respond, the more creative you'll be.",
            "Title": "American Speaker",
            "Name": "Deepak Chopra"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-covey.webp",
            "Text": "We are the creative force of our life, and through our own decisions rather than our conditions, if we carefully learn to do certain things, we can accomplish those goals.",
            "Title": "American Educator",
            "Name": "Stephen Covey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paulo-coelho.webp",
            "Text": "Everybody has a creative potential and from the moment you can express this creative potential, you can start changing the world.",
            "Title": "Brazilian Novelist",
            "Name": "Paulo Coelho"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-hart.webp",
            "Text": "It's very rare that you get a director that lets you be creative and bring what you feel your character should do or should be.",
            "Title": "American Actor",
            "Name": "Kevin Hart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/neil-degrasse-tyson.webp",
            "Text": "The most creative people are motivated by the grandest of problems that are presented before them.",
            "Title": "American Scientist",
            "Name": "Neil deGrasse Tyson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ayn-rand.webp",
            "Text": "A creative man is motivated by the desire to achieve, not by the desire to beat others.",
            "Title": "Russian Writer",
            "Name": "Ayn Rand"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hideo-kojima.webp",
            "Text": "I have to have a creative role; otherwise, I simply wouldn't come into work.",
            "Title": "Japanese Designer",
            "Name": "Hideo Kojima"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/isaac-herzog.webp",
            "Text": "The creative treasure of Israel's artists and writers will survive forever.",
            "Title": "Israeli Politician",
            "Name": "Isaac Herzog"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/virginia-woolf.webp",
            "Text": "Odd how the creative power at once brings the whole universe to order.",
            "Title": "British Author",
            "Name": "Virginia Woolf"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/harold-prince.webp",
            "Text": "Producing should be a creative responsibility.",
            "Title": "American Producer",
            "Name": "Harold Prince"
        }
    ]
}