{
    "currentWord": {
        "wordRoot": "culinary",
        "id": 7817,
        "phonemic": "ˈkʌlɪnəri|ˈkʌlɪneri\r",
        "bigId": "9a8fc8d0-23e6-4e67-a4cf-23d6ab3ca7e7",
        "wordForms": [
            "culinary"
        ]
    },
    "senses": [
        {
            "id": "9a8fc8d0-23e6-4e67-a4cf-23d6ab3ca7e7",
            "de": "Related to cooking or the kitchen.",
            "ty": "adjective",
            "ex": "She attended a culinary school to become a professional chef.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "culinary arts",
                " culinary skills",
                " culinary delight"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9a8fc8d0-23e6-4e67-a4cf-23d6ab3ca7e7.webp",
            "Tips": [
                {
                    "title": "Professional Context",
                    "description": "Culinary is often used to describe professional cooking and related activities.",
                    "example": "He writes for culinary magazines, sharing his expertise.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/6AkcvkS03fGUZa4GxYMYO0Eth8.webp"
                },
                {
                    "title": "Not Just Food",
                    "description": "'Culinary' refers to all things related to the kitchen, not just food itself.",
                    "example": "Culinary equipment is essential for a well-functioning restaurant.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tHKGq9XICqiGTvGerYF5k6YelQ.webp"
                },
                {
                    "title": "Specialized Study",
                    "description": "Culinary arts is a field of study that deals with cooking and kitchen management.",
                    "example": "She is pursuing a degree in culinary arts.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/iavXK9ajFFjadGMqZXnhBEGSg.webp"
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Cook": {
            "wordRoot": "Cook",
            "wordDefinition": "Cook refers to a person who prepares food by following recipes or instructions to make meals. It is commonly used in everyday conversation and refers to a basic skill of making food.\n\nCulinary refers to the art and science of preparing and cooking food. It encompasses the broader knowledge, skills, and techniques related to cooking, including food presentation, food pairing, and knowledge of ingredients.\n\nIt is used in a professional setting, such as culinary schools or in the hospitality industry, to describe the higher level of knowledge and skill required to excel in cooking as a profession.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b5002ad5-eb01-4bb4-a8fb-70b11bd43bf8.webp"
        },
        "Cookery": {
            "wordRoot": "Cookery",
            "wordDefinition": "Cookery refers to the practice or skill of preparing food for eating, while culinary refers to the art or science of cooking and the preparation and cooking of food in general.\n\nCookery refers more specifically to the act of cooking, while culinary refers to the entire field of food preparation and cooking, including the science behind it.\n\nCookery is more commonly used in everyday speech, whereas culinary is more frequently used in professional settings or when referring to high-quality or gourmet food.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0c7a7826-0416-4c66-b7e8-8a15c55bb35f.webp"
        },
        "Cuisine": {
            "wordRoot": "Cuisine",
            "wordDefinition": "Both cuisine and culinary refer to food and cooking, but cuisine usually refers to the specific style of cooking and eating associated with a particular culture or region, while culinary refers to the overall art and science of cooking.\n\nFor example, French cuisine refers to the specific cooking techniques, ingredients, and dishes associated with France, while culinary arts refers to the broader field of food preparation, including techniques, equipment, and presentation.\n\nCuisine is often used to describe a particular type of restaurant or menu, such as Italian cuisine or Asian cuisine. Culinary is more often used to describe the skills and knowledge required for cooking, such as culinary school or a career in the culinary arts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cb66a4c6-635e-4455-8e9b-e081c7c4b7f6.webp"
        },
        "Epicurean": {
            "wordRoot": "Epicurean",
            "wordDefinition": "Culinary refers to anything related to cooking, preparing, or serving food, whereas epicurean refers to someone who enjoys fine food and wine, and the pursuit of pleasure through food.\n\nEpicurean, on the other hand, describes a person who is knowledgeable about and enjoys fine food and drink. If you go to a fancy restaurant with a menu of gourmet dishes, you might say that it caters to the epicurean palate.\n\nCulinary refers to the field of food preparation, while epicurean refers to someone who takes pleasure in eating and drinking good quality food and wine.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/708c8696-ed9c-4294-848c-6ebd38fade5e.webp"
        },
        "Foodie": {
            "wordRoot": "Foodie",
            "wordDefinition": "Foodie refers to a person who has a strong interest in and appreciation for food, often seeking out unique and high-quality dining experiences.\n\nCulinary refers to the act of cooking and preparing food, while foodie refers to a person who enjoys and appreciates food.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aa07f987-7c06-4295-bc9b-6ecc86e62361.webp"
        },
        "Gastronomic": {
            "wordRoot": "Gastronomic",
            "wordDefinition": "Both culinary and gastronomic are used to refer to food, cooking, and eating experiences.\n\nHowever, culinary has a more basic meaning and refers to the act of cooking or preparing food, while gastronomic has to do with the art of cooking, with an emphasis on how flavors and textures work together.\n\nFor example, a chef might describe themselves as having \"culinary skills,\" while a food critic might use the word gastronomic to describe a particularly memorable meal.\n\nCulinary is used in more everyday contexts, while gastronomic is more often associated with fine dining and gourmet experiences.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2a265f23-22c6-4c60-a814-e9219f7e9ae2.webp"
        },
        "Gourmet": {
            "wordRoot": "Gourmet",
            "wordDefinition": "Gourmet refers to a person who has refined tastes in food, or to the high quality, often expensive, food that a gourmet enjoys.\n\nFor example, a gourmet restaurant may serve very fancy, expensive dishes.\n\nCulinary describes anything related to cooking and food, while gourmet describes a person's refined taste in food, or the quality of the food itself.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ac004dd4-db01-40b1-b7e6-2372217988d4.webp"
        },
        "Kitchen": {
            "wordRoot": "Kitchen",
            "wordDefinition": "Kitchen refers to the physical space where food is prepared and cooked. It is a noun used to describe a room equipped for cooking, typically including appliances such as a stove, oven, and refrigerator.\n\nCulinary is a term used to describe the art of cooking, while kitchen is a term used to describe the physical space where cooking takes place.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6597eb85-b17e-4894-8a35-5b63fc864415.webp"
        }
    },
    "videos": [
        {
            "Text": " world after honing his culinary skills in the remote jungle cooking for oil drillers he returned to his home in Georgetown to open the backyard cafe a hot spot that celebrates his country's exciting one-of-a-kind dishes when you think about how small the reputation of goin these cuisine is on the culinary",
            "Title": "A Crash Course in...",
            "VideoId": "zD-rWaMPosI",
            "Controls": "start=56"
        },
        {
            "Text": " and even more information we also have guides to help you understand brood tin cicadas you can find out more about cicada biology and how exactly they pull off this lifestyle also check out douglas maine's article explaining why these gigantic emergencies are a good thing and for the culinary",
            "Title": "How Cicadas Become...",
            "VideoId": "Q8ShKbhDAUg",
            "Controls": "start=1035"
        },
        {
            "Text": " In the densely populated city-states of Mesopotamia, cheese became a staple of culinary and religious life. Some of the earliest known writing includes administrative records of cheese quotas, listing a variety of cheeses for different rituals and populations across Mesopotamia.",
            "Title": "A brie(f) history of...",
            "VideoId": "QKae1k1BDdA",
            "Controls": "start=122"
        },
        {
            "Text": " For many centuries, our culture has retained its mysticism, rituals and many culinary traditions. And one of those culinary traditions is our special connection with chocolate, dating back 800 years. Our ancient, indigenous communities were among the first cultures in the world",
            "Title": "Germán Santillán: A...",
            "VideoId": "bdLEBN6JKPY",
            "Controls": "start=25"
        },
        {
            "Text": " not out of passion and love for the flavor. And ultimately, the challenge of the baker, the challenge of every culinary student, of every chef, is to deliver flavor. Flavor is king. Flavor rules. I call it the flavor rule. Flavor rules. And -- and",
            "Title": "Peter Reinhart: The art...",
            "VideoId": "gK8Yk3mEEb8",
            "Controls": "start=132"
        },
        {
            "Text": " The best culinary experience of my life. Because what I saw, I'm convinced, is the future of cooking. Ridiculous, right? Foie gras and the future of cooking. There's not a food today that's more maligned than foie gras, right?",
            "Title": "Dan Barber: A surprising...",
            "VideoId": "gvrgD0mAFoU",
            "Controls": "start=24"
        },
        {
            "Text": " gonna be a culinary historian you experiment but you know something like a lot of african-american children I grew up not liking who I was I didn't like soul food I didn't like being black for most of my life I've lived at the",
            "Title": "Gastronomy and the...",
            "VideoId": "8MElzoJ2L6U",
            "Controls": "start=64"
        },
        {
            "Text": " In many cases, it may simply be that culinary visionaries from different cultures shared a similar that cooking fillings encased in dough would be delightful. Either way, we can appreciate these plump pockets of perfection—",
            "Title": "A brief history of...",
            "VideoId": "iHqzHrEFFTU",
            "Controls": "start=238"
        },
        {
            "Text": " egg and a hungry jackal means to make a meal out of it what we've got here is a highly motivated animal trying and failing to figure out this culinary conundrum it's",
            "Title": "Jackal vs. Ostrich Eggs...",
            "VideoId": "5AAftQIro7Y",
            "Controls": "start=3"
        },
        {
            "Text": " at all despite Tim's best culinary efforts the meerkats turned up their noses at",
            "Title": "What's a Meerkat's...",
            "VideoId": "8fCBlsWm-lg",
            "Controls": "start=52"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/geoffrey-zakarian.webp",
            "Text": "When you have a chef that wants to be in the spotlight, maybe after one or two appearances on a show, they think they're at a certain level that they haven't reached yet in the kitchen. Shows like 'Top Chef', 'Hell's Kitchen' have helped bring attention to the culinary world.",
            "Title": "American Chef",
            "Name": "Geoffrey Zakarian"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kelis.webp",
            "Text": "I needed a break, and going to culinary school turned a lightbulb on that I didn't have to make music. The people in the music business forget that not only is there an entire world of people out there who do not care what we do, we are not creating the wheel.",
            "Title": "American Musician",
            "Name": "Kelis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jose-andres.webp",
            "Text": "I started culinary school at a very young age, and really I wanted to be out working, cooking, more than I wanted to be in a classroom. You could say I wasn't a very good student - I wanted to be a student of life and experience.",
            "Title": "Spanish Chef",
            "Name": "Jose Andres"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/damaris-phillips.webp",
            "Text": "My journey was never hard; it just happened. From the second I held a knife, from the second I was in culinary school, it's all felt too good to be true. 'This cannot be my job, my life. Somebody has to be kidding with me!",
            "Title": "American Chef",
            "Name": "Damaris Phillips"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marco-pierre-white.webp",
            "Text": "My tortured life - with its extremes and conflicts - might have been difficult for me to deal with, but the press couldn't get enough of it. I was in the papers every day, 'the enfant terrible of the culinary world.",
            "Title": "British Chef",
            "Name": "Marco Pierre White"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/laura-esquivel.webp",
            "Text": "The culinary tradition in my family is very strong. My mother, a very wise woman, spent the better part of her life in a kitchen. It's a very strong part of her identity. I grew up there next to the fire.",
            "Title": "Mexican Author",
            "Name": "Laura Esquivel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ted-allen.webp",
            "Text": "It's very important to me that people who are actual chefs and other professionals in the culinary world, understand that I'm not, and have never held myself out as being, like a CIA trained chef.",
            "Title": "American Entertainer",
            "Name": "Ted Allen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-christian-olsen.webp",
            "Text": "At culinary school, none of the things we use to define ourselves outside that world - actor, producer, student - none of that matters. It's a magical art form.",
            "Title": "American Actor",
            "Name": "Eric Christian Olsen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/andy-beshear.webp",
            "Text": "We have breathtaking state and national parks, flourishing adventure tourism and culinary scenes and the world's best horses. And of course bourbon.",
            "Title": "American Politician",
            "Name": "Andy Beshear"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zoe-buckman.webp",
            "Text": "For me, 'Jewishness' manifests within my humor, slang, cynicism, culinary tastes, and the spirit of generosity ingrained in me.",
            "Title": "Australian Athlete",
            "Name": "Zoe Buckman"
        }
    ]
}