{
    "currentWord": {
        "wordRoot": "current",
        "id": 5279,
        "phonemic": "ˈkʌrənt|ˈkɜːrənt\r",
        "bigId": "15515abc-5af0-4f70-9a38-7a80b4e1a137",
        "wordForms": [
            "currents",
            "currently",
            "current"
        ]
    },
    "senses": [
        {
            "id": "15515abc-5af0-4f70-9a38-7a80b4e1a137",
            "de": "Happening or existing now",
            "ty": "adjective",
            "ex": "I'm reading a book about the current political climate in Europe.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "current situation",
                " current events",
                " current status"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/15515abc-5af0-4f70-9a38-7a80b4e1a137.webp",
            "Tips": [
                {
                    "title": "Temporal Relevance",
                    "description": "Use 'current' when referring to something happening in the very recent past, now, or the immediate future.",
                    "example": "Our current policy may change next year.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/m9Mo4Wf9uGDic7NRnf3KhhMdSY.webp"
                },
                {
                    "title": "Not Always Physical",
                    "description": "'Current' often relates to abstract situations, not just physical objects or events.",
                    "example": "Her current mood has affected the whole team's morale.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/P6CbsVJDO9xYuUJ5lPd0drqTA.webp"
                }
            ]
        },
        {
            "id": "e01981cd-dce4-4f07-8788-c5c373fce728",
            "de": "A flow of electricity which results from the ordered directional movement of electrically charged particles",
            "do": "Physics",
            "ty": "noun",
            "ex": "He was measuring the current in the circuit using an ammeter.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "alternating current",
                " direct current",
                " electrical current"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e01981cd-dce4-4f07-8788-c5c373fce728.webp",
            "Tips": [
                {
                    "title": "Directional Movement",
                    "description": "In physics, 'current' implies a continuous flow in one direction, not a static charge.",
                    "example": "The device measures how much current passes through.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Measure of Electricity",
                    "description": "Think of 'current' in terms of measurable electricity, such as in amperes.",
                    "example": "This circuit carries a current of 3 amps.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "20ad0fb7-d58e-4995-8259-97a9505f8189",
            "de": "A body of water or air moving in a definite direction.",
            "ty": "noun",
            "ex": "The swimmer was swept out to sea by the strong current.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong current",
                " undercurrent",
                " current of air"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/20ad0fb7-d58e-4995-8259-97a9505f8189.webp",
            "Tips": [
                {
                    "title": "Natural Movement",
                    "description": "When related to water or air, 'current' refers to the natural, flowing movement.",
                    "example": "The boat struggled against the river's current.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Impacts Navigation",
                    "description": "'Current' affects the direction of travel for swimmers, boats, and airborne objects.",
                    "example": "Pilots must account for the current of air during flights.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "060681dd-d9dc-4d30-8ed6-7a8532c3f2e9",
            "de": "Being widely accepted, used, or practiced right now.",
            "ty": "adjective",
            "ex": "The current method of teaching this subject is not effective.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "current trends",
                " current theory",
                " current method"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/060681dd-d9dc-4d30-8ed6-7a8532c3f2e9.webp",
            "Tips": [
                {
                    "title": "Cultural Relevance",
                    "description": "The word 'current' implies recent cultural, social, or technological relevance.",
                    "example": "She is studying current internet slang terms.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Shifts Over Time",
                    "description": "'Current' implies that what is accepted can change and often does so.",
                    "example": "The current fashion is baggy jeans, but it might change soon.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Contemporary": {
            "wordRoot": "Contemporary",
            "wordDefinition": "Contemporary typically refers to something that is modern or up-to-date. It often connotes a sense of being in line with current trends or styles.\n\nContemporary is more about being modern or up-to-date, while current is more about the present moment in time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b5c75f39-621e-40d1-9fff-780de7c8ea1e.webp"
        },
        "Exist": {
            "wordRoot": "Exist",
            "wordDefinition": "Exist refers to the fact of something being present or real. For example, \"Unicorns do not exist in reality\" or \"The concept of time has existed for centuries.\".\n\nCurrent refers to something happening now or the flow of electricity while exist refers to the fact of something being real or present.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d64ca3f7-0dfe-4f1a-aad9-75374cbce9e1.webp"
        },
        "Modern": {
            "wordRoot": "Modern",
            "wordDefinition": "Current refers to something that is presently happening or existing, while the word modern refers to something that is new or contemporary.\n\nModern describes something that is new or up-to-date, like a modern piece of technology or a modern design style.\n\nCurrent relates to time and modern relates to the characteristics or attributes of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/af706d57-52ad-4dda-9eca-d7365e9a4fda.webp"
        },
        "Ongoing": {
            "wordRoot": "Ongoing",
            "wordDefinition": "Ongoing refers to something that has been happening for a period of time and is continuing to happen. For example, the ongoing efforts to find a cure for cancer.\n\nCurrent is applicable when talking about something happening right now or recently, while ongoing is applicable when talking about something that has been happening for some time and is continuing to happen.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/46326cb7-3ec4-4c38-9957-2644cb27d24d.webp"
        },
        "Popular": {
            "wordRoot": "Popular",
            "wordDefinition": "Popular refers to something that is liked or approved of by many people. For example, the most popular type of music among teenagers nowadays is pop music.\n\nThe difference between current and popular is that current refers to something that is happening or existing now, while popular refers to something that is liked or approved of by many people.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/893fe949-db90-4be3-8388-5e23c2a08721.webp"
        },
        "Present": {
            "wordRoot": "Present",
            "wordDefinition": "Present refers to the specific moment or time that we are in right now. It refers to the exact time we are speaking or writing in the present.\n\nSo, while current refers to a longer time period, present refers to the exact moment in time. They are both applicable in different contexts depending on the time frame we are referring to.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2bf9fb1d-786b-4595-85a1-d38507078281.webp"
        },
        "Prevail": {
            "wordRoot": "Prevail",
            "wordDefinition": "Prevail means to be victorious or to succeed in something. For example, if a team prevails in a game, it means that they won.\n\nIn conclusion, current describes something that is happening in the present, while prevail describes a situation where someone or something triumphs or succeeds in a particular situation or competition.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1a01027c-66d1-4b8f-8571-3b3d8f97c498.webp"
        },
        "Trend": {
            "wordRoot": "Trend",
            "wordDefinition": "Trend refers to a general direction in which something is developing or changing over time.\n\nIt describes the way things are changing or developing in a certain area. For example, the trend in clothing this season is oversized sweaters.\n\nCurrent refers to something happening right now and trend refers to how something is changing over time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c14aab72-0a55-4bce-bd90-036354a39026.webp"
        }
    },
    "videos": [
        {
            "Text": " The ox came in second, with the powerful tiger right behind him. The rabbit, too small to battle the current, nimbly hopped across stones and logs to come in fourth. Next came the dragon, who could have flown directly across, but stopped to help some creatures she had encountered on the way. After her came the horse, galloping across the river.",
            "Title": "The myth behind the...",
            "VideoId": "may2s9j4RLk",
            "Controls": "start=71"
        },
        {
            "Text": " and have helped many people live better lives. Although we've come a long way in improving how we treat and diagnose asthma, we still don't know its exact causes. We currently believe that a combination of genetic and environmental factors play a role, potentially acting during early childhood.",
            "Title": "How does asthma work? -...",
            "VideoId": "PzfLDi-sL3w",
            "Controls": "start=253"
        },
        {
            "Text": " of prime numbers. So, to accomplish this seemingly impossible task of finding infinite beds for infinite buses of infinite weary travelers, the night manager assigns every current guest to the first prime number, 2, raised to the power of their current room number.",
            "Title": "The Infinite Hotel...",
            "VideoId": "Uj3_KqkI9Zo",
            "Controls": "start=162"
        },
        {
            "Text": " Now it's true, technology has accumulated through human history, and right now, technology advances extremely rapidly -- that is the proximate cause, that's why we are currently so very productive. But I like to think back further to the ultimate cause.",
            "Title": "What happens when our...",
            "VideoId": "MnT1xgZgkpk",
            "Controls": "start=84"
        },
        {
            "Text": " that create gold in stars. But these machines can only construct gold atom by atom. So it would take almost the age of the universe to produce one gram at a cost vastly exceeding the current value of gold. So that's not a very good solution.",
            "Title": "Where does gold come...",
            "VideoId": "jf_4z4AKwJg",
            "Controls": "start=203"
        },
        {
            "Text": " that for every dollar spent on current policies on existing subsidies to solar and wind will avoid about 3 cents of climate damage that's a very poor way to invest in the world but if we spent that same dollar on researchers we could",
            "Title": "Economics of climate...",
            "VideoId": "SEjNVWV5jbs",
            "Controls": "start=238"
        },
        {
            "Text": " That applies both at the ocean's surface and deep below. Sailors have always known about currents, but their patterns weren't well known until recently. In fact, tracking abandoned ships was how scientists determined the shape",
            "Title": "Are ghost ships real? -...",
            "VideoId": "cURn__xlWXk",
            "Controls": "start=232"
        },
        {
            "Text": " Like we said, the pirates all know each other to be top-notch logicians. So when each votes, they won't just be thinking about the current proposal, but about all possible outcomes down the line.",
            "Title": "Can you solve the pirate...",
            "VideoId": "Mc6VA7Q1vXQ",
            "Controls": "start=129"
        },
        {
            "Text": " became the seedlings of galaxies. Nestled inside those galaxies, stars began to form. And in doing so, they queued the latest and current stage of the universe's development, the stellar epoch.",
            "Title": "Origins of the Universe...",
            "VideoId": "HdPzOWlLrbE",
            "Controls": "start=257"
        },
        {
            "Text": " and where there are currents there is life",
            "Title": "A Perfect Planet:...",
            "VideoId": "635uup08DLU",
            "Controls": "start=130"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kurt-cobain.webp",
            "Text": "I have to admit I've found myself doing the same things that a lot of other rock stars do or are forced to do. Which is not being able to respond to mail, not being able to keep up on current music, and I'm pretty much locked away a lot. The outside world is pretty foreign to me.",
            "Title": "American Singer",
            "Name": "Kurt Cobain"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-covey.webp",
            "Text": "Studies have identified a significant 'skills gap' between what students are currently being taught and the skills employers are seeking in today's global economy. Our children must be better prepared than they are now to meet the future challenges of our ever-changing world.",
            "Title": "American Educator",
            "Name": "Stephen Covey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/harris-faulkner.webp",
            "Text": "My dad was ex-military, so I was raised to always know about current events, particularly what was going on with the military and government. And I always loved storytelling.",
            "Title": "American Journalist",
            "Name": "Harris Faulkner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/garth-brooks.webp",
            "Text": "I introduce her as the love of my life everywhere that we go. She introduces me as her current husband. So you can see how the relationship kinda works here.",
            "Title": "American Singer",
            "Name": "Garth Brooks"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jimmy-wales.webp",
            "Text": "I still believe there is a need to open up search and it will come eventually. It is very important to challenge the current models.",
            "Title": "American Businessman",
            "Name": "Jimmy Wales"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-burdon.webp",
            "Text": "It's more important what you leave to people on this planet. I want my legacy to exist now, currently, not after I'm gone.",
            "Title": "British Musician",
            "Name": "Eric Burdon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jhumpa-lahiri.webp",
            "Text": "There's more than enough in the world I am currently writing about to last for several lifetimes of writing.",
            "Title": "American Author",
            "Name": "Jhumpa Lahiri"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johann-wolfgang-von-goethe.webp",
            "Text": "Talent develops in quiet places, character in the full current of human life.",
            "Title": "German Writer",
            "Name": "Johann Wolfgang von Goethe"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/suze-orman.webp",
            "Text": "Here's my gift-giving rule: Respect your current financial situation.",
            "Title": "American Author",
            "Name": "Suze Orman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luis-fonsi.webp",
            "Text": "It's important to stay current and fresh.",
            "Title": "Puerto Rican Musician",
            "Name": "Luis Fonsi"
        }
    ]
}