{
    "currentWord": {
        "wordRoot": "debt",
        "id": 20348,
        "phonemic": "det|det\r",
        "bigId": "3dda4422-e4b7-4f1d-87ac-64f9e1084ca3",
        "wordForms": [
            "debts",
            "indebtedness",
            "debt"
        ]
    },
    "senses": [
        {
            "id": "3dda4422-e4b7-4f1d-87ac-64f9e1084ca3",
            "de": "Money that you owe to someone",
            "ty": "noun",
            "ex": "She is trying to pay off a large debt.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "pay a debt",
                " owe a debt",
                " in debt"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3dda4422-e4b7-4f1d-87ac-64f9e1084ca3.webp",
            "Tips": [
                {
                    "title": "Financial Context",
                    "description": "Use 'debt' to talk about money borrowed that must be paid back, often with interest.",
                    "example": "Her car loan added to her growing debt.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Ts3rgElAaf7m3K45wloNCZlBWA.webp"
                },
                {
                    "title": "Metaphoric Use",
                    "description": "'In debt' is often used metaphorically to describe feeling obligated to someone for their help.",
                    "example": "He's been in debt to his friend ever since that favor.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/JMA6osZITfuAUSt4Xq1B9XihL7o.webp"
                },
                {
                    "title": "Common Collocations",
                    "description": "Commonly paired phrases include 'debt relief,' 'debt consolidation,' and 'debt management.'",
                    "example": "Many seek debt relief to escape financial pressure.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/TbXlRBxGQDqh2Af5VvmqJnkmkns.webp"
                }
            ]
        },
        {
            "id": "dda207df-7f3f-4662-b377-704da9d89727",
            "de": "An obligation or duty to repay or do something in return for something received",
            "ty": "noun",
            "ex": "I feel a deep debt of gratitude towards my teachers.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "debt of gratitude",
                " debt of honour",
                " indebted to someone"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/dda207df-7f3f-4662-b377-704da9d89727.webp",
            "Tips": [
                {
                    "title": "Gratitude Expression",
                    "description": "Use 'debt of gratitude' to express a strong feeling of thanks for something someone has done.",
                    "example": "We owe the volunteers a debt of gratitude for their time.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Honor Bound",
                    "description": "'Debt of honour' implies a moral obligation that's not legally binding, often in a formal context.",
                    "example": "He repaid his mentor through a debt of honour.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Debt",
                    "description": "Talking about an 'emotional debt' can describe feelings of owing someone for personal support.",
                    "example": "She felt an emotional debt to her aunt who raised her.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6321cd60-819a-463f-941f-f1a3977dab4c",
            "de": "A negative balance; a deficit",
            "ty": "noun",
            "ex": "The country's public debt has risen dramatically.",
            "use": "",
            "co": "Economic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "national debt",
                " public debt",
                " external debt"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6321cd60-819a-463f-941f-f1a3977dab4c.webp",
            "Tips": [
                {
                    "title": "Economic Term",
                    "description": "'Debt' is used to describe the total amount of money a country owes to its creditors.",
                    "example": "The national debt is often debated in politics.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Public vs. Private",
                    "description": "'Public debt' refers to government debt, while 'private debt' is owed by individuals or businesses.",
                    "example": "Public debt affects a country's economy differently than private debt.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Borrowing Limit",
                    "description": "A 'debt ceiling' is the maximum amount of debt a government allows itself to hold.",
                    "example": "Congress debated raising the debt ceiling.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Deficit": {
            "wordRoot": "Deficit",
            "wordDefinition": "Debt and deficit are both terms related to money owed by a person or a country.\n\nDeficit refers to the difference between the amount of money a government or organization spends and the amount of money it earns.\n\nIf the amount spent is greater than the amount earned, then the result is a deficit. This means that the government or organization is spending more than it can afford and may need to borrow money to cover the difference.\n\nTo summarize, debt is the total amount of money owed by a person or country, while deficit is the difference between spending and earnings.\n\nDebt is applicable when referring to the total borrowing of an entity, while deficit is applicable when referring to the excess spending of an entity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cedc9ccb-05dd-44a1-8a5a-d83ece6e197b.webp"
        },
        "Liability": {
            "wordRoot": "Liability",
            "wordDefinition": "Liability refers to a broader category of financial obligations.\n\nIt can include debts, but it can also include other things like legal obligations or contractual commitments. For example, a company may have a liability to pay employee salaries or a liability to provide certain services to customers.\n\nDebt is a specific type of liability that refers to money owed, while liability is a broader term that encompasses broader financial obligations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ff76edeb-7ee4-47cf-a2fd-d9ad42183f31.webp"
        },
        "Mortgage": {
            "wordRoot": "Mortgage",
            "wordDefinition": "A mortgage is a specific type of debt that you take on to buy a house. It's money that you borrow from a bank or a lender to pay for the house, and you have to pay it back over many years.\n\nSo, in short, debt is a general term for money that you owe, while a mortgage is a specific type of debt that you take on to buy a house.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/001fbecc-d2b2-44c4-8493-659c9a8c3089.webp"
        },
        "Obligation": {
            "wordRoot": "Obligation",
            "wordDefinition": "Debt refers to something you owe to someone, mostly money that you need to pay back. Obligation refers to a sense of duty or responsibility towards something or someone.\n\nDebt is applicable when you borrow money and need to pay it back, while obligation is applicable when you have a sense of duty towards something or someone, even if it does not involve money.\n\nFor example, you may have an obligation to take care of a younger sibling or to study hard for exams.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a56fcd05-e7ab-4e4c-9029-262fa52f9a98.webp"
        }
    },
    "videos": [
        {
            "Text": " Interest rates, meanwhile, reflect the cost of taking on debt for individuals and companies. The rate is typically an annual percentage of a loan that borrowers pay to their creditors until the loan is repaid. Low interest rates mean that companies can afford to borrow more money, which they can use to invest in more projects.",
            "Title": "What causes an economic...",
            "VideoId": "SwaCg7Gwtzw",
            "Controls": "start=110"
        },
        {
            "Text": " College has some shortcomings. It's expensive; it leaves young people in debt. But all in all, it's a pretty good path. Young people emerge from college with pride and with great friends and with a lot of knowledge about the world. And perhaps most importantly,",
            "Title": "Alice Goffman: How we're...",
            "VideoId": "-2Dj9M71JAc",
            "Controls": "start=33"
        },
        {
            "Text": " And it grows slowly. You know, one or two or three percent a year. It grows slowly, and it's not volatile, because knowledge isn't volatile. But it grows, and that raises our living standards over a period of time. Then there's the short-term debt cycle.",
            "Title": "What coronavirus means...",
            "VideoId": "yrxYhv2O3wU",
            "Controls": "start=306"
        },
        {
            "Text": " discipline that has the passion and has the talent you know to do what they do every day incrementally better until the day they die a master doesn't retire the master doesn't stop they do it until their debt it's a part of them it's who you are",
            "Title": "The Art of Shaping a...",
            "VideoId": "TwqZ32TmbIU",
            "Controls": "start=402"
        },
        {
            "Text": " too terrified to invest it into the productive activities that can generate the incomes from which you can extinguish the mountain of debts and which can produce all those things that humanity desperately needs, like green energy.",
            "Title": "Capitalism will eat...",
            "VideoId": "GB4s5b9NL3I",
            "Controls": "start=171"
        },
        {
            "Text": " pressure, opportunity, and rationalization. Pressure is often what motivates someone to engage in fraud to begin with. It could be a personal debt, an addiction, an earnings quota, a sudden job loss, or an illness in the family.",
            "Title": "How people rationalize...",
            "VideoId": "Tb6QX9Yy1GM",
            "Controls": "start=52"
        },
        {
            "Text": " But the self-loathing of that period left a void, and celebration needs to fill and overflow it, and even if I repay my private debt of melancholy, there's still an outer world of homophobia that it will take decades to address.",
            "Title": "How the worst moments in...",
            "VideoId": "RiM5a-vaNkg",
            "Controls": "start=817"
        },
        {
            "Text": " then lastly not a direct debt of the country but it's the contingent liabilities which we saw in the recent crisis is very important the too big to fail those institutions in a country where a government will step in if I",
            "Title": "Pulling back the curtain...",
            "VideoId": "OuBsqIFouVo",
            "Controls": "start=85"
        },
        {
            "Text": " audacious objectives. The first is debt relief for the poorest countries in the world. The next is universal access to anti-HIV drugs. Now, why are these good objectives? Let's go back to our checklist.",
            "Title": "Why the secret to...",
            "VideoId": "L4N1q4RNi9I",
            "Controls": "start=361"
        },
        {
            "Text": " far from the debt and sterility of the cave George is surrounded by countless forms of life",
            "Title": "Surrounded by Life PIPE...",
            "VideoId": "Qz_qRYTgtfM",
            "Controls": "start=0"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-lautenberg.webp",
            "Text": "Anybody who has ever been in business, anybody who has ever paid bills, anybody who has ever lived in a serious adult life knows that indebtedness is a killer.",
            "Title": "American Politician",
            "Name": "Frank Lautenberg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elon-musk.webp",
            "Text": "I care very deeply about the people at Tesla. I feel like I have a great debt to the people of Tesla who are making the company successful.",
            "Title": "South African Businessman",
            "Name": "Elon Musk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stacey-abrams.webp",
            "Text": "I finished my higher education deeply in debt and with seven years of bad credit in my future.",
            "Title": "American Politician",
            "Name": "Stacey Abrams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frankie-boyle.webp",
            "Text": "We live in a culture built on debt, so we are encouraged to have no self control.",
            "Title": "Scottish Comedian",
            "Name": "Frankie Boyle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ernie-banks.webp",
            "Text": "I like my players to be married and in debt. That's the way you motivate them.",
            "Title": "American Baseball Player",
            "Name": "Ernie Banks"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sammy-davis-jr.webp",
            "Text": "Ten million dollars after I'd become a star I was deeply in debt.",
            "Title": "American Entertainer",
            "Name": "Sammy Davis, Jr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/roy-blunt.webp",
            "Text": "It's not long-term debt if the money is immediately paid back.",
            "Title": "American Politician",
            "Name": "Roy Blunt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josh-peck.webp",
            "Text": "I'm forever in debt to Nickelodeon. It made me who I am today.",
            "Title": "American Actor",
            "Name": "Josh Peck"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/manu-ginobili.webp",
            "Text": "The game gave me so much, I am in debt forever.",
            "Title": "Argentinian Athlete",
            "Name": "Manu Ginobili"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ted-yoho.webp",
            "Text": "I'm not going to raise the debt ceiling.",
            "Title": "American Politician",
            "Name": "Ted Yoho"
        }
    ]
}