{
    "currentWord": {
        "wordRoot": "depart",
        "id": 19801,
        "phonemic": "dɪˈpɑːt|dɪˈpɑːrt\r",
        "bigId": "352398b9-eab6-465b-b290-c5db77ab5843",
        "wordForms": [
            "departs",
            "departing",
            "departed",
            "depart"
        ]
    },
    "senses": [
        {
            "id": "352398b9-eab6-465b-b290-c5db77ab5843",
            "de": "To leave a place, especially going to another place",
            "ty": "verb",
            "ex": "The train will depart from platform 1",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "depart from",
                " depart for",
                " depart at"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/352398b9-eab6-465b-b290-c5db77ab5843.webp",
            "Tips": [
                {
                    "title": "Physical Movement",
                    "description": "Use 'depart' when someone moves from one specific place to another.",
                    "example": "She will depart from Chicago at dawn.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/LZn3CuMfnKGosXb061eZxX8NXc.webp"
                },
                {
                    "title": "Planned Time",
                    "description": "'Depart at' usually indicates a scheduled time for leaving, often in transport.",
                    "example": "The flight is scheduled to depart at 6 PM.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ZwIejBmepiYN8mE6O4Cah216GFE.webp"
                },
                {
                    "title": "Preposition Choice",
                    "description": "After 'depart', use 'from' for starting points and 'for' for destinations.",
                    "example": "The bus will depart from Leeds for Manchester.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/35UqSgwFXqQ1u20SRXnowomAdxc.webp"
                }
            ]
        },
        {
            "id": "0e198156-8041-4881-8d3a-60c019558969",
            "de": "To go away from an expected plan or standard",
            "do": "General",
            "ty": "verb",
            "ex": "They decided to depart from the original plan",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "depart from tradition",
                " depart from guidelines",
                " depart from standards"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0e198156-8041-4881-8d3a-60c019558969.webp",
            "Tips": [
                {
                    "title": "Unexpected Change",
                    "description": "Use 'depart' to describe a change from a plan, which can be unexpected or unusual.",
                    "example": "We'll depart from the usual format in today's meeting.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Alternative Action",
                    "description": "It can imply choosing a different method or approach intentionally.",
                    "example": "This recipe departs from the traditional one.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "d172325b-679f-42be-ac93-3f6d2daa77a3",
            "de": "To die, to leave this world",
            "do": "General",
            "ty": "verb",
            "ex": "When our beloved grandmother departed, it was a great loss for our family",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "depart this life",
                " depart this world"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d172325b-679f-42be-ac93-3f6d2daa77a3.webp",
            "Tips": [
                {
                    "title": "Euphemism for Death",
                    "description": "It is a more formal and less direct way to talk about someone dying.",
                    "example": "The old sailor had departed at a ripe age.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Historical Usage",
                    "description": "The concept of 'depart this world' can be found in classical literature.",
                    "example": "In the novel, the hero departs this life nobly.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "02ba9267-c0f7-4a5e-a4d2-5125684f5474",
            "de": "To start a journey",
            "do": "General",
            "ty": "verb",
            "ex": "They departed on their adventure with excitement",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "depart on a journey",
                " depart on a trip"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/02ba9267-c0f7-4a5e-a4d2-5125684f5474.webp",
            "Tips": [
                {
                    "title": "Journey's Commencement",
                    "description": "Specifically used when someone begins a planned trip or expedition.",
                    "example": "They departed on their honeymoon with joy.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Adventure Inference",
                    "description": "Often implies leaving for an adventure or a significant journey.",
                    "example": "The explorers departed for the unknown.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Go away": {
            "wordRoot": "Go away",
            "wordDefinition": "Both depart and go away mean to leave a certain place, but depart is a more formal and polite way to say it. Depart is commonly used in formal settings such as airports, train stations or formal emails, whereas go away is more casual and used in everyday language.\n\nGo away can also imply a sense of annoyance or irritation while depart is neutral. Eg: \"I'm departing from the airport\" vs \"Please go away, you're bothering me\".",
            "wordImage": "https://word-images.cdn-wordup.com/senses/81f01a7c-5d9f-4003-9d09-e2b90a3295ae.webp"
        },
        "Leave": {
            "wordRoot": "Leave",
            "wordDefinition": "Both depart and leave mean to go away or to exit but depart is typically used in more formal or official contexts. For example, a plane departs from the airport or a soldier departs for duty.\n\nLeave is more commonly used in everyday conversation and refers to the act of going away from a place or a person. For instance, someone might say \"I'm leaving work early today\" or \"I'm leaving the party now\".\n\nDepart is more formal while leave is more casual.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7512cdc6-ccba-4ee8-8c07-a14221c28da5.webp"
        },
        "Move out": {
            "wordRoot": "Move out",
            "wordDefinition": "Move out typically refers to physically leaving a residence or dwelling, such as moving out of a house or apartment.\n\nBoth terms can be applicable in a variety of situations, but depart is often used in professional or formal contexts, while move out is more commonly used in informal or personal settings.\n\nFor example, a businessman might depart from a conference room, while a college student might move out of a dorm room.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cc0f71e3-12bd-44fb-b057-607c41bf9d71.webp"
        },
        "Retire": {
            "wordRoot": "Retire",
            "wordDefinition": "Depart refers to leaving or going away from a particular place or situation, while retire refers to leaving a job or career permanently or for an extended period of time.\n\nIf someone is retiring from work, it means that they are leaving their career permanently and will no longer work in that field.\n\nDepart means leaving a place or situation, while retire means leaving a career or job permanently.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/08770110-76a5-463b-b5c8-fff0db7fe53d.webp"
        },
        "Set out": {
            "wordRoot": "Set out",
            "wordDefinition": "The words depart and set out are both used to describe leaving a place, but there is a subtle difference between them.\n\nSet out, on the other hand, is a more casual verb that is often used to describe starting a journey with some enthusiasm or purpose.\n\nIt suggests a sense of adventure or excitement. For example, you might say \"We set out early in the morning to hike to the top of the mountain.\".\n\nDepart is more formal and serious, while set out is more casual and adventurous.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/11cf1816-94fa-479b-bfa4-191e1c6b20c6.webp"
        },
        "Start out": {
            "wordRoot": "Start out",
            "wordDefinition": "The words depart and start out mean the same thing: to leave a place and begin a journey. Depart is a more formal word and is commonly used in situations like airports, train stations, and official documents.\n\nStart out is a more casual word and is commonly used in everyday conversations. For example, you could say \"I departed from the airport\" or \"I started out from my house.\".",
            "wordImage": "https://word-images.cdn-wordup.com/senses/27abf881-4ef1-4379-89ee-107a41a267df.webp"
        },
        "Take off": {
            "wordRoot": "Take off",
            "wordDefinition": "Both depart and take off are words used to express the starting of a journey or leaving one place to go to another.\n\nTake off specifically refers to leaving by air.\n\nIt describes the moment when a plane lifts off the ground and begins to fly. For example, the plane will take off at 3 pm.\n\nSo, in short, depart is a more general term for leaving any place, while take off specifically refers to leaving by air.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88f49a57-8191-4d37-8f1f-8804a6fbf6a3.webp"
        },
        "Vacate": {
            "wordRoot": "Vacate",
            "wordDefinition": "Vacate means to leave a place or position that you are occupying, such as a house, room or job. It often implies that the place or position will be left empty or available for someone else to take.\n\nFor example, \"We need to vacate the apartment by the end of the month because the lease is up.\"\n\nDepart is used when leaving a location, while vacate describes leaving a position or place vacant.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aa0e14ea-05bf-484a-8317-47dbdc044553.webp"
        },
        "Withdraw": {
            "wordRoot": "Withdraw",
            "wordDefinition": "Withdraw means to remove something or someone from a particular situation or location. It means to take away or pull back.\n\nDepart is used to indicate someone leaving a specific place or position, while withdraw is used to indicate the removal of something or someone from a certain situation or location.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0f036228-2267-4efa-913a-dca6bccc0133.webp"
        }
    },
    "videos": [
        {
            "Text": " Instead, you really have to accept them on their own terms, because insects make us question what's normal and what's natural. Now, you know, people write fiction and talk about parallel universes. They speculate about the supernatural, maybe the spirits of the departed walking among us.",
            "Title": "Marlene Zuk: What we...",
            "VideoId": "rP7nmdDA1Fg",
            "Controls": "start=670"
        },
        {
            "Text": " this mating frenzy will prove lethal. And for a successfully mated female, her work is only beginning. Having secured a lifetime supply of sperm from her departed mate, our new queen must now single-handedly start an entire colony. Descending to the ground,",
            "Title": "Mating frenzies, sperm...",
            "VideoId": "RNdouBNrnM0",
            "Controls": "start=42"
        },
        {
            "Text": " feel bad for them that's like me saying I'm paralyzed they feel bad for my legs our nation is paralyzed but it's not the poor neighborhoods are not a separate part we are one nation but shell can't al depart told us we could heal by",
            "Title": "Why you should learn...",
            "VideoId": "J1FVI-MbDGA",
            "Controls": "start=345"
        },
        {
            "Text": " was based on theoretical calculations, while the real-world data told a different story. But then, he departed from the data himself, claiming human ingenuity would always find alternatives to compensate for diminishing resources.",
            "Title": "The infamous overpopulati...",
            "VideoId": "xw2mn40BVo0",
            "Controls": "start=85"
        },
        {
            "Text": " example if a wolf senses that it's being watched it'll alter its behavior and most likely depart knowing that wolves were so sensitive and knowing that they were also protected as an endangered species we decided to approach this",
            "Title": "Jim & Jamie Dutcher: The...",
            "VideoId": "d36MK94POaI",
            "Controls": "start=170"
        },
        {
            "Text": " the fertile queens and their drones depart in a massive swarm. As the days grow colder, the workers starve, and our queen reaches the end of her lifespan. But above, a swarm of reproductive wasps has successfully mated.",
            "Title": "Licking bees and pulping...",
            "VideoId": "q93IfqUbEf4",
            "Controls": "start=261"
        },
        {
            "Text": " by passing the same number of candles you passed on the way there. If the starting candle is now off, you’ve completed the loop and know the giant’s age! Otherwise, depart again, continuing until the next lit candle,",
            "Title": "Can you solve the...",
            "VideoId": "F5sZQ4Xutgk",
            "Controls": "start=115"
        },
        {
            "Text": " safely transporting the ones who call for her assistance. Wild women, they open portals to new worlds, new speech, new dreams. Oh, dearly beloveds, so dearly departed from the ways of the guardian,",
            "Title": "\"Wild Women\" PIPE Sunni...",
            "VideoId": "pnKhVpgcmFc",
            "Controls": "start=229"
        },
        {
            "Text": " anywhere the horizon line says unlimited possibilities how does it life like this again it begins with a photograph that I took when I was 15 years old of my father watching a train depart from",
            "Title": "The Life of a Photograph...",
            "VideoId": "ceJ0S5P-Ybc",
            "Controls": "start=2504"
        },
        {
            "Text": " and elephants have recently been observed visiting and caressing the bones of their departed friends this expression of elephant grief makes a strong case for some animals at least being",
            "Title": "Do Animals Feel Empathy?...",
            "VideoId": "fXUk2ylJ5YI",
            "Controls": "start=135"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marie-antoinette.webp",
            "Text": "My dear mamma is quite right when she says that we must lay down principles and not depart from them. The king will not have the same weaknesses as his grandfather. I hope that he will have no favorites; but I am afraid that he is too mild and too easy. You may depend upon it that I will not draw the king into any great expenses.",
            "Title": "French Royalty",
            "Name": "Marie Antoinette"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-le-gallienne.webp",
            "Text": "Nature is forever arriving and forever departing, forever approaching, forever vanishing; but in her vanishings there seems to be ever the waving of a hand, in all her partings a promise of meetings farther along the road.",
            "Title": "English Poet",
            "Name": "Richard Le Gallienne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/helen-fisher.webp",
            "Text": "As women in industrial societies join the paid workforce, they gain the economic means to depart unhappy marriages more easily.",
            "Title": "American Scientist",
            "Name": "Helen Fisher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-carlyle.webp",
            "Text": "Nothing that was worthy in the past departs; no truth or goodness realized by man ever dies, or can die.",
            "Title": "Scottish Philosopher",
            "Name": "Thomas Carlyle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/david-bowie.webp",
            "Text": "The truth is of course is that there is no journey. We are arriving and departing all at the same time.",
            "Title": "English Musician",
            "Name": "David Bowie"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christopher-columbus.webp",
            "Text": "Tomorrow morning before we depart, I intend to land and see what can be found in the neighborhood.",
            "Title": "Italian Explorer",
            "Name": "Christopher Columbus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-browne.webp",
            "Text": "Life itself is but the shadow of death, and souls departed but the shadows of the living.",
            "Title": "British Scientist",
            "Name": "Thomas Browne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-morley.webp",
            "Text": "The great business of life is to be, to do, to do without and to depart.",
            "Title": "British Statesman",
            "Name": "John Morley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cornelius-nepos.webp",
            "Text": "So that he seemed to depart not from life, but from one home to another.",
            "Title": "Roman Author",
            "Name": "Cornelius Nepos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/desmond-tutu.webp",
            "Text": "We would like to see you departing peacefully.",
            "Title": "South African Leader",
            "Name": "Desmond Tutu"
        }
    ]
}