{
    "currentWord": {
        "wordRoot": "designate",
        "id": 1986,
        "phonemic": "ˈdezɪɡneɪt|ˈdezɪɡneɪt\r",
        "bigId": "a2e73fa5-db17-4c04-bd0d-4424be2dd96e",
        "wordForms": [
            "designates",
            "designating",
            "designated",
            "designation",
            "designate"
        ]
    },
    "senses": [
        {
            "id": "a2e73fa5-db17-4c04-bd0d-4424be2dd96e",
            "de": "To officially choose someone or something for a special job or purpose",
            "ty": "verb",
            "ex": "The company designated her as the new CEO.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "designate someone as",
                " designate something for",
                " designate someone to"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a2e73fa5-db17-4c04-bd0d-4424be2dd96e.webp",
            "Tips": [
                {
                    "title": "Official Roles",
                    "description": "Used when someone is given a formal role or task within an organization.",
                    "example": "She was designated as the official spokesperson for the event.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/hHzCwT9xgKqg28RnUToyGCFMjY.webp"
                },
                {
                    "title": "Future Intent",
                    "description": "Implies a planned or intended future action, often found in official plans or announcements.",
                    "example": "The council designated the old library as a community arts center.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/vcPvhkP7wiGgIcNu3ot9BFLPN4.webp"
                },
                {
                    "title": "Precise Selection",
                    "description": "Implies a careful or deliberate choice out of many possibilities.",
                    "example": "From the applicant pool, three were designated for the final interview round.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oGsiV11VS90W50DHzZMQD0ImVA.webp"
                }
            ]
        },
        {
            "id": "f6c0f559-7841-4d80-9ede-a7eb528723b1",
            "de": "To point out, show, or indicate",
            "ty": "verb",
            "ex": "He designated the spots where the trees will be planted.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "designate a place",
                " designate a spot",
                " designate a location"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f6c0f559-7841-4d80-9ede-a7eb528723b1.webp",
            "Tips": [
                {
                    "title": "Physical Locations",
                    "description": "Often used when specifying locations for specific actions or events, such as construction.",
                    "example": "The architect designated where each piece of furniture should go.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Visual Clarity",
                    "description": "Implies making something clear or evident, like pointing or marking on a map.",
                    "example": "The tour guide designated the rest areas on the map.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Invisible Boundaries",
                    "description": "Can refer to the setting of boundaries or limits that are conceptually understood.",
                    "example": "The playing field's boundaries were designated by the referee.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "d923382a-1129-4a9e-9d7a-777d26f1055a",
            "de": "To give a name or title to something",
            "ty": "verb",
            "ex": "This day is designated as 'World Environment Day'.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "designate as",
                " designate a day",
                " designate a title"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d923382a-1129-4a9e-9d7a-777d26f1055a.webp",
            "Tips": [
                {
                    "title": "Naming Occasions",
                    "description": "Used when a particular day or event is given a special name or title.",
                    "example": "July 20th was designated as 'Moon Day' to commemorate the lunar landing.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Formal Recognition",
                    "description": "Carries a sense of formality when naming or titling events, places, or objects.",
                    "example": "The bridge was designated 'The Freedom Passage' by local authorities.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Cultural Titles",
                    "description": "May involve cultural or societal titles, acknowledging traditions or honor.",
                    "example": "The elder was designated 'Keeper of the Stories' in the community.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Appoint": {
            "wordRoot": "Appoint",
            "wordDefinition": "Appoint means to officially select or assign a person to a position or job.\n\nIt is usually used in a formal or professional setting, such as appointing someone as the CEO of a company, or appointing a judge to a court.\n\nAppoint is more specific to selecting a person for a job or position, while designate can refer to selecting something or someone for any purpose or role.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b1a459ac-0c26-479d-84ec-b3a22e8d9eda.webp"
        },
        "Assign": {
            "wordRoot": "Assign",
            "wordDefinition": "The words assign and designate both mean to give someone or something a task or a name, but they are used in slightly different ways.\n\nTo assign means to give someone a specific task or job to do. For example, a teacher might assign homework to their students or a boss might assign a project to their employees.\n\nAssign is more about giving someone a task or responsibility, while designate is more about giving something a specific label or name.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6585fee7-5cfc-4e13-9bfd-67cd2fca1c80.webp"
        },
        "Indicate": {
            "wordRoot": "Indicate",
            "wordDefinition": "Indicate means to show or suggest something or someone, usually through a sign or signal. For example, a weather vane might indicate which direction the wind is blowing.\n\nDesignate is used to signify official appointments or assignments, while indicate is used to suggest or show something using clues or signs.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf1e3b4d-6eae-44fe-b4dc-294ea0263e68.webp"
        },
        "Name": {
            "wordRoot": "Name",
            "wordDefinition": "Name primarily means to give a specific title or label to something or someone. You can name your pet dog or name a new product for your company.\n\nIn simpler terms, you designate when you assign a specific use or purpose, while you name when you simply give something a title or label.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e3efd8f3-cd84-4cb7-8084-0c737275cd87.webp"
        },
        "Nominate": {
            "wordRoot": "Nominate",
            "wordDefinition": "Designate and nominate are two words that refer to choosing or selecting someone or something for a particular role or purpose.\n\nNominate usually means to suggest or recommend someone or something for a particular role or award. For example, an organization may nominate an individual for an award or a political party may nominate a candidate for an election.\n\nDesignate is more formal and involves an official assignment, while nominate is more informal and involves a recommendation or suggestion.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2cbd7872-2cc7-4b4e-aabe-b4b2e89bb01e.webp"
        },
        "Select": {
            "wordRoot": "Select",
            "wordDefinition": "Select means to choose or pick something out of a group or list of options. For example, a person might select their favorite flavor of ice cream from a menu.\n\nBoth words are applicable in various situations, but designate is more commonly used in formal or official contexts, while select is more commonly used in casual or everyday situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bec7c491-2533-4f4d-8e48-cc704d433714.webp"
        },
        "Specify": {
            "wordRoot": "Specify",
            "wordDefinition": "Specify means to provide specific details or instructions about something. For example, a chef may specify the exact measurements for ingredients in a recipe.\n\nBoth words can be used in different contexts, but designate is typically used when selecting or assigning someone or something, while specify is used when providing specific details or requirements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4d4d9e8f-8bdb-412a-8248-212932238601.webp"
        }
    },
    "videos": [
        {
            "Text": " And what's just as exciting is that my company is now translating these discoveries into the clinic -- into the real world. This technology has just been designated a breakthrough medical device by the FDA. And this designation means that right now we're in the midst of planning human clinical trials",
            "Title": "Could we treat spinal...",
            "VideoId": "IeajljTsrOc",
            "Controls": "start=318"
        },
        {
            "Text": " You’ll only have a few hours to assign them their designated regions before they’ll arrive. Elder dragons are extremely territorial. Each must have its own, officially acknowledged stomping ground. They’ll peacefully roost there unless their region borders another dragon of the same type,",
            "Title": "A riddle of ice and fire...",
            "VideoId": "jMA7pWIFmIg",
            "Controls": "start=28"
        },
        {
            "Text": " two instruments the sea lions themselves are showing the researchers behavior never before witnessed by scientists and exactly where and how they feed it's answering many questions about the endangered sea lions which will help make sure the areas to be designated as",
            "Title": "Never Before Seen!...",
            "VideoId": "62WYMdMdafo",
            "Controls": "start=68"
        },
        {
            "Text": " in designated distressed and low-income areas. Now, these are areas that are also facing staggering water risk, so this creates crucial incentives to work directly with the communities who need help most. And if you're not looking to make this type of investment",
            "Title": "We need to track the...",
            "VideoId": "Rjre6diN35A",
            "Controls": "start=561"
        },
        {
            "Text": " by a number of characteristics. One of these classifications is by surface temperature called spectral classes. These seven major groups range from the coolest stars which are designated as M and up to the hottest stars which are designated as O.",
            "Title": "Stars 101 PIPE National...",
            "VideoId": "EFO_bsg1sw8",
            "Controls": "start=50"
        },
        {
            "Text": " have been designated for wildlife nature and the local people so we've come here to kam Shang country Park located to the northwest of the city a beautiful area that spans just over three kilometers squared but it's home to the largest",
            "Title": "Wild Monkeys in the...",
            "VideoId": "DjMiZe1aIqY",
            "Controls": "start=102"
        },
        {
            "Text": " November 1st was designated All Saints Day to honor martyrs and the deceased faithful both of these holidays had to do with the afterlife and about survival after death it was a calculated move on the part of the church to bring more",
            "Title": "Halloween History PIPE...",
            "VideoId": "R-VRAemIvbI",
            "Controls": "start=77"
        },
        {
            "Text": " Now, I of all people know that it can be incredibly tempting, especially for the overachievers among us -- you know who you are -- to encourage ourselves to do more than our designated better-than-nothing habit. So I must warn",
            "Title": "Christine Carter: The...",
            "VideoId": "EvGkSEuWtaI",
            "Controls": "start=504"
        },
        {
            "Text": " influencers to change the social norms around fishing in a human my marketing campaign also targeted on other people and messages that were designated I carefully identified who the key influencers of my target audiences were",
            "Title": "Protecting the ocean for...",
            "VideoId": "UyIY7-ygNF8",
            "Controls": "start=289"
        },
        {
            "Text": " became the winter home for the dalai lama's monastic leaders of tibetan buddhism unesco world heritage designation extends to the neighboring jo king temple considered Tibet's most sacred",
            "Title": "See Potala Palace, the...",
            "VideoId": "baK3X5Oozh4",
            "Controls": "start=51"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robin-s-sharma.webp",
            "Text": "Leadership is not about a title or a designation. It's about impact, influence and inspiration. Impact involves getting results, influence is about spreading the passion you have for your work, and you have to inspire team-mates and customers.",
            "Title": "Canadian Lawyer",
            "Name": "Robin S. Sharma"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/meryl-streep.webp",
            "Text": "Leave me to the thing I love. I love acting. But being called 'the greatest living actress' - a designation not even my mother would sanction - is the opposite of good or valuable or useful. It is a curse for a working actor.",
            "Title": "American Actress",
            "Name": "Meryl Streep"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michelangelo.webp",
            "Text": "Many believe - and I believe - that I have been designated for this work by God. In spite of my old age, I do not want to give it up; I work out of love for God and I put all my hope in Him.",
            "Title": "Italian Artist",
            "Name": "Michelangelo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kim-kardashian.webp",
            "Text": "I don't even drink! I can't stand the taste of alcohol. Every New Year's Eve I try one drink and every time it makes me feel sick. So I don't touch booze - I'm always the designated driver.",
            "Title": "American Celebrity",
            "Name": "Kim Kardashian"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-hayne.webp",
            "Text": "The model a lot of companies use is a very pyramidal model which sort of designates that all creativity, all wisdom flows from the top. We think that's the absolute wrong model.",
            "Title": "American Businessman",
            "Name": "Richard Hayne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-mugabe.webp",
            "Text": "We have said the first step was to designate the land, inform the owners. And the second would be to get the responses from the owners. And this will be openly done.",
            "Title": "Zimbabwean Statesman",
            "Name": "Robert Mugabe"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jenny-lewis.webp",
            "Text": "It really helps me to get into the character of the record when I have a designated look. It just really simplifies things for me.",
            "Title": "American Musician",
            "Name": "Jenny Lewis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-brett.webp",
            "Text": "Old third basemen become first basemen, and old first basemen become designated hitters.",
            "Title": "American Athlete",
            "Name": "George Brett"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/trevor-bauer.webp",
            "Text": "I am not tired of being baseball's designated 'outspoken guy.' It's just me being me.",
            "Title": "",
            "Name": "Trevor Bauer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/longchenpa.webp",
            "Text": "Realization that is beyond characteristic or designation is marvelous!",
            "Title": "",
            "Name": "Longchenpa"
        }
    ]
}