{
    "currentWord": {
        "wordRoot": "desire",
        "id": 11894,
        "phonemic": "dɪˈzaɪə(r)|dɪˈzaɪər\r",
        "bigId": "6bd756d2-74c8-4af9-bd38-2f46e85b04a7",
        "wordForms": [
            "desires",
            "desiring",
            "desired",
            "desire"
        ]
    },
    "senses": [
        {
            "id": "6bd756d2-74c8-4af9-bd38-2f46e85b04a7",
            "de": "A strong want or wish for something.",
            "ty": "noun",
            "ex": "She had a desire to see the world.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "heart's desire",
                " burning desire",
                " innate desire"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6bd756d2-74c8-4af9-bd38-2f46e85b04a7.webp",
            "Tips": [
                {
                    "title": "Intensity of Wish",
                    "description": "Desire often implies a stronger feeling than a simple wish or want.",
                    "example": "Her desire to start her own business was unstoppable.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/SVcRn9XXqZqNtgErLhSo2dZESU.webp"
                },
                {
                    "title": "Emotional Force",
                    "description": "Use 'desire' to express deep emotional wishes that drive someone's actions.",
                    "example": "He pursued his desire for knowledge throughout his life.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/8GulVyVagZCunaZKkDWq72hid2M.webp"
                }
            ]
        },
        {
            "id": "60af97d6-781d-4a71-b7bf-3e5252a36596",
            "de": "To wish or want something.",
            "ty": "verb",
            "ex": "She desires to become a teacher.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "desire for something",
                " desire to do something",
                " greatly desire"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/60af97d6-781d-4a71-b7bf-3e5252a36596.webp",
            "Tips": [
                {
                    "title": "Formal Tones",
                    "description": "As a verb, 'desire' can sound formal or old-fashioned in everyday speech.",
                    "example": "She desires to present her findings to the board.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Forming Polite Requests",
                    "description": "Using 'desire' can be a polite way to express what you want, especially in writing.",
                    "example": "We desire your presence at the ceremony.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "fe48e378-f478-4bec-bd89-0ebe772c1b62",
            "de": "A physical or sexual want or feeling.",
            "ty": "noun",
            "ex": "He felt a strong desire towards her.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "romantic desire",
                " sexual desire",
                " uncontrolled desire"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/fe48e378-f478-4bec-bd89-0ebe772c1b62.webp",
            "Tips": [
                {
                    "title": "Intimate Contexts",
                    "description": "This meaning of 'desire' is used for intimate or strong attractions to others.",
                    "example": "Their eyes met, filled with mutual desire.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Sensitive Subjects",
                    "description": "Exercise caution using 'desire' in this context, as it's very personal.",
                    "example": "He whispered his desires in a romantic setting.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "b2e9e127-67cb-433f-b66b-886c99c10e3b",
            "de": "A person that somebody wants to have sexually.",
            "ty": "noun",
            "ex": "He has been her desire since high school.",
            "use": "",
            "sy": "",
            "re": "Informal, DIsapproving",
            "tp": "",
            "cl": [
                "object of desire",
                " secret desire",
                " forbidden desire"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b2e9e127-67cb-433f-b66b-886c99c10e3b.webp",
            "Tips": [
                {
                    "title": "Romantic Interest",
                    "description": "This sense of 'desire' often implies a mix of admiration and attraction.",
                    "example": "From afar, he admired his heart's desire.\r",
                    "imageUrl": ""
                },
                {
                    "title": "In Context of Fantasy",
                    "description": "Use it to discuss someone desired typically in a scenario that's not acted upon.",
                    "example": "The movie star was a common desire among fans.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "e4f48d22-3c45-4f02-8a8f-d82fd722aea6",
            "de": "To express a wish for something to happen.",
            "ty": "verb",
            "ex": "The council desires a meeting to discuss the issue.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "desire a change",
                " desire an outcome",
                " desire action"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e4f48d22-3c45-4f02-8a8f-d82fd722aea6.webp",
            "Tips": [
                {
                    "title": "Official Requests",
                    "description": "This usage often appears in formal situations like meetings or official documents.",
                    "example": "The shareholders desire an explanation for the budget changes.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Expectations",
                    "description": "Conveys an expectation that the action requested should happen.",
                    "example": "The director desires prompt action on this matter.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Appetite": {
            "wordRoot": "Appetite",
            "wordDefinition": "Appetite refers specifically to a physical or physiological craving for food or drink. It is the body's natural urge to consume nutrients for energy and nourishment.\n\nAppetite is applicable in a physical or biological context, while desire is applicable in a psychological or emotional context.\n\nFor example, you might have an appetite for breakfast in the morning, but a desire for a successful career in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5f53112e-0508-41b5-a13f-48cbadc5fa0e.webp"
        },
        "Aspiration": {
            "wordRoot": "Aspiration",
            "wordDefinition": "Aspiration means a strong ambition or goal that one strives to achieve in their future. Whereas desire means a strong feeling of wanting something to fulfill one's current needs or interests.\n\nAspiration is applicable when someone thinks of their future career or life goals, whereas desire can be applied to a current want or need such as craving for food or seeking attention from someone.\n\nAspiration is a long-term goal, and desire is a short-term want or need.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e2b77474-dc14-4d64-8808-e8e78771ae0e.webp"
        },
        "Crave": {
            "wordRoot": "Crave",
            "wordDefinition": "The words crave and desire both generally mean to want something, but crave has a stronger and more urgent feeling to it.\n\nFor example, you might say \"I'm craving pizza\" when you really want pizza and can't stop thinking about it, whereas you might say \"I desire a new job\" when you want a new job but it's not as urgent or strong of a feeling as pizza cravings.\n\nCrave is applicable when you want something intensely and urgently, and desire is applicable when you want something but it's not as urgent or intense of a feeling.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fc698a4c-5198-4a73-bcdd-b41ef3b9c64c.webp"
        },
        "Hunger": {
            "wordRoot": "Hunger",
            "wordDefinition": "Hunger is a specific physical sensation that is caused when your body needs food to function. It is a necessity for survival.\n\nDesire refers to a want or wish, while hunger specifically relates to the body's need for sustenance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3c3eca12-8401-4613-a871-49bad1a880fe.webp"
        },
        "Long": {
            "wordRoot": "Long",
            "wordDefinition": "Long can also mean to want something, but it refers more to a general feeling of longing or a persistent desire.\n\nIt is often used when talking about something that a person has been wanting for a long time or something that they feel they are missing in their life.\n\nOverall, both words refer to a strong desire for something, but desire is more specific and long is more general.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9500c190-4291-419b-8b82-a1ac21cd6df6.webp"
        },
        "Thirst": {
            "wordRoot": "Thirst",
            "wordDefinition": "Thirst is a physical sensation that one feels when they need water to drink. It is applicable when one needs to quench their thirst by drinking water or another hydrating liquid.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/35491f92-c1b5-4f59-b95f-aa4eaaf23b71.webp"
        },
        "Want": {
            "wordRoot": "Want",
            "wordDefinition": "Desire and want are both words that express a feeling of wanting something, but they are used in slightly different ways.\n\nIt is a deeper or more intense feeling than wanting. For example, you might desire to travel the world or to be with someone you love, even if those things are not currently possible.\n\nWant is a more general term that can refer to any type of desire or need.\n\nIt is often used to express a more immediate or practical need or desire, such as wanting to eat when you're hungry or wanting to buy a new video game.\n\nDesire is a stronger feeling of longing for something that may be difficult to obtain, while want is a more general term for any type of desire or need.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/67c9e067-06b5-42d7-a103-abb976b39bce.webp"
        },
        "Wish": {
            "wordRoot": "Wish",
            "wordDefinition": "Wish typically refers to a more passive or hopeful desire, often accompanied by a feeling of uncertainty about whether it will actually come true.\n\nWhile you may take steps to make your wishes come true, they are often seen as less urgent or important than desires.\n\nBoth words can be used in a variety of contexts, but if you really want to convey a sense of strong, driving desire, you might use desire instead of wish.\n\nIf you simply have a preference or a hope for something, you would be more likely to use wish.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/46e8e6c9-5a63-4017-938c-1d241188323c.webp"
        },
        "Yearn": {
            "wordRoot": "Yearn",
            "wordDefinition": "Desire and yearn are similar words that express a strong feeling of wanting something.\n\nYearn implies a deep and intense longing, often for something unattainable or out of reach. For example, you may yearn to be with someone who is far away, or to achieve a goal that seems impossible.\n\nDesire can be satisfied through various means, whereas yearning is a deeper and more intense feeling that may be difficult to satisfy.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f856fe2b-da4e-47c8-a688-3e1a6eadbbd9.webp"
        }
    },
    "videos": [
        {
            "Text": " And many of the problems faced by humans in the poems are caused by their hubris, or excessive pride in believing themselves superior to the gods. The desire to please the gods was so great that the Ancient Greeks traditionally welcomed all strangers into their homes with generosity",
            "Title": "Everything you need to...",
            "VideoId": "8Z9FQxcCAZ0",
            "Controls": "start=158"
        },
        {
            "Text": " but because of the way traits are inherited, all of the seedlings produced will have different sets of genes and characteristics. This means that to achieve a desired quality, it takes a lot of offspring, not to mention patience on the breeder's part.",
            "Title": "Why are there so many...",
            "VideoId": "mQePz62zkqA",
            "Controls": "start=98"
        },
        {
            "Text": " here are some of the things you'll need to bring to The Red a high tolerance for cold, loneliness, and radiation; a lifetime supply of breathable air and food; a multibillion dollar spaceship; a desire to just get away from it all; and water.",
            "Title": "Could we actually live...",
            "VideoId": "DMMPYkRrd4o",
            "Controls": "start=18"
        },
        {
            "Text": " we love in order to quench our physical and psychological desires. Humans are designed to procreate, but without the ecstasy of passionate love, sex is unsatisfying. Our fear of the cold, cruel world tempts us to build hard shells",
            "Title": "Why do we love? A...",
            "VideoId": "yJSiUm6jvI0",
            "Controls": "start=138"
        },
        {
            "Text": " Exploration is a compulsory human trait. We're the only animal on the planet driven so deeply by curiosity. From the surface of the Earth, the ocean floor, to space. Humans have an insatiable desire for adventure and exploration.",
            "Title": "How the Mojave Desert...",
            "VideoId": "_BEwY3130hI",
            "Controls": "start=0"
        },
        {
            "Text": " Recent advances in communication technology have had immeasurable benefits in breaking down the barriers between information and people. But our desire for quick answers may overpower the desire to be certain of their validity.",
            "Title": "How false news can...",
            "VideoId": "cSKGa_7XJkg",
            "Controls": "start=167"
        },
        {
            "Text": " desire for attention, desire to feel special, desire to feel important. And the very structure of an affair, the fact that you can never have your lover, keeps you wanting. That in itself is a desire machine,",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=819"
        },
        {
            "Text": " And in many cases, members may willingly submit out of desire to belong and to attain the promised rewards. The cult environment discourages critical thinking, making it hard to voice doubts",
            "Title": "Why do people join...",
            "VideoId": "kB-dJaCXAxA",
            "Controls": "start=270"
        },
        {
            "Text": " hungry child cannot think about anything other than the desire to eat another of my worries is more war and rivalry look at the world around us people are becoming so angry and",
            "Title": "A message from the next...",
            "VideoId": "-QIi_MPo0b0",
            "Controls": "start=286"
        },
        {
            "Text": " but most important for the crested black macaque is to learn their code of etiquette lip smacking is a request for a hug showing a desire to be friends",
            "Title": "Best Monkey Moments PIPE...",
            "VideoId": "opyPkipNNhE",
            "Controls": "start=98"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ava-duvernay.webp",
            "Text": "I made my first film when I was 35, so I firmly believe that you don't have to be one thing in life. If you're doing something, and you have a desire to do something different, give it a try.",
            "Title": "American Director",
            "Name": "Ava DuVernay"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-merton.webp",
            "Text": "A life is either all spiritual or not spiritual at all. No man can serve two masters. Your life is shaped by the end you live for. You are made in the image of what you desire.",
            "Title": "American Author",
            "Name": "Thomas Merton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lou-holtz.webp",
            "Text": "If you're bored with life - you don't get up every morning with a burning desire to do things - you don't have enough goals.",
            "Title": "American Coach",
            "Name": "Lou Holtz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/e-o-wilson.webp",
            "Text": "If history and science have taught us anything, it is that passion and desire are not the same as truth.",
            "Title": "American Scientist",
            "Name": "E. O. Wilson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jiddu-krishnamurti.webp",
            "Text": "Listening has importance only when one is not projecting one's own desires through which one listens.",
            "Title": "Indian Philosopher",
            "Name": "Jiddu Krishnamurti"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/simon-sinek.webp",
            "Text": "The most basic human desire is to feel like you belong. Fitting in is important.",
            "Title": "English Author",
            "Name": "Simon Sinek"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wayne-dyer.webp",
            "Text": "Everything is perfect in the universe - even your desire to improve it.",
            "Title": "American Psychologist",
            "Name": "Wayne Dyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charlie-chaplin.webp",
            "Text": "What do you want a meaning for? Life is a desire, not a meaning.",
            "Title": "English Actor",
            "Name": "Charlie Chaplin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marilyn-monroe.webp",
            "Text": "It is wonderful to have someone praise you, to be desired.",
            "Title": "American Actress",
            "Name": "Marilyn Monroe"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/socrates.webp",
            "Text": "From the deepest desires often come the deadliest hate.",
            "Title": "Greek Philosopher",
            "Name": "Socrates"
        }
    ]
}