{
    "currentWord": {
        "wordRoot": "discount",
        "id": 10720,
        "phonemic": "ˈdɪskaʊnt|ˈdɪskaʊnt\r",
        "bigId": "3d1211f2-3c16-4457-9262-fa2ada395c35",
        "wordForms": [
            "discounts",
            "discounting",
            "discounted",
            "discount"
        ]
    },
    "senses": [
        {
            "id": "3d1211f2-3c16-4457-9262-fa2ada395c35",
            "de": "to take off an amount from the usual cost of something",
            "ty": "verb",
            "ex": "The shop discounts its merchandise every end of the month.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "give a discount",
                " apply discount",
                " receive discount"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3d1211f2-3c16-4457-9262-fa2ada395c35.webp",
            "Tips": [
                {
                    "title": "Savings Opportunity",
                    "description": "Use when speaking about getting a better price on a purchase.",
                    "example": "Look for the sign that says 'Discount' to save money.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/VKIqtRMkGzOm549lmF519uUUUQ.webp"
                },
                {
                    "title": "Conditional Discounts",
                    "description": "Sometimes discounts apply only with certain conditions—like bulk buys.",
                    "example": "They'll discount the price if you buy three or more.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/osxHN3wm4htX4J0R3Rq5mgLJmtc.webp"
                }
            ]
        },
        {
            "id": "d624fe21-3faf-4a92-8153-b0ea46c2292c",
            "de": "an amount taken off the usual cost of something",
            "ty": "noun",
            "ex": "I got this shirt at a discount, so it was really cheap.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "get a discount",
                " offer a discount",
                " employee discount"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d624fe21-3faf-4a92-8153-b0ea46c2292c.webp",
            "Tips": [
                {
                    "title": "Common during Sales",
                    "description": "Discounts are often given during sale events, like Black Friday.",
                    "example": "I'm waiting for the seasonal sale to get a discount.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Price Negotiation",
                    "description": "Asking for a discount implies that you're trying to negotiate a lower price.",
                    "example": "Can you offer a discount on this item?",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "06034348-1a96-4896-a014-456ae3f61f7f",
            "de": "to think of something or someone as being less important or worthy",
            "ty": "verb",
            "ex": "Don't discount her idea just because she's a kid.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "discount someone's opinion",
                " discount an idea",
                " discount possibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/06034348-1a96-4896-a014-456ae3f61f7f.webp",
            "Tips": [
                {
                    "title": "Undervalue Alert",
                    "description": "To 'discount' an idea or opinion means not giving it the merit it may deserve.",
                    "example": "Try not to discount her suggestion so quickly.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subtle Dismissal",
                    "description": "Using 'discount' this way can subtly imply dismissiveness or skepticism.",
                    "example": "He discounted the rumors as mere speculation.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "599e0f46-b612-4d0c-8588-7239a67e9b42",
            "de": "to sell stock at a reduced price in order to encourage buyers",
            "do": "Commercial",
            "ty": "verb",
            "ex": "The company discounted its products to increase sales.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "discount stocks",
                " discount products",
                " discount inventory"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/599e0f46-b612-4d0c-8588-7239a67e9b42.webp",
            "Tips": [
                {
                    "title": "Business Strategy",
                    "description": "In business, to 'discount' products means reducing prices strategically to boost sales.",
                    "example": "The store discounted older models to clear inventory.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Clearance Context",
                    "description": "This term is often used to describe price reductions to clear stock.",
                    "example": "Discounted items are final sales and can't be returned.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Allowance": {
            "wordRoot": "Allowance",
            "wordDefinition": "An allowance is a fixed amount of money that is given to someone regularly, especially a child, for their personal expenses or to spend as they wish.\n\nAn allowance is for personal expenses of a child, while a discount is for reducing the price of goods or services.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf608320-a148-475b-8c2f-a455db5c1bee.webp"
        },
        "Concession": {
            "wordRoot": "Concession",
            "wordDefinition": "A concession is a special deal or privilege that is granted to someone. For example, a student might receive a concession of a reduced price ticket at the movie theater.\n\nConcessions are often granted based on a person's circumstances, such as age, occupation, or financial need.\n\nThe key difference between concessions and discounts is that a concession is a special deal granted to an individual based on certain circumstances, while a discount is a more general reduction in price available to anyone who meets certain requirements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/afeef1d0-805a-415a-99c0-4b7dde892ef4.webp"
        },
        "Cut": {
            "wordRoot": "Cut",
            "wordDefinition": "Cut means to reduce a price or value of something.\n\nIt can be used in any context where you're talking about lowering a price or removing a portion of something. For example, if a store cuts the price of a shirt from $20 to $15, they have reduced the price of the shirt by $5.\n\nCut can be used in any situation where something is reduced, while discount specifically refers to a reduction in price.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e3a36ebe-26f6-4d5d-97f6-b6136bfd293d.webp"
        },
        "Deduction": {
            "wordRoot": "Deduction",
            "wordDefinition": "Deduction refers to a subtraction or taking away an amount from a total or sum.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6c0cb4f3-d369-47e2-a040-3f2e0fb17205.webp"
        },
        "Off": {
            "wordRoot": "Off",
            "wordDefinition": "Off refers to a reduction in percentage or amount from the original price. For example, if a book is originally priced at $20 and is on sale for 25% off, then the discounted price is $15.\n\nBoth terms are applicable in situations where a price reduction is being offered.\n\nHowever, discount typically refers to a specific amount being deducted from the original price, while off refers to a percentage or amount being subtracted from the original price.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ea8b32ab-6a0b-432b-bf2d-1887882d543d.webp"
        },
        "Rebate": {
            "wordRoot": "Rebate",
            "wordDefinition": "A rebate is a refund given to a customer after they have made a purchase. It typically involves submitting a form with proof of purchase, such as a receipt, and then receiving a check or credit for a portion of the purchase price.\n\nFor example, if you buy a smartphone for $500 and the manufacturer offers a $100 rebate, you would pay the full $500 initially, but then receive a $100 check from the manufacturer later on.\n\nOverall, discounts are applied at the time of purchase to reduce the initial cost, while rebates are given after the purchase as a partial refund.\n\nDiscounts are typically advertised and applied automatically, while rebates usually require some additional effort on the part of the customer to claim the refund.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/067f3fb1-2339-44cb-8e25-978139607bcb.webp"
        },
        "Reduce": {
            "wordRoot": "Reduce",
            "wordDefinition": "Reduce means to make something smaller or less in quantity, size, or value. For instance, a store might reduce the price of a product by $10, which means that the item costs less than it did before.\n\nDiscount is applicable when a seller wants to offer a promotional price, whereas reduce is applicable when a seller wants to lower the price of a product for other reasons, such as clearance or reducing inventory.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/46be9f28-a68f-4b62-a438-202a8a114804.webp"
        },
        "Sale": {
            "wordRoot": "Sale",
            "wordDefinition": "Sale refers to a specific period of time during which items are offered at a reduced price. For example, a store might have a Back-to-School Sale where all school supplies are discounted for a limited time, or a customer might receive a discounted price on a product during a Black Friday Sale.\n\nIn short, discounts are generally offered to specific individuals or groups, while sales are open to everyone and are for a specific period of time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f2f471f1-10bc-45fe-868e-2282368e1a4a.webp"
        }
    },
    "videos": [
        {
            "Text": " So the next time you're at the grocery store, don't be afraid to pick up funky-looking fruit. Some stores will even give you a discount. Wash them well and store them properly, as some produce like apples and cabbages will keep in the fridge for weeks. The spotty ones may not be eye candy, but they're safe and just as delicious.",
            "Title": "Are spotty fruits and...",
            "VideoId": "Mn5N60PCAjs",
            "Controls": "start=213"
        },
        {
            "Text": " There are failing schools in a lot of these communities, failing to give kids the educational leg up that really makes it possible for kids to have opportunities later in life. These things are all important. I don't mean to discount these structural barriers. But when I look back at my life and my community,",
            "Title": "America's forgotten...",
            "VideoId": "iEy-xTbcr2A",
            "Controls": "start=235"
        },
        {
            "Text": " than the original sticker value for those jeans. So here's my third and final above all else, do not use these payment installment plans. If you want an actual discount, there are browser plug-ins you can use that will help you find the best deals. Online retail has made shopping incredibly convenient,",
            "Title": "3 sneaky tactics that...",
            "VideoId": "Vvvb6mvu7Ls",
            "Controls": "start=190"
        },
        {
            "Text": " We can all start exploring our career possibilities. It might be an ambitious possibility that you don't feel ready for yet. Or perhaps it's a pivot that feels interesting, but just that bit out of reach. Or maybe it's a dream that you've discounted. The most important thing",
            "Title": "Sarah Ellis and Helen...",
            "VideoId": "1ALfKWG2nmw",
            "Controls": "start=366"
        },
        {
            "Text": " discounts and he sees how that's a newer sign and from that he realizes that this is a neighborhood that used to be wealthy that has now fallen on hard times and the narrative that he creates based on this photograph is one about a man the character in the center who's",
            "Title": "Storytellers Summit Day...",
            "VideoId": "9_jCrlNLbhk",
            "Controls": "start=219"
        },
        {
            "Text": " for discounts on their premiums, of course. We know what some of you are this is the contract of the modern world. You give up a little privacy, and you get some convenience or some price breaks in return. But that wasn't my experience in my smart home.",
            "Title": "What your smart devices...",
            "VideoId": "POHYyP4EbzE",
            "Controls": "start=284"
        },
        {
            "Text": " large lot, single family, distant, too expensive for the average middle-class family to afford and, quite frankly, not a good fit to their lifestyle anymore. But in order to move inventory, you can discount the financing and get it sold.",
            "Title": "7 principles for...",
            "VideoId": "IFjD3NMv6Kw",
            "Controls": "start=298"
        },
        {
            "Text": " entire life has passions that are illegal and dangerous let me use another family example our father was a successful psychiatrist who is also an alcoholic without discounting the terrible costs of alcoholism because his",
            "Title": "Prohibition criminalizes...",
            "VideoId": "SRinBmmFyHw",
            "Controls": "start=200"
        },
        {
            "Text": " With fantastical beliefs like these, how can we take him seriously? Any renowned thinker from centuries past has ideas that seem fantastical by today’s standards, but we can’t discount their influence on this basis.",
            "Title": "History vs. Sigmund...",
            "VideoId": "mKG-PEVYOR8",
            "Controls": "start=216"
        },
        {
            "Text": " and, occasionally, kidnapping us in their flying saucers and taking us away to have sex with us in pyramids. It's a difficult theory to discount, I think you'll agree. For even in my own life,",
            "Title": "John Hodgman: A brief...",
            "VideoId": "8W51H1croBw",
            "Controls": "start=215"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/noreena-hertz.webp",
            "Text": "Debt vultures are really the scum at the bottom of the pond. These are guys who buy up the debts of the world's poorest countries on the secondary market. You can go buy debts of a country like Peru, for example, at a real discount. Why? Because people think that the debts won't be repaid.",
            "Title": "English Author",
            "Name": "Noreena Hertz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-e-rogers.webp",
            "Text": "Academics often discount the value of top-rated sports programs in helping to develop a campus life and in contributing to the overall success of a college or university. Like it or not, the sports programs a college or university has are the front page of that university.",
            "Title": "American Educator",
            "Name": "James E. Rogers"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stockwell-day.webp",
            "Text": "My parents did not have a perfect marriage. It was pretty good, but it was not perfect. My marriage is not perfect. My wife is, but I happen to be imperfect. However, that does not discount the fact that the definition of marriage must be defended and protected.",
            "Title": "Canadian Politician",
            "Name": "Stockwell Day"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/karan-mahajan.webp",
            "Text": "We discount the physical, when, in fact, much of life is physical. People's personalities are partly formed by, or in response to, how they take up space; the physical mask has some relation, howsoever obscure, to the mental work happening underneath.",
            "Title": "Indian Novelist",
            "Name": "Karan Mahajan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dennis-miller.webp",
            "Text": "Never ever discount the idea of marriage. Sure, someone might tell you that marriage is just a piece of paper. Well, so is money, and what's more life-affirming than cold, hard cash?",
            "Title": "American Comedian",
            "Name": "Dennis Miller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-thaler.webp",
            "Text": "Economists discount any factors that would not influence the thinking of a rational person.",
            "Title": "American Economist",
            "Name": "Richard Thaler"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rex-tillerson.webp",
            "Text": "We don't discount that people's fears are their fears.",
            "Title": "American Businessman",
            "Name": "Rex Tillerson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dennis-deyoung.webp",
            "Text": "Heck, I feel guilty getting my senior discounts.",
            "Title": "American Musician",
            "Name": "Dennis DeYoung"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brad-goreski.webp",
            "Text": "I am a sale shopper. I love a discounted item.",
            "Title": "American Designer",
            "Name": "Brad Goreski"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-schmich.webp",
            "Text": "Reading is a discount ticket to everywhere.",
            "Title": "American Journalist",
            "Name": "Mary Schmich"
        }
    ]
}