{
    "currentWord": {
        "wordRoot": "disparate",
        "id": 19578,
        "phonemic": "ˈdɪspərət|ˈdɪspərət\r",
        "bigId": "c8d655b9-c426-4293-a6ba-6f2a9d53efc3",
        "wordForms": [
            "disparate"
        ]
    },
    "senses": [
        {
            "id": "c8d655b9-c426-4293-a6ba-6f2a9d53efc3",
            "de": "Things that are very different from each other.",
            "ty": "adjective",
            "ex": "Their styles of painting are disparate.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "disparate elements",
                " disparate groups",
                " disparate parts"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c8d655b9-c426-4293-a6ba-6f2a9d53efc3.webp",
            "Tips": [
                {
                    "title": "Not Interchangeable",
                    "description": "Use 'disparate' to emphasize strong difference, not for things that are slightly different.",
                    "example": "The twins had disparate interests: one loved ballet, the other astrophysics.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/7B9WAsv1U9A7sNBfjpFJI7HiEc.webp"
                },
                {
                    "title": "No Negative Bias",
                    "description": "'Disparate' describes difference without suggesting one is better or worse.",
                    "example": "Despite their disparate social backgrounds, they treated each other as equals.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/lRekaYtA2t9sXTUDPMfwDJxKG4.webp"
                },
                {
                    "title": "Combine Harmoniously",
                    "description": "'Disparate' elements can be brought together in a way that is interesting or attractive.",
                    "example": "The festival celebrated the city's culture with music and food from disparate traditions.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/wOs97tiU5pqeXsLn1UZussRyvII.webp"
                }
            ]
        }
    ],
    "comparisons": {
        "Contrast": {
            "wordRoot": "Contrast",
            "wordDefinition": "Contrast means to compare two things that are different from each other in order to show the differences. For example, when we say \"contrast the two paintings,\" we are looking for differences between the two paintings.\n\nContrast is used when we want to compare two things that are different, while disparate is used when we want to describe things that are completely different and have no connection.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/24fcb177-63ed-4bfa-8068-706d6ed55145.webp"
        },
        "Different": {
            "wordRoot": "Different",
            "wordDefinition": "Different refers to something that is not the same as another thing or that is distinct in nature. For example, \"These two apples are different colors\".\n\nDisparate refers to things that are fundamentally different, often in a way that makes them difficult to compare or connect.\n\nDifferent describes things that may have similarities but also noticeable distinctions, while disparate describes things that are so fundamentally different that they cannot be compared.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e8abccb5-3e5b-4168-a161-81efaf122650.webp"
        },
        "Dissimilar": {
            "wordRoot": "Dissimilar",
            "wordDefinition": "The words disparate and dissimilar both mean different, but they are used in slightly different situations.\n\nDissimilar, on the other hand, describes things that share some commonalities but are still fundamentally different. For example, \"though their hair colors are dissimilar, both sisters have the same nose shape,\" meaning that the sisters share a feature but are still distinct from each other in some way.\n\nDisparate is used when there is no connection between two things, while dissimilar is used when there are some similarities but the things are still different.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7e33413d-8f62-43af-b08a-8b0e2221c0ea.webp"
        },
        "Diverse": {
            "wordRoot": "Diverse",
            "wordDefinition": "Diverse means things that are different from each other but can still be compared with each other. For example, different types of fruits are diverse.\n\nDisparate refers to two things that have no similarities, while diverse refers to things that are different but still have some similarities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1e0c5744-b8a9-4764-aac3-fed3be3b74ac.webp"
        },
        "Equal": {
            "wordRoot": "Equal",
            "wordDefinition": "Equal refers to things that are identical or have the same value. It's used to describe things that have equivalence or balance.\n\nFor example, \"All students in the class have an equal chance to participate in the science fair.\"\n\nDisparate means different while equal means the same.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/690cd2ad-2e94-4761-a9ad-cfd1a03f7938.webp"
        },
        "Incompatible": {
            "wordRoot": "Incompatible",
            "wordDefinition": "Incompatible means two things that cannot work together, such as oil and water. They cannot mix because they are incompatible with each other.\n\nIf you want to compare two things that are different, you can use the word disparate. But if you mean that two things cannot work together, you can use the word incompatible.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f0495dda-e75d-420f-8f35-3cf25a018710.webp"
        },
        "Inconsistent": {
            "wordRoot": "Inconsistent",
            "wordDefinition": "Disparate refers to things that are different in nature or kind, while inconsistent refers to things that are not compatible or don't match up.\n\nIf you were comparing two stories that were supposed to have the same characters and plot but had plot holes and major differences, you might say they are inconsistent because they don't match up or make sense together.\n\nDisparate refers to differences in nature or kind, while inconsistent refers to things that are not compatible or don't match up.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8d7e6a8d-bb09-4064-962e-df8568e49aa5.webp"
        },
        "Oppose": {
            "wordRoot": "Oppose",
            "wordDefinition": "Oppose means to go against or resist something.\n\nIt is used when someone or something is taking a stand against or trying to stop another thing. For example, \"The students strongly oppose the new dress code policy.\".\n\nTo summarize, disparate means different, while oppose means to resist or go against.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/eed81ede-e3bb-41d6-baec-cca26ce23413.webp"
        },
        "Vary": {
            "wordRoot": "Vary",
            "wordDefinition": "Vary means \"to differ or change in some way\" and is used when referring to things that have some degree of similarity but differ in some way, such as \"varying opinions\" or \"varied weather patterns.\"\n\nIn simpler terms, disparate is used when talking about things that are fundamentally different and cannot be compared, while vary is used when talking about things that have some degree of similarity but differ in some way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/56f9181e-757c-4e91-b984-b47647b1141f.webp"
        }
    },
    "videos": [
        {
            "Text": " might actually look for long-term solutions that will make the food system better for everyone we all tend to think that these systems are quite different and people argue whether or not organic can feed the world but if we take a 30-year view there's more hope in collaborative ideas so I'm hoping that by connecting really disparate",
            "Title": "Obesity + Hunger = 1...",
            "VideoId": "SXwYyb0AzmA",
            "Controls": "start=459"
        },
        {
            "Text": " it's a it's a fascinating challenge there is any that this is extreme at togetherness I suppose I'm feeling with the world everything feels like it's uniting and in a particular kind of a way and everything also feels very disparate and so much that's like an extension of our of our ordinary lives",
            "Title": "Spectacular, glorious,...",
            "VideoId": "JWRqI2ZRHWQ",
            "Controls": "start=636"
        },
        {
            "Text": " much longer period of time some people don't have that they become lactose intolerant yeah this is actually a really nice example I think of how all the technological advances that have happened in the last couple of decades are really bringing people from disparate scientific backgrounds",
            "Title": "National Geographic...",
            "VideoId": "xTg-vLWe1BI",
            "Controls": "start=366"
        },
        {
            "Text": " Let's do something a little more difficult. Here, we have a whole bunch of disparate images. We can fly around them. So navigation is a fundamental issue. You have to be able to navigate in 3D. Much of what we want computers to help us with in the first place is inherently spatial.",
            "Title": "Pointing to the future...",
            "VideoId": "b6YTQJVzwlI",
            "Controls": "start=410"
        },
        {
            "Text": " doing so to see music assume a functional role beyond mere entertainment the city music project also created an infrastructure for innovation by building a network which previously disparate refugee groups could come together the project also aided in identifying strong visionary",
            "Title": "Music gives voice to the...",
            "VideoId": "UXzhZgKLuJ8",
            "Controls": "start=177"
        },
        {
            "Text": " What does this mean? It means you've got to stop pretending you can do these two very disparate skill sets with the same 19-year-old. Switching back, morning, afternoon, evening, morning, afternoon, evening. Handing out aid, shooting back, handing out aid, shooting back.",
            "Title": "Thomas Barnett:...",
            "VideoId": "d3xlb6_0OEs",
            "Controls": "start=984"
        },
        {
            "Text": " a room full of disparate cats prior to the music being played the cats displayed behavior that was aggressive or agitated some hissed or struck out while others took refuge in the corner of the room one even hid herself in a litter tray but once the music started",
            "Title": "Nora The Piano Playing...",
            "VideoId": "dmp8xCAnrZQ",
            "Controls": "start=41"
        },
        {
            "Text": " The federal government abdicated most responsibility. And so we ended up with this wild patchwork of regulations all over America. Every city, county, state did their own thing. And the rules and the belief systems were wildly disparate.",
            "Title": "Laurie Garrett: What can...",
            "VideoId": "2lJvr5UL2pQ",
            "Controls": "start=657"
        },
        {
            "Text": " or the spread of a pandemic around the world. These are useful tools in our toolbox, but they don't necessarily alone change minds or unite disparate views. So how do we do that? We shift from focusing on one key truth",
            "Title": "What Wikipedia Teaches...",
            "VideoId": "r2gsj0EEE3I",
            "Controls": "start=460"
        },
        {
            "Text": " on the same topic versus disparate. The second one is called shared reality, and this is what percentage of the conversation shares the same facts -- not whether those facts are truthful or not,",
            "Title": "How Twitter needs to...",
            "VideoId": "BcgDvEdGEXg",
            "Controls": "start=672"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/aaron-koblin.webp",
            "Text": "The truth is I'm not actually an expert programmer! I really don't consider myself to be an expert at anything. For me, it's more about having a well-rounded and broad horizon. I think that's where a lot of the more interesting things come from - mashing up completely disparate aspects of life to create something new and original.",
            "Title": "American Artist",
            "Name": "Aaron Koblin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alex-tizon.webp",
            "Text": "The idea that humanity is divided into these separate and distinct and disparate groups with clear boundaries has been disproven by science a long time ago, decades ago. Humanity really is more of a continuum, and that people belong on the same continuum and there are no clear breaks between these so-called races.",
            "Title": "Filipino Author",
            "Name": "Alex Tizon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stacey-abrams.webp",
            "Text": "At any given moment, we each face a barrage of obligations, often disparate and distinct from what we thought would happen when we woke up. From the tragic to the common to the extraordinary, life refuses to be divvied up into careful slices of time. No technology can manage to overcome the realities of reality.",
            "Title": "American Politician",
            "Name": "Stacey Abrams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ben-bernanke.webp",
            "Text": "The public in many countries is understandably concerned by the commitment of substantial government resources to aid the financial industry when other industries receive little or no assistance. This disparate treatment, unappealing as it is, appears unavoidable.",
            "Title": "American Public Servant",
            "Name": "Ben Bernanke"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marya-hornbacher.webp",
            "Text": "It's really interesting to me how all of us can experience the exact same event, and yet come away with wildly disparate interpretations of what happened. We each have totally different ideas of what was said, what was intended, and what really took place.",
            "Title": "American Author",
            "Name": "Marya Hornbacher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-depodesta.webp",
            "Text": "In disciplines as disparate as baseball, financial services, trucking and retail, people are realizing the power of data to help make better decisions.",
            "Title": "American Businessman",
            "Name": "Paul DePodesta"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeff-perry.webp",
            "Text": "Actors usually respond to minor aspects of their own character or things that even feel disparate from themselves.",
            "Title": "American Actor",
            "Name": "Jeff Perry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-r-george.webp",
            "Text": "Even the contemporary horror authors who have seriously influenced me are a disparate bunch.",
            "Title": "Canadian Author",
            "Name": "Stephen R. George"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-cameron.webp",
            "Text": "The films that influenced me were so disparate that there's almost no pattern.",
            "Title": "American Director",
            "Name": "James Cameron"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/natasha-rothwell.webp",
            "Text": "It was really important to me to explore how disparate people are connected.",
            "Title": "American Actress",
            "Name": "Natasha Rothwell"
        }
    ]
}