{
    "currentWord": {
        "wordRoot": "dividend",
        "id": 1708,
        "phonemic": "ˈdɪvɪdend|ˈdɪvɪdend\r",
        "bigId": "3440eb20-3214-481b-897e-439cc2e67494",
        "wordForms": [
            "dividends",
            "dividend"
        ]
    },
    "senses": [
        {
            "id": "3440eb20-3214-481b-897e-439cc2e67494",
            "de": "A number to be divided by another number.",
            "ty": "noun",
            "ex": "In the division equation 12 ÷ 4 = 3, 12 is the dividend.",
            "use": "",
            "co": "Academic",
            "re": "",
            "tp": "",
            "cl": [
                "pay a dividend",
                " receive a dividend",
                " declare a dividend"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3440eb20-3214-481b-897e-439cc2e67494.webp",
            "Tips": [
                {
                    "title": "Mathematical Term",
                    "description": "Used in math to describe the number you divide by another in division.",
                    "example": "When calculating 45 ÷ 9, 45 is the dividend.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Nx4alSZQFWUcZ0K0WawOjaN7M.webp"
                },
                {
                    "title": "Basic Arithmetic",
                    "description": "Fundamental concept in basic arithmetic that features in everyday calculations.",
                    "example": "On her calculator, she identified 60 as the dividend when solving 60 ÷ 15.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/upxFELJnP4j68jHYNi0YW9SOVgc.webp"
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "beb1e41c-0f63-46fa-8ecd-4db65ddd75e6",
            "de": "A payment made by a corporation to its shareholders, usually in the form of cash or additional shares.",
            "do": "Finance",
            "ty": "noun",
            "ex": "Many people buy stocks that pay high dividends to increase their income.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "high dividend",
                " dividend yield",
                " dividend payout"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/beb1e41c-0f63-46fa-8ecd-4db65ddd75e6.webp",
            "Tips": [
                {
                    "title": "Investment Income",
                    "description": "Represents the income investors receive from owning shares, usually paid regularly.",
                    "example": "He was ecstatic to receive a dividend for his stock investments this quarter.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Profit Sharing",
                    "description": "Indicates a company's sharing of profits with its shareholders.",
                    "example": "The tech company announced a generous dividend after a profitable year.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Stocks Appeal",
                    "description": "Dividend-paying stocks can attract investors looking for regular income.",
                    "example": "His portfolio focused on stocks with a high dividend yield.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "edd5cb27-0165-4954-b4ab-e7a1b052d0ee",
            "de": "A reward, return, or benefit obtained from an investment or effort.",
            "ty": "noun",
            "ex": "Getting a healthy body is the dividend of daily exercise.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "earn a dividend",
                " dividend of hard work",
                " daily dividend"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/edd5cb27-0165-4954-b4ab-e7a1b052d0ee.webp",
            "Tips": [
                {
                    "title": "Metaphorical Use",
                    "description": "Often used metaphorically to describe the benefits of an action or decision.",
                    "example": "Studying every day paid dividends during his final exams.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Beyond Finances",
                    "description": "Applies to various life situations, not just financial contexts.",
                    "example": "Caring for the community garden has yielded a great dividend of fresh vegetables.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Personal Growth",
                    "description": "Represents personal rewards gained from self-improvement or hard work.",
                    "example": "The knowledge gained is a dividend of her relentless research.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Appropriation": {
            "wordRoot": "Appropriation",
            "wordDefinition": "Appropriation means the act of setting aside or allocating something for a particular purpose. It is commonly used in the context of budgets and finance, where it refers to the allocation of funds for specific purposes, such as research or equipment.\n\nIn simpler terms, appropriation is about setting aside money for a specific purpose, while a dividend is about receiving a share of profits as a shareholder.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b0842afc-cfb5-41e4-8aed-8e6b27930b82.webp"
        },
        "Bonus": {
            "wordRoot": "Bonus",
            "wordDefinition": "Bonus and dividend are both forms of additional monetary compensation, but they have different meanings and applications.\n\nA bonus is an extra payment or reward given to employees or individuals in addition to their regular salary or wages. Bonuses are often given as a way to incentivize good work or productivity, and can be based on performance, profitability, or other criteria set by the employer.\n\nBonuses are commonly given out during holidays, year-ends, or upon the completion of a significant project.\n\nBonus is a form of extra payment given to employees or individuals based on their performance or productivity, while dividend is a payment made by a company to its shareholders based on the profits earned.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88ced8df-cf3b-4eef-802d-73d5716588e7.webp"
        },
        "Compensation": {
            "wordRoot": "Compensation",
            "wordDefinition": "Compensation refers to the payment or reward given to an individual or company for providing goods or services.\n\nIt can include salaries, bonuses, commissions, and other forms of payment. Compensation is applicable in employment or business settings, where individuals are compensated for their work or services.\n\nCompensation is a payment for services provided, while dividends are a share of the profits earned by a company.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d5034d15-f81f-4878-b380-128ec77f4f75.webp"
        },
        "Distribution": {
            "wordRoot": "Distribution",
            "wordDefinition": "Distribution refers to the act of giving or spreading something out, like distributing flyers or distributing goods to stores.\n\nIn finance, distribution usually means distributing profits to shareholders or investors.\n\nSo while both distribution and dividends involve the spreading out of profits, dividends specifically refer to the portion of profits paid out to shareholders.\n\nDistribution is a broader term that can refer to many things, while dividends are a specific type of distribution in the world of finance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/89752752-2a60-42c1-af50-421170cd1910.webp"
        },
        "Earnings": {
            "wordRoot": "Earnings",
            "wordDefinition": "Earnings refers to the amount of money a company makes in profits after all expenses have been taken into account.\n\nEarnings can come from a variety of sources, such as selling products or services or investing in other businesses.\n\nBoth dividends and earnings are important for investors to consider when deciding whether to invest in a company. Dividends are perceived to be a sign of financial stability and can provide a steady stream of income for investors.\n\nEarnings show how well a company is performing and can impact the overall value of a company's stock.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/06bde760-5e4c-4226-b8bc-2327d9e8d24a.webp"
        },
        "Return": {
            "wordRoot": "Return",
            "wordDefinition": "A dividend is a payment made to the shareholders of a company as a distribution of its profits. Meanwhile, a return refers to the profit or loss on an investment over a period of time, expressed as a percentage of the initial investment.\n\nThe dividend is a share of a company's profits that are distributed to its shareholders, while return is the amount of money earned or lost on an investment.\n\nDividends are paid out periodically, usually quarterly or annually, while the return can fluctuate depending on the performance of the investment.\n\nIn short, dividends are applicable to shareholders of a company, while returns are applicable to investors in any asset, such as stocks, bonds, or real estate.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e2a954d7-5bb5-42c7-88bb-921405699b24.webp"
        },
        "Share": {
            "wordRoot": "Share",
            "wordDefinition": "A dividend is the portion of a company's profits that is paid out to its shareholders. If you own shares in a company, you may receive a dividend payment.\n\nA share represents a portion of ownership in a company. When you buy shares in a company, you become a shareholder and own a part of the company.\n\nAs a shareholder, you may be entitled to receive dividends, but you also have the potential to earn a return on your investment if the value of your shares increase.\n\nIn simpler terms, a dividend is a payout to shareholders from a company's profits, while a share is a unit of ownership in a company that may entitle the shareholder to receive dividends and potentially earn a profit from the increase in value of the shares.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/21ffd681-ea15-4cac-97aa-b8576044651c.webp"
        },
        "Yield": {
            "wordRoot": "Yield",
            "wordDefinition": "Dividend refers to the portion of a company's profits that is paid out to its shareholders as a form of income. Yield refers to the percentage return on investment that a shareholder receives from owning a stock.\n\nYield is applicable to investors who are looking for a return on their investment, as it represents the return they will receive as a percentage of the amount of money they have invested.\n\nDividend is a specific form of income that is paid out to shareholders, while yield is a way of measuring the return on investment that a shareholder receives from owning a stock.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/32e8d641-bbe4-4dd2-9239-d1f660d6c72d.webp"
        }
    },
    "videos": [
        {
            "Text": " and the pests and the different things that affect their agriculture so it is really an integral part of a program and something we're really connecting scientists as well as increasing the investment we think will have huge dividends uh yeah it's not only connecting scientists which is so important but connecting scientists to farmers on the ground who are actually",
            "Title": "Food Security in an...",
            "VideoId": "8jvRB8U8vEw",
            "Controls": "start=2233"
        },
        {
            "Text": " that's where the important market leadership is. Right? And the last thing we point out in this slide, which is, you know, that to this story, there's one caveat. India has the youngest growing population in the world. This demographic dividend is incredible, but paradoxically, there's also the mirage of mighty labor pools.",
            "Title": "Nirmalya Kumar: India's...",
            "VideoId": "iyfdWsa1zns",
            "Controls": "start=777"
        },
        {
            "Text": " to have this demographic dividend. In other words, it will be the only young country in an aging world. And this is very important. At the same time if you peel away the demographic dividend in India, there are actually two demographic curves. One is in the south and in the west of India,",
            "Title": "Nandan Nilekani's ideas...",
            "VideoId": "2cYDyMnL4M8",
            "Controls": "start=155"
        },
        {
            "Text": " the product leadership is that's where the important market leadership is and the last thing we point out in this slide which is you know that to the story there's one caveat India has the youngest growing population in the world this demographic dividend is incredible",
            "Title": "India's invisible...",
            "VideoId": "zodVSlOuShc",
            "Controls": "start=779"
        },
        {
            "Text": " aid an important goal for all of us and this was the beginning of our trek through the Millennium Development Goals the first four years were very difficult for Nigeria New Democracy everybody wanted the dividends overnight and this was very difficult for us to do four",
            "Title": "The path toward...",
            "VideoId": "UqRvHmAIZao",
            "Controls": "start=318"
        },
        {
            "Text": " to overcome problems that most people aren't faced with. One of the first lessons that I learned immediately followed the painful and arduous task of learning how to walk again, but it went on to pay dividends for the rest of my life.",
            "Title": "The perks of being a...",
            "VideoId": "KzIp4IzDPG0",
            "Controls": "start=90"
        },
        {
            "Text": " and then we were on the right track thirty years of research and dedication paid off the success rate with orphans soared and has paid dividends for matora who would almost certainly have died but for the success",
            "Title": "Feeding Baby Orphaned...",
            "VideoId": "qoXBIDikriU",
            "Controls": "start=321"
        },
        {
            "Text": " years of research and dedication paid off the success rate with orphans has soared and has paid dividends for mutora who would almost certainly have died but for the success",
            "Title": "Adorable Baby Animal...",
            "VideoId": "W9zdyytICHU",
            "Controls": "start=950"
        },
        {
            "Text": " such as gains in trade when two parties trade their surpluses and both come out ahead, or when two parties lay down their arms and split the so-called peace dividend",
            "Title": "The surprising decline...",
            "VideoId": "ramBFRt1Uzk",
            "Controls": "start=906"
        },
        {
            "Text": " and a political dead end. The answer is to return all the money raised directly to citizens, in the form of equal monthly dividends.",
            "Title": "A climate solution where...",
            "VideoId": "ta2Wvy9F_gA",
            "Controls": "start=297"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-bogle.webp",
            "Text": "Well, bitcoin is a currency. Bitcoin has no underlying rate of return. You know, bonds have an interest coupon. Stocks have earnings and dividends. Gold has nothing, and bitcoin has nothing. There is nothing to support the bitcoin except the hope that you will sell it to somebody for more than you paid for it.",
            "Title": "American Businessman",
            "Name": "John C. Bogle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-lee-chin.webp",
            "Text": "Gold is a commodity; over the long run, as we look back, it has not been a good investment. You can't look at the intrinsic value of gold as you can a business. Gold doesn't give you cash flow, and, at the end of the day, cash flow is what is important. Gold doesn't give you dividends.",
            "Title": "Jamaican Businessman",
            "Name": "Michael Lee-Chin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/larry-fitzgerald.webp",
            "Text": "I was fortunate to have a grandfather who was an optometrist. Vision therapy was something that we routinely did to strengthen our eyes and give us better focus. I was fortunate that he could teach me techniques that are still paying dividends for me to this day.",
            "Title": "American Athlete",
            "Name": "Larry Fitzgerald"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/douglas-r-oberhelman.webp",
            "Text": "Infrastructure is one of the core responsibilities of government and one that cannot be shortchanged by other controversial spending. I believe investment in infrastructure pays dividends for decades and is a wise investment of taxpayer dollars.",
            "Title": "American Businessman",
            "Name": "Douglas R. Oberhelman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nikita-parris.webp",
            "Text": "We played out on the street every single day as a family, with neighbours, at the community centres, and I developed the desire to win very early. That environment instilled a competitive edge in me, which has paid dividends in my life.",
            "Title": "English Athlete",
            "Name": "Nikita Parris"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/j-b-pritzker.webp",
            "Text": "I focus on supporting high quality early childhood health care and education. By betting my resources on very young children, I know I'm making an investment that pays guaranteed dividends with a high rate of return.",
            "Title": "Argentinian Businessman",
            "Name": "J. B. Pritzker"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/evan-osnos.webp",
            "Text": "If the economy can only provide a diminishing political dividend, Chinese leaders will encourage their people to feel pride and vigor in other ways.",
            "Title": "American Journalist",
            "Name": "Evan Osnos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joe-kaeser.webp",
            "Text": "At the end of the day, dividends are not being paid with margins; dividends are paid with earnings per share.",
            "Title": "German Businessman",
            "Name": "Joe Kaeser"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kay-ivey.webp",
            "Text": "Providing the tools for a great start in life will yield dividends for generations to come.",
            "Title": "American Politician",
            "Name": "Kay Ivey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/piyush-goyal.webp",
            "Text": "Reaping political dividends out of tragedies is deeply engrained in the Congress' DNA.",
            "Title": "Indian Politician",
            "Name": "Piyush Goyal"
        }
    ]
}