{
    "currentWord": {
        "wordRoot": "durable",
        "id": 13603,
        "phonemic": "ˈdjʊərəbl|ˈdʊrəbl\r",
        "bigId": "d7d68b65-723c-4b78-bd5b-05843579d665",
        "wordForms": [
            "durable"
        ]
    },
    "senses": [
        {
            "id": "d7d68b65-723c-4b78-bd5b-05843579d665",
            "de": "Something that lasts a long time and isn't damaged easily.",
            "ty": "adjective",
            "ex": "The car tyres are durable and can last for years.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "durable goods",
                " durable material",
                " durable equipment"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d7d68b65-723c-4b78-bd5b-05843579d665.webp",
            "Tips": [
                {
                    "title": "Wear and Tear",
                    "description": "Use 'durable' when an item can withstand damage from daily use.",
                    "example": "These durable shoes have survived many hikes.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/85gDp0uwMdXAz5bR1gPuMqbELo4.webp"
                },
                {
                    "title": "Product Lifetime",
                    "description": "'Durable' suggests an item will last longer than others of its kind.",
                    "example": "I bought a durable backpack for college.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ivdhpf7nJYser9KN5zCq18p22Q.webp"
                },
                {
                    "title": "Value for Money",
                    "description": "A durable item is often seen as good value, as it doesn’t need frequent replacement.",
                    "example": "This durable tablecloth was well worth the price.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/OzQRVIzlxSSlzuo2MSyTetTNyvY.webp"
                }
            ]
        },
        {
            "id": "c52d0fcf-a533-43ab-8dcb-3a65f0beb4e4",
            "de": "In economic terms, a product that is not consumed immediately but is used over a longer period.",
            "do": "Economics",
            "ty": "adjective",
            "ex": "Refrigerators and cars are considered durable goods.",
            "use": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "durable goods market",
                " durable goods purchases",
                " durable goods sales"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c52d0fcf-a533-43ab-8dcb-3a65f0beb4e4.webp",
            "Tips": [
                {
                    "title": "Not Consumable",
                    "description": "In economics, 'durable' means an item isn't used up quickly and serves over time.",
                    "example": "Investing in durable goods can be cost-efficient.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Investment Items",
                    "description": "Durable goods are often pricier, as they're seen as investments, not short-term buys.",
                    "example": "Many businesses prefer purchasing durable equipment.",
                    "imageUrl": ""
                }
            ],
            "sy": ""
        }
    ],
    "comparisons": {
        "Endure": {
            "wordRoot": "Endure",
            "wordDefinition": "Endure means the ability to withstand hardship or difficult conditions. For example, a person can endure a long hike in the mountains despite being tired and uncomfortable.\n\nDurable is applicable when talking about physical objects that need to last a long time, while endure is applicable when talking about people or things that need to withstand difficult or challenging situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/40ebae8f-7454-4294-90a5-7609b5ce23c3.webp"
        },
        "Permanent": {
            "wordRoot": "Permanent",
            "wordDefinition": "Permanent implies that something is meant to last forever and will not change or go away. For example, a permanent tattoo will always be on the skin and cannot be easily removed.\n\nDurable is applicable to things that need to withstand wear and tear, whereas permanent is applicable when something needs to last forever.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2047cd1b-1be9-4e18-98c5-60987c581d06.webp"
        },
        "Reliable": {
            "wordRoot": "Reliable",
            "wordDefinition": "Durable means that something is strong and long-lasting, whereas reliable means that something can be trusted to work as expected.\n\nReliable is applicable when talking about something you can depend on, like a reliable car that will always start when you need it to.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b20b748c-53ec-4fb2-95be-4bdc0b45bf47.webp"
        },
        "Resilient": {
            "wordRoot": "Resilient",
            "wordDefinition": "Resilient means something or someone that can bounce back or recover quickly from difficult situations or challenges.\n\nIn simple terms, something that is durable can last a long time, while something that is resilient can recover quickly from challenges.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6b04b710-ee84-41c5-ba08-a75ee0409855.webp"
        },
        "Robust": {
            "wordRoot": "Robust",
            "wordDefinition": "Robust is used when talking about something that can withstand a lot of force or pressure without breaking. For example, a robust piece of furniture will be able to support a lot of weight without falling apart.\n\nIf you want something that will last a long time, you would look for something that is durable. If you want something that can handle a lot of stress or pressure, you would look for something that is robust.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/103df61a-eaa2-4ce2-84d8-85b22096b40f.webp"
        },
        "Sturdy": {
            "wordRoot": "Sturdy",
            "wordDefinition": "The words durable and sturdy both mean that something is strong and can withstand some kind of force or wear and tear.\n\nSturdy on the other hand, implies that something is strong and well-built, but may not necessarily last as long as something that is durable.\n\nFor example, a sturdy table is one that won't easily tip over or collapse under weight.\n\nDurable is a more broad and all-encompassing term, while sturdy tends to refer more to physical strength and stability.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d134b6c9-30b0-4a97-91d9-1f7278781247.webp"
        },
        "Substantial": {
            "wordRoot": "Substantial",
            "wordDefinition": "Substantial refers to something that is large or significant in size, amount, or importance. For example, a substantial meal is one that is big enough to satisfy your hunger and provide enough energy for the day, while a substantial amount of money is one that is enough to make a significant impact or purchase.\n\nDurable refers to the ability to withstand damage and function normally, while substantial refers to the size, amount, or importance of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/95444393-dfd0-4242-b0cf-a79e5ab7c0d4.webp"
        },
        "Tough": {
            "wordRoot": "Tough",
            "wordDefinition": "Tough, on the other hand, refers to something that can withstand a lot of stress or pressure, such as a sturdy pair of boots that can handle rough terrain.\n\nIf you need something that can withstand rough conditions, you might look for a product that is tough.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/704baef5-a147-47ce-84e1-00a5183433ab.webp"
        }
    },
    "videos": [
        {
            "Text": " a phenomenon known as the forgetting curve. But this loss can be prevented through memory consolidation, the process by which information is moved from our fleeting short-term memory to our more durable long-term memory. This consolidation occurs with the help of a major part of the brain, known as the hippocampus.",
            "Title": "The benefits of a good...",
            "VideoId": "gedoSfZvBgE",
            "Controls": "start=101"
        },
        {
            "Text": " They’re durable and reusable, like cotton, but made of plastic, which has a lower carbon footprint than cotton or paper. These sturdy shopping bags consist of polyester, vinyl and other tough plastics, and are already used worldwide. Most importantly, they should last a lifetime—",
            "Title": "Which bag should you...",
            "VideoId": "3_fjEc4aQVk",
            "Controls": "start=244"
        },
        {
            "Text": " that we have very similar lives to elephants and that elephants have very individual, durable characters that we've measured across years. The bully always tends to be the bully unless there's some kind of social upset, and he decides he better be a softy",
            "Title": "The family structure of...",
            "VideoId": "VXHRtoH0kIQ",
            "Controls": "start=422"
        },
        {
            "Text": " This floor is made of glossy and durable bamboo skin. You can feel the texture under bare feet. And the floor that you walk on, can it affect the way that you walk? Can it change the footprint that you'll ultimately leave on the world?",
            "Title": "Magical houses, made of...",
            "VideoId": "kK_UjBmHqQw",
            "Controls": "start=558"
        },
        {
            "Text": " instruments that are at the cutting edge it's my hope that by designing an instrument that's easier to maintain sounds great and is more durable it'll encourage a new generation to pick up the sitar and explore the rich tradition",
            "Title": "Can you play the sitar?...",
            "VideoId": "y-PRh4KAfIc",
            "Controls": "start=320"
        },
        {
            "Text": " So here are three core strategies for peacefully turning awareness into action and protest into durable political power. First, expand the frame of the possible, second, choose a defining fight, and third, find an early win.",
            "Title": "How to turn protest into...",
            "VideoId": "c_g1BMVFcuw",
            "Controls": "start=56"
        },
        {
            "Text": " thing and that highlights just how important that is to have a skeleton with bones made of this composite material this allows bone to be both flexible and durable but more than anything it allows bone to be strong",
            "Title": "How to Make Bendy and...",
            "VideoId": "teq9V7dPjLg",
            "Controls": "start=142"
        },
        {
            "Text": " having less than a ten-year life expectancy, scientists are working to exploit the physical properties of materials down to the quantum level in the hopes of making memory devices faster, smaller, and more durable.",
            "Title": "How computer memory...",
            "VideoId": "p3q5zWCw8J4",
            "Controls": "start=267"
        },
        {
            "Text": " But the good news is there's something else that's cheap, durable, adaptable and everywhere. And my research shows it may even be able to help us with our plastic pollution problem. I'm talking about bacteria.",
            "Title": "These bacteria eat...",
            "VideoId": "nbW4XWkJC6w",
            "Controls": "start=70"
        },
        {
            "Text": " help charge an iPad it's a durable semi flexible panel that can clip on to a backpack the output is a microUSB which can then charge these portable batteries so you attach this to your bug out bag",
            "Title": "Selling Survival:...",
            "VideoId": "croyb0jY22s",
            "Controls": "start=25"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/j-d-vance.webp",
            "Text": "We are so isolated in our own little worlds, in our own little geographies, that it's pretty hard to understand where someone else is coming from. And so I think that we have to really think about what that means as a country and, frankly, whether this segregation that we have is durable over the long run.",
            "Title": "American Author",
            "Name": "J. D. Vance"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-saunders.webp",
            "Text": "It seems to me a worthy goal: try to create a representation of consciousness that's durable and truthful, i.e., that accounts, somewhat, for all the strange, tiny, hard-to-articulate, instantaneous, unwilled things that actually go on in our minds in the course of a given day, or even a given moment.",
            "Title": "American Writer",
            "Name": "George Saunders"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerome-powell.webp",
            "Text": "While monetary policy can contribute to growth by supporting a durable expansion in a context of price stability, it cannot reliably affect the long-run sustainable level of the economy's growth.",
            "Title": "American Public Servant",
            "Name": "Jerome Powell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robin-day.webp",
            "Text": "There's this very vulnerable planet of ours with finite resources. Architects and designers have, I think, a fair responsibility for conserving energy and materials, and making things durable.",
            "Title": "British Journalist",
            "Name": "Robin Day"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gita-gopinath.webp",
            "Text": "In reality, while currency movements can have a significant impact on inflation in other countries, dollar movements have rarely had a meaningful or durable impact on prices in the U.S.",
            "Title": "Indian Economist",
            "Name": "Gita Gopinath"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alexander-the-great.webp",
            "Text": "Whatever possession we gain by our sword cannot be sure or lasting, but the love gained by kindness and moderation is certain and durable.",
            "Title": "Leader",
            "Name": "Alexander the Great"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-forrestal.webp",
            "Text": "For the only way in which a durable peace can be created is by world-wide restoration of economic activity and international trade.",
            "Title": "American Public Servant",
            "Name": "James Forrestal"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bette-davis.webp",
            "Text": "Wave after wave of love flooded the stage and washed over me, the beginning of the one great durable romance of my life.",
            "Title": "American Actress",
            "Name": "Bette Davis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/c-s-lewis.webp",
            "Text": "Affection is responsible for nine-tenths of whatever solid and durable happiness there is in our lives.",
            "Title": "British Writer",
            "Name": "C. S. Lewis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/arthur-henderson.webp",
            "Text": "Another essential to a universal and durable peace is social justice.",
            "Title": "British Politician",
            "Name": "Arthur Henderson"
        }
    ]
}