{
    "currentWord": {
        "wordRoot": "eligible",
        "id": 10801,
        "phonemic": "ˈelɪdʒəbl|ˈelɪdʒəbl\r",
        "bigId": "e2622d0a-29f6-4cbd-a6c4-9e3934ed5e16",
        "wordForms": [
            "ineligible",
            "eligible"
        ]
    },
    "senses": [
        {
            "id": "e2622d0a-29f6-4cbd-a6c4-9e3934ed5e16",
            "de": "Having the right to do or get something",
            "ty": "adjective",
            "ex": "She is eligible to run for election.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "eligible for",
                " eligible to",
                " eligible candidate"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e2622d0a-29f6-4cbd-a6c4-9e3934ed5e16.webp",
            "Tips": [
                {
                    "title": "Eligibility Criteria",
                    "description": "Understand the specific criteria making someone eligible for a right, benefit, or position.",
                    "example": "You must be over 18 to be eligible to vote.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/p9XrQ06rAuzYI59eXLoIWQlGCI.webp"
                },
                {
                    "title": "Conditional Right",
                    "description": "'Eligible' often means having a conditional right that depends on meeting certain requirements.",
                    "example": "Only eligible members can access the club lounge.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/mKkaN9rNINHduT47VRvezvSqC8.webp"
                },
                {
                    "title": "Opportunity Access",
                    "description": "'Eligible' can imply the opportunity to access something exclusive or beneficial.",
                    "example": "As a student, you are eligible for discounted fares.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oARrGwVe0zah5HLZ1m1gnwWzs.webp"
                }
            ]
        },
        {
            "id": "af47681c-8a7e-4bab-89b7-a0d7e2f504f4",
            "de": "Desirable or suitable, especially for marriage",
            "ty": "adjective",
            "ex": "He is one of the most eligible bachelors in town.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "eligible bachelor",
                " eligible for marriage",
                " eligible spinster"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/af47681c-8a7e-4bab-89b7-a0d7e2f504f4.webp",
            "Tips": [
                {
                    "title": "Social Suitability",
                    "description": "Reflects societal standards of what is considered desirable or suitable, often regarding marriage.",
                    "example": "In social circles, she's considered an eligible match.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Cultural Preference",
                    "description": "Understand that 'eligible bachelor/spinster' can carry traditional cultural preferences regarding partners.",
                    "example": "He's seen as an eligible bachelor because of his career and charm.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "a324a387-e6de-4bb8-afca-f3b0edb591d6",
            "de": "Worthy or deserving of something",
            "ty": "adjective",
            "ex": "Due to his good behavior, he is eligible for parole.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "eligible for parole",
                " eligible for award",
                " eligible for promotion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a324a387-e6de-4bb8-afca-f3b0edb591d6.webp",
            "Tips": [
                {
                    "title": "Merit-Based Eligibility",
                    "description": "'Eligible' can refer to being considered worthy due to merit, such as good behavior or performance.",
                    "example": "She's eligible for the 'Employee of the Month' award.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Recognition Eligibility",
                    "description": "Can mean being worthy of recognition or a special opportunity because of one's efforts or achievements.",
                    "example": "After years of hard work, he is now eligible for tenure.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Able": {
            "wordRoot": "Able",
            "wordDefinition": "Able means having the capability or power to do something. It implies that a person has the necessary skills and resources to accomplish a task or goal.\n\nAble means having the ability to do something, while eligible means meeting the qualifications or requirements to do something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6f2b2642-0820-47bb-8f3b-7d56f91988a5.webp"
        },
        "Accept": {
            "wordRoot": "Accept",
            "wordDefinition": "Accept means to take or receive something that is offered or given. It is applicable when someone is given something that they are willing to take.\n\nFor example, if someone is offered a scholarship, they can choose to accept it or not.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/62e1ac07-7784-4922-819c-028a87b7ed7e.webp"
        },
        "Admissible": {
            "wordRoot": "Admissible",
            "wordDefinition": "Both admissible and eligible refer to something or someone meeting certain requirements or criteria, but they are used in different contexts.\n\nAdmissible generally refers to evidence or information that can be used in a legal case. It means that the evidence or information is valid, relevant, and meets a certain standard (such as being obtained legally).\n\nFor example, a confession may be deemed admissible in court if it was obtained voluntarily and without coercion.\n\nAdmissible is used in a legal sense, while eligible is used more broadly to refer to qualifications or entitlements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4da2d057-8fcf-4043-86e8-dd0eb50de124.webp"
        },
        "Entitle": {
            "wordRoot": "Entitle",
            "wordDefinition": "Entitle means having a right to something, especially as a result of meeting certain conditions. For example, if you buy a ticket to a concert, you are entitled to attend the concert because you have met the condition of purchasing the ticket.\n\nIn short, eligibility means being qualified, while entitlement means having a right to something. Eligibility applies to opportunities or benefits, while entitlement refers to rights.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fb6d60e3-e0c3-45dc-b389-c7a99b88cb03.webp"
        },
        "Fit": {
            "wordRoot": "Fit",
            "wordDefinition": "Fit means suitable or appropriate for a particular situation or purpose. For example, if you are fit to play a sport, it means you have the necessary physical abilities and skills to do so.\n\nSo, eligibility is about meeting requirements while fitness is about being suitable for a specific task. Eligibility is used when there are rules or standards to be met, while fitness is used when there is a specific task or goal in mind.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/09f43536-9366-414b-9a14-c16261bdf960.webp"
        },
        "Meet": {
            "wordRoot": "Meet",
            "wordDefinition": "Eligible refers to meeting the criteria or requirements to qualify for something, such as receiving a scholarship or being allowed to vote.\n\nIt means that you are qualified or allowed to do something.\n\nMeet means to fulfill or satisfy a requirement or expectation.\n\nIt is used when there is a certain standard or criteria that needs to be met. For example, if you have to get a certain grade to pass a class, you need to meet that grade to pass.\n\nEligible means you qualify for something based on predetermined criteria, while meet means that you have satisfied the criteria or requirements for something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b866f5e5-51a2-4bb6-9b0e-fd8aabb6cef4.webp"
        },
        "Qualified": {
            "wordRoot": "Qualified",
            "wordDefinition": "Qualified means that someone has the necessary skills, knowledge or expertise to successfully perform a particular role or task.\n\nFor example, if you have the required education, training and experience, you are qualified to work in a certain profession.\n\nEligible refers to meeting the criteria to apply for something, while qualified refers to having the necessary skills, training or experience to do something well.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f7b464fc-d943-4277-a83d-1bf267acf21d.webp"
        },
        "Suitable": {
            "wordRoot": "Suitable",
            "wordDefinition": "Suitable means something is appropriate or fitting for a particular purpose or situation. For example, if you are looking for a new job, you might say a certain position is suitable for you if it matches your skills and interests.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6d287bed-5059-4640-b2bc-99e6009a64dd.webp"
        }
    },
    "videos": [
        {
            "Text": " a valid nomination can come from a member of a national assembly, state government, or an international court. Eligible nominators also include university rectors, professors of the social sciences, history, philosophy, law, and theology, and previous recipients of the Peace Prize. But if you want to know more about who was recently nominated,",
            "Title": "How does the Nobel Peace...",
            "VideoId": "rXhpK_lhonA",
            "Controls": "start=143"
        },
        {
            "Text": " meaning that only people who fall below a certain income level are eligible for benefits. This policy is designed to ensure aid goes to those who need it most. But it also means people lose access as soon as they earn more than the qualification threshold, regardless of whether or not they're financially stable enough to stay there.",
            "Title": "Why is it so hard to...",
            "VideoId": "D9N7QaIOkG8",
            "Controls": "start=97"
        },
        {
            "Text": " that a vaccinated person who catches the flu anyway will have a milder and shorter illness than they would otherwise. Vaccination also helps protect other people in the community who may not be medically eligible for the shot by preventing those around them from carrying the virus.",
            "Title": "How often should you get...",
            "VideoId": "FZ_jNGKCIWs",
            "Controls": "start=228"
        },
        {
            "Text": " so I wasn't eligible for unpaid leave. When I took time off to meet my newborn son, I lost my job.\" These corporate stock photos hide another reality, another layer. Of those who do have access to just that unpaid leave, most women can't afford to take much of it at all.",
            "Title": "How America Fails New...",
            "VideoId": "TdQ1eaZH-J8",
            "Controls": "start=383"
        },
        {
            "Text": " before they're eligible for this trial. So what would happen if we transplanted some of the stool from a healthy donor, that star down at the bottom, into these patients. Would the good microbes do battle with the bad microbes and help to restore their health?",
            "Title": "Rob Knight: How our...",
            "VideoId": "i-icXZ2tMRM",
            "Controls": "start=963"
        },
        {
            "Text": " leading to artistic and scientific advancement. The caliph was wealthy and powerful beyond imagination. But there was never a clear line of succession dictating who would become the next caliph. Any male relative of the former caliph was eligible,",
            "Title": "The rise and fall of the...",
            "VideoId": "rQ0EKiCt6H8",
            "Controls": "start=188"
        },
        {
            "Text": " States know the whole world the whole world the whole world all energy that's it yeah that sounds eligible that sounds cool yeah a Giga factory when it's complete I'll have the largest footprint of any building in the world counting multiple",
            "Title": "Welcome to the...",
            "VideoId": "iZm_NohNm6I",
            "Controls": "start=99"
        },
        {
            "Text": " respecting tradition and prevailing over hardship Tondo has proven himself a man red clay marks his new status he is now eligible for marriage and other rights of adulthood he has earned his place in",
            "Title": "Male Circumcision PIPE...",
            "VideoId": "MkHk-h8GkeE",
            "Controls": "start=276"
        },
        {
            "Text": " this is more than any university to date every refugee who scores a his high school diploma and is proficient in English in English is eligible to apply moreover since we realize that a lot of",
            "Title": "My plan to help refugees...",
            "VideoId": "4gWduR_qccE",
            "Controls": "start=225"
        },
        {
            "Text": " his achievement is their achievement by respecting tradition and prevailing over hardship tondo has proven himself a man red clay marks his new status he is now eligible for marriage and",
            "Title": "Circumcision PIPE National...",
            "VideoId": "Zw-124t993c",
            "Controls": "start=271"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johnny-depp.webp",
            "Text": "I marketed pens - on the phone. But the beauty of the gig was that you had to call these strangers and say, 'Hi, how ya doing?' You made up a name, like, 'Hey, it's Edward Quartermaine from California. You're eligible to receive this grandfather clock or a trip to Tahiti.' You promise them all these things if they buy a gross of pens.",
            "Title": "American Actor",
            "Name": "Johnny Depp"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/douglas-fairbanks.webp",
            "Text": "There is one thing in this good old world that is positively sure - happiness is for all who strive to be happy - and those who laugh are happy. Everybody is eligible - you - me - the other fellow. Happiness is fundamentally a state of mind - not a state of body.",
            "Title": "American Actor",
            "Name": "Douglas Fairbanks"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stacey-abrams.webp",
            "Text": "We must reject the cynicism that says allowing every eligible vote to be cast and counted is a 'power grab.' Americans understand that these are the values our brave men and women in uniform and our veterans risk their lives to defend.",
            "Title": "American Politician",
            "Name": "Stacey Abrams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christie-hefner.webp",
            "Text": "It's so deeply disturbing to me that half of the eligible voters don't vote in this country. We talk about how divided the country is. The truth is, we don't even know. We just know what the half that voted thought.",
            "Title": "American Businesswoman",
            "Name": "Christie Hefner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-will.webp",
            "Text": "A society that thinks the choice between ways of living is just a choice between equally eligible 'lifestyles' turns universities into academic cafeterias offering junk food for the mind.",
            "Title": "Journalist",
            "Name": "George Will"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mac-thornberry.webp",
            "Text": "If you're an adult, if you are eligible to be drafted and vote, then there's a certain amount of decision-making power, and I think we have to be respectful of that.",
            "Title": "American Politician",
            "Name": "Mac Thornberry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josh-rosen.webp",
            "Text": "It's not that some players shouldn't be in school; it's just that universities should help them more - instead of just finding ways to keep them eligible.",
            "Title": "American Athlete",
            "Name": "Josh Rosen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kabir-bedi.webp",
            "Text": "The life of an actor is very hard irrespective of the continent you are in. It is doubly hard when you are only eligible for minority roles.",
            "Title": "Indian Actor",
            "Name": "Kabir Bedi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/suhasini-mulay.webp",
            "Text": "In our country, you need to be married to be eligible for many things, and to have a right on your partner's life.",
            "Title": "Indian Actress",
            "Name": "Suhasini Mulay"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ernest-hemingway.webp",
            "Text": "You can wipe out your opponents. But if you do it unjustly you become eligible for being wiped out yourself.",
            "Title": "American Novelist",
            "Name": "Ernest Hemingway"
        }
    ]
}