{
    "currentWord": {
        "wordRoot": "embark",
        "id": 5751,
        "phonemic": "ɪmˈbɑːk|ɪmˈbɑːrk\r",
        "bigId": "27407351-0262-4dfd-af49-0a67a8dd78a0",
        "wordForms": [
            "embarks",
            "embarking",
            "embarked",
            "embarkation",
            "embark"
        ]
    },
    "senses": [
        {
            "id": "27407351-0262-4dfd-af49-0a67a8dd78a0",
            "de": "To start or begin something",
            "ty": "verb",
            "ex": "She embarked on a new career.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "embark on a journey",
                " embark on a quest",
                " embark on an adventure"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/27407351-0262-4dfd-af49-0a67a8dd78a0.webp",
            "Tips": [
                {
                    "title": "Initiating Action",
                    "description": "Used when someone decides to take the first step in a series or process.",
                    "example": "After years of planning, he's finally ready to embark on his PhD.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/pL53praiEOW6Alft6RsGS43zPv8.webp"
                },
                {
                    "title": "Personal Journeys",
                    "description": "Often used metaphorically to refer to the start of personal endeavors or life changes.",
                    "example": "She's about to embark on motherhood.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xF4FVvloCRXfOoRE8q2oo4TOYs.webp"
                },
                {
                    "title": "Long-term Commitment",
                    "description": "Suggests a commitment to a long and perhaps challenging process.",
                    "example": "They're ready to embark on a three-year research project.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sZliAwUi5e190YVuihFdXtltGvc.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "6e9f7f38-d1d5-4874-81e8-30de46722d8f",
            "de": "To get on a boat or a ship",
            "ty": "verb",
            "ex": "Passengers are requested to embark immediately.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "embark a ship",
                " embark a vessel",
                " embark the boat"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6e9f7f38-d1d5-4874-81e8-30de46722d8f.webp",
            "Tips": [
                {
                    "title": "Physical Movement",
                    "description": "Literally means to enter a vehicle, typically large transport like ships or large boats.",
                    "example": "Tourists will embark the cruise ship at dawn.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Travel Context",
                    "description": "Usually associated with the beginning of a trip or voyage.",
                    "example": "Before we can embark, we must attend the safety briefing.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "1a8988ae-ce83-4a24-9f2f-76b03c87747c",
            "de": "To put or invest money in a business",
            "ty": "verb",
            "ex": "He embarked all his savings in the new business.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "embark money",
                " embark investment",
                " embark savings"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1a8988ae-ce83-4a24-9f2f-76b03c87747c.webp",
            "Tips": [
                {
                    "title": "Investment Focus",
                    "description": "Refers to the act of putting resources, like money or effort, into something.",
                    "example": "They decided to embark substantial funds into the new startup.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Financial Risk",
                    "description": "Implies readiness to take a financial risk or invest with the expectation of a return.",
                    "example": "Investors embark their capital in stocks for higher returns.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Begin": {
            "wordRoot": "Begin",
            "wordDefinition": "Begin usually means to start or commence something, while embark typically means to start a journey or a new project.\n\nFor example, you might begin writing a paper, but you would embark on a road trip. Begin is used more broadly and can refer to starting anything, while embark is usually used in the context of a specific endeavor, such as a new adventure or undertaking.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/29d340d3-cd8a-42f2-992f-a0a0300a927e.webp"
        },
        "Commence": {
            "wordRoot": "Commence",
            "wordDefinition": "Commence means to begin or start something.\n\nCommence describes the start of an event or activity, while embark describes the start of a journey or project.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6b2f51fb-2757-46bb-b591-cb5b6881e06d.webp"
        },
        "Initiate": {
            "wordRoot": "Initiate",
            "wordDefinition": "Embark and initiate both mean to begin or start something, but they are used in different contexts.\n\nInitiate is used when beginning a process or introducing something new. For example, \"The CEO initiated a company-wide policy to reduce plastic waste.\".\n\nEmbark is used when starting something new and exciting, while initiate is used when starting a process or introducing something new.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/415be3d1-dc5a-4cf8-b9ec-cea2a2a8ca1e.webp"
        },
        "Launch": {
            "wordRoot": "Launch",
            "wordDefinition": "Both embark and launch refer to starting or beginning something.\n\nLaunch is typically used in the context of introducing a new product, service, or event to the public. For example, you would say \"We are launching a new smartphone next month\" or \"The company is launching a charity fundraiser this weekend.\".\n\nEmbark describes starting a journey or project, while launch describes introducing something new to the public.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cc811574-088f-4f24-a1da-423fca35be06.webp"
        },
        "Start": {
            "wordRoot": "Start",
            "wordDefinition": "Both words, embark and start, indicate the beginning of something.\n\nHowever, embark usually implies a more significant undertaking or journey, such as embarking on a new career, whereas start can refer to any new beginning, big or small, such as starting a new hobby.\n\nEmbark is used when someone starts a big or important task, while start can be used in any scenario.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ed481109-dc07-4539-a428-fe9ac51ff40f.webp"
        }
    },
    "videos": [
        {
            "Text": " or the hint of an economic downturn. And it needed to happen everywhere; otherwise, every individual government would have this built-in excuse mechanism that they couldn't possibly carry the burden of global action alone. And so this is what we embarked upon. And as we embarked upon this challenge, we asked ourselves,",
            "Title": "What does it mean to be...",
            "VideoId": "ODLg_00f9BE",
            "Controls": "start=421"
        },
        {
            "Text": " SeaWorld San Diego were embarking on a mission to tag swordfish for study when they happened upon a pot of roughly 30 killer whales already engaged in attacking a big blue whale they realized the single singular nature of what they were witnessing and abandoning the original mission stayed with these",
            "Title": "Killer whale society PIPE...",
            "VideoId": "Y0Pd5G2H6CM",
            "Controls": "start=166"
        },
        {
            "Text": " and I also made a few cold calls. The process of engagement I embarked upon helped me to develop a deeper understanding of the problem. It also helped me to avoid the trap people in my profession sometimes fall into when trying to innovate, where we are quick to apply a technology",
            "Title": "You don't have to be an...",
            "VideoId": "OEydHbngSz0",
            "Controls": "start=231"
        },
        {
            "Text": " has embarked on a new flying around the world nonstop in a plane of his own design. Able to travel consistently at the incredible speed of one degree longitude around the equator per minute, the plane would take six hours to circle the world.",
            "Title": "Can you solve the...",
            "VideoId": "dzrwnwOx0fw",
            "Controls": "start=9"
        },
        {
            "Text": " of the nearby stars and of the planets orbiting them, including that actually might be inhabitable by humans. And so I envision that our descendants, hundreds of years from now, will embark on an interstellar journey to other worlds.",
            "Title": "Sara Seager: The search...",
            "VideoId": "k8OgHJ4WXR0",
            "Controls": "start=857"
        },
        {
            "Text": " When I was a child, I always wanted to be a superhero. I wanted to save the world and make everyone happy. But I knew that I'd need superpowers to make my dreams come true. So I used to embark on these imaginary journeys",
            "Title": "The hidden power of...",
            "VideoId": "U9cGdRNMdQQ",
            "Controls": "start=14"
        },
        {
            "Text": " That is what life means, and that is what life is for.\" Mallory's argument that leaving the house, embarking on these grand adventures is joyful and fun, however, doesn't tally that neatly with my own experience.",
            "Title": "Why bother leaving the...",
            "VideoId": "4jBB5iibKy0",
            "Controls": "start=177"
        },
        {
            "Text": " But now I was about to embark on the most creative project that any of us could ever that of rebuilding a life. And even though I had absolutely no idea what I was going to do,",
            "Title": "Janine Shepherd: A...",
            "VideoId": "_ltDJynTduY",
            "Controls": "start=661"
        },
        {
            "Text": " And now we're embarking on that second building the software to help companies identify and remove this content. Let's talk for a minute about these companies.",
            "Title": "How we can eliminate...",
            "VideoId": "uFt-q8HgYpI",
            "Controls": "start=511"
        },
        {
            "Text": " - Before becoming the biggest land predator on the planet, polar bears are born small and helpless. They must then embark on an odyssey,",
            "Title": "The Life of a Baby Polar...",
            "VideoId": "9vgnXRypc4o",
            "Controls": "start=1"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/laura-wasser.webp",
            "Text": "Once you do embark upon the separation or divorce process, it is very important to remember three key things: Be kind, be reasonable, be brief. Remember that this person will no longer be your spouse, but he or she will continue to be your co-parent, family member, and perhaps business partner in certain assets or entities.",
            "Title": "American Lawyer",
            "Name": "Laura Wasser"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tom-rath.webp",
            "Text": "If a school makes an effort to provide kids the right foods and help them to be more active, this benefits the student and the family's health. If you embark on a program to improve your health with a church or community group, you are more likely to stick with it over time.",
            "Title": "American Author",
            "Name": "Tom Rath"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-fenton.webp",
            "Text": "In the writing of poetry we never know anything for sure. We will never know if we have 'trained' or 'practised' enough. We will never be able to say that we have reached grade eight, or that we have left the grades behind and are now embarked on an advanced training.",
            "Title": "British Poet",
            "Name": "James Fenton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-bradshaw.webp",
            "Text": "The spiritual quest is not some added benefit to our life, something you embark on if you have the time and inclination. We are spiritual beings on an earthly journey. Our spirituality makes up our beingness.",
            "Title": "American Philosopher",
            "Name": "John Bradshaw"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/franklin-foer.webp",
            "Text": "Self-publishing is fine. But in a world of self-publishing, where everything is about what you get on the back end, there's a serious disincentive from embarking on really important, vital projects.",
            "Title": "American Writer",
            "Name": "Franklin Foer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-handler.webp",
            "Text": "I can't think of a story that doesn't have something terrible in it. Otherwise, it's dull. So when I embarked into the world of picture books, my first thought was to do something about the dark.",
            "Title": "American Author",
            "Name": "Daniel Handler"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marie-kondo.webp",
            "Text": "Keep only those things that speak to your heart. Then take the plunge and discard all the rest. By doing this, you can reset your life and embark on a new lifestyle.",
            "Title": "Japanese Businesswoman",
            "Name": "Marie Kondo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oleg-cassini.webp",
            "Text": "The best of life is to embark on an adventure with a woman interested in having an adventure with you.",
            "Title": "American Designer",
            "Name": "Oleg Cassini"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-branson.webp",
            "Text": "If you're embarking around the world in a hot-air balloon, don't forget the toilet paper.",
            "Title": "British Businessman",
            "Name": "Richard Branson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/don-delillo.webp",
            "Text": "I embarked on my life - I didn't do anything. I don't have an explanation.",
            "Title": "American Novelist",
            "Name": "Don DeLillo"
        }
    ]
}