{
    "currentWord": {
        "wordRoot": "encourage",
        "id": 6290,
        "phonemic": "ɪnˈkʌrɪdʒ|ɪnˈkɜːrɪdʒ\r",
        "bigId": "17a8143e-892b-4810-ad86-3856d86f8048",
        "wordForms": [
            "encourages",
            "encouraging",
            "encouraged",
            "encouragement",
            "encourage"
        ]
    },
    "senses": [
        {
            "id": "17a8143e-892b-4810-ad86-3856d86f8048",
            "de": "To support or persuade someone to do something",
            "ty": "verb",
            "ex": "My parents always encouraged me to pursue my dreams.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "encourage someone to",
                " encourage growth",
                " encourage creativity"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/17a8143e-892b-4810-ad86-3856d86f8048.webp",
            "Tips": [
                {
                    "title": "Positive Reinforcement",
                    "description": "Using 'encourage' suggests giving someone confidence to continue doing something good.",
                    "example": "Teachers encourage students when they praise their hard work.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/I6RxSjN1WgsELpLwaAclWJ8iw.webp"
                },
                {
                    "title": "Subtle Persuasion",
                    "description": "'Encourage' often means gently pushing someone towards a decision without pressure.",
                    "example": "My coach encouraged me to join the competition.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/mRakVt7VSBWJ4IbhiiByzajtMU.webp"
                },
                {
                    "title": "Emotional Support",
                    "description": "The word can imply emotional backing for personal matters.",
                    "example": "His kind words encouraged me during tough times.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/z1zaUNmuRLuVY8tjsUOXbZKfgus.webp"
                }
            ]
        },
        {
            "id": "722c3b4e-b668-48f0-a3df-72af9a933828",
            "de": "To make something more likely to happen",
            "ty": "verb",
            "ex": "Eating healthy encourages good health.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "encourage development",
                " encourage learning",
                " encourage participation"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/722c3b4e-b668-48f0-a3df-72af9a933828.webp",
            "Tips": [
                {
                    "title": "Likelihood Increase",
                    "description": "'Encourage' can mean to help increase the odds that something will happen.",
                    "example": "Programs that encourage recycling have become widespread.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Growth Enhancement",
                    "description": "Often used in a context where 'encourage' aims to advance development or progress.",
                    "example": "The new policy encourages small business growth.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "7f9d4ee4-ab22-4f2c-97a7-80c079f64c4e",
            "de": "To cheer or inspire in hopes of boosting confidence or morale",
            "ty": "verb",
            "ex": "He encouraged his team in the middle of the game to keep going.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "encourage spirits",
                " encourage efforts",
                " encourage peers"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7f9d4ee4-ab22-4f2c-97a7-80c079f64c4e.webp",
            "Tips": [
                {
                    "title": "Boosting Morale",
                    "description": "It can refer to acts that uplift someone's spirit or drive.",
                    "example": "Fans encouraged the players with their cheers.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Confidence Building",
                    "description": "'Encourage' might be used about instilling confidence in someone's own abilities.",
                    "example": "Her mentor's feedback encouraged her to take on more challenges.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "47348032-5d37-49dc-bc05-a248dc28422d",
            "de": "To advise or urge (someone) to do something",
            "ty": "verb",
            "ex": "She encouraged me to apply for the job.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "encourage action",
                " encourage decision",
                " encourage improvement"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/47348032-5d37-49dc-bc05-a248dc28422d.webp",
            "Tips": [
                {
                    "title": "Soft Guidance",
                    "description": "Using 'encourage' can be a gentle way to guide someone’s actions or decisions.",
                    "example": "The seminar encouraged them to think creatively.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Endorsement",
                    "description": "'Encourage' can signify endorsing or supporting a particular course of action.",
                    "example": "Experts encourage wearing masks in crowded areas.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Action Motivation",
                    "description": "Can express motivating someone to act, especially when they're hesitant.",
                    "example": "She encouraged her friend to speak up about the issue.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Boost": {
            "wordRoot": "Boost",
            "wordDefinition": "Boost means to increase or improve something, such as confidence or energy. It is applicable in situations where someone needs a direct push or motivation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6ad872be-a98c-4ee2-b035-a2bafa3c1718.webp"
        },
        "Embolden": {
            "wordRoot": "Embolden",
            "wordDefinition": "Embolden means to give someone the courage or confidence to do something daring or risky.\n\nEmbolden is used to inspire someone to take action, while encourage is used to provide emotional support or motivation to continue doing something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2ef56a42-9cf6-4f68-96c3-0e38cff1b691.webp"
        },
        "Foster": {
            "wordRoot": "Foster",
            "wordDefinition": "Foster means to nurture, develop or promote something. For example, a family can foster a child who needs a home by providing a safe and loving environment for them to grow.\n\nEncourage is used to give emotional support and motivation, while foster is used in a more practical sense to develop or promote something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c8e49890-dbe7-4df2-9ccc-cd658034bf19.webp"
        },
        "Incite": {
            "wordRoot": "Incite",
            "wordDefinition": "The difference between the words encourage and incite is that encourage means to support, push someone to do something good, or to make them feel confident, while incite means to provoke, urge someone to do something wrong or something that leads to harm.\n\nIf a person incites a group of people to take violent action or cause harm to someone, it means that person is trying to provoke them to do something wrong.\n\nEncourage is a positive word and is used to motivate and inspire people to do good things, while incite is a negative word and often used in situations where someone is trying to provoke or urge others to do something harmful or dangerous.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/895176e7-5dff-4a30-97ee-1e3a78ed1c21.webp"
        },
        "Inspire": {
            "wordRoot": "Inspire",
            "wordDefinition": "Inspire means to stimulate or motivate someone to do something creative, great or extraordinary. It involves an emotional or intellectual push to make someone feel excited, hopeful, and eager to achieve a goal.\n\nFor example, a musician's performance may inspire an aspiring artist to pursue their passion.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2c029d93-bd0a-4a30-9656-5548e2e5e661.webp"
        },
        "Motivate": {
            "wordRoot": "Motivate",
            "wordDefinition": "Motivation means giving someone a reason to do something.\n\nIt is usually used to inspire someone to take action or achieve something. For example, if someone wants to get better grades, you might motivate them by offering them a reward when they achieve their goal.\n\nIn summary, encouragement is used to help someone feel good, while motivation is used to inspire someone to take action.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b7b90314-6dad-440d-9a93-4ea5a1a54b09.webp"
        },
        "Promote": {
            "wordRoot": "Promote",
            "wordDefinition": "Promote means to help something grow or become more popular. For example, if you are trying to start a small business, you can promote it by advertising and spreading the word to potential customers.\n\nEncourage is used to give someone a boost or motivation, while promote is used to increase awareness or popularity of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/507dbcb8-9cba-4257-adae-9e3af57bcfcd.webp"
        },
        "Spur": {
            "wordRoot": "Spur",
            "wordDefinition": "Encourage means to give someone support and confidence to do something, while the word spur means to motivate or inspire someone to take action or move forward.\n\nIf your friend is feeling unmotivated to start studying, you can spur them by reminding them of the benefits of a good grade, or challenging them to start with just a small amount of studying and build from there.\n\nEncourage focuses on building confidence and positivity, while spur focuses on motivating action and progress.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e1888c71-7e9e-45d3-aa8c-9fa73684b65d.webp"
        },
        "Stimulate": {
            "wordRoot": "Stimulate",
            "wordDefinition": "Stimulate means to activate, excite or encourage a response or reaction, like drinking coffee to stimulate alertness.\n\nEncourage is used when referring to motivating and supporting people, while stimulate is used when referring to a physical or mental reaction or enhancement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/585102f2-690b-4536-a66d-e5e4b5b00744.webp"
        },
        "Urge": {
            "wordRoot": "Urge",
            "wordDefinition": "Urge means to strongly suggest or persuade someone to do something.\n\nFor example, \"I urged my friend to go to the doctor because their cough sounded really bad.\"\n\nSo, while both ‘encourage’ and ‘urge’ have the same goal to motivate someone to do something, ‘encourage’ focuses on more emotional support, while ‘urge’ is more intent on pushing someone to make immediate decisions or take specific action.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/14e6d555-004d-4408-86b6-b12889244c16.webp"
        }
    },
    "videos": [
        {
            "Text": " and your sensitivity to pain. So there are a lot of reasons to aim for good posture. But it's getting harder these days. Sitting in an awkward position for a long time can promote poor posture, and so can using computers or mobile devices, which encourage you to look downward.",
            "Title": "The benefits of good...",
            "VideoId": "OyK0oE5rwFY",
            "Controls": "start=79"
        },
        {
            "Text": " So, if you know someone struggling with depression, encourage them, gently, to seek out some of these options. You might even offer to help with specific tasks, like looking up therapists in the area, or making a list of questions to ask a doctor. To someone with depression,",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=179"
        },
        {
            "Text": " It is a way of preserving the reef and dedicating ourselves to something else, They began to prefer transporting tourists because they knew they got paid well and they consumed less fuel. Besides, they were home early and that's what encouraged them to give up the fishing.",
            "Title": "How One Community Saved...",
            "VideoId": "h4HzJSUPlH4",
            "Controls": "start=176"
        },
        {
            "Text": " communication second the name provides a playful link back to the companies underneath g for google c for calico n for nest x and so on third the name encourages wall street investors buy this stock and you're making an alpha bet one that will outperform others",
            "Title": "How to create a great...",
            "VideoId": "rzbXht7MJVM",
            "Controls": "start=282"
        },
        {
            "Text": " By removing one cub at birth and then switching them throughout the day and night, keepers are able to encourage panda mothers to feed both siblings, while being under the impression that they have only one.",
            "Title": "Panda Doesn't Realise...",
            "VideoId": "oSRv6znj-n8",
            "Controls": "start=72"
        },
        {
            "Text": " because diversity is magic. And I encourage you to look past your initial perceptions because I bet you, they're probably wrong. Thank you.",
            "Title": "What does my headscarf...",
            "VideoId": "18zvlz5CxPE",
            "Controls": "start=822"
        },
        {
            "Text": " He needs some gentle encouragement from Giles.",
            "Title": "Tiger Cubs Swimming For...",
            "VideoId": "RPekEt1Kjg8",
            "Controls": "start=112"
        },
        {
            "Text": " towards the edge encouraged by a gentle nudge",
            "Title": "A Collection Of Spring...",
            "VideoId": "T_ECL3fn1Pw",
            "Controls": "start=1487"
        },
        {
            "Text": " he needs some gentle encouragement from",
            "Title": "Adorable Tiger Cub...",
            "VideoId": "s_8NoWpu-Ys",
            "Controls": "start=1034"
        },
        {
            "Text": " encouraged by the absence of the seal",
            "Title": "ONE HOUR Of Amazing...",
            "VideoId": "CSgDjZ_Vv8g",
            "Controls": "start=2551"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "Are we a nation that educates the world's best and brightest in our universities, only to send them home to create businesses in countries that compete against us? Or are we a nation that encourages them to stay and create jobs, businesses, and industries right here in America?",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mark-zuckerberg.webp",
            "Text": "If you look at the history of our country over the last 100 years, there have been periods where science and research have been celebrated. They were really kind of held up as heroes in society, which encouraged a generation of people to go into these fields.",
            "Title": "American Businessman",
            "Name": "Mark Zuckerberg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paulo-coelho.webp",
            "Text": "It took me 40 years to write my first book. When I was a child, I was encouraged to go to school. I was not encouraged to follow the career of a writer because my parents thought that I was going to starve to death.",
            "Title": "Brazilian Novelist",
            "Name": "Paulo Coelho"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-maxwell.webp",
            "Text": "If you are a leader, you should never forget that everyone needs encouragement. And everyone who receives it - young or old, successful or less-than-successful, unknown or famous - is changed by it.",
            "Title": "American Clergyman",
            "Name": "John C. Maxwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zig-ziglar.webp",
            "Text": "When you encourage others, you in the process are encouraged because you're making a commitment and difference in that person's life. Encouragement really does make a difference.",
            "Title": "American Author",
            "Name": "Zig Ziglar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joyce-meyer.webp",
            "Text": "Things in themselves have no life in them. A car can't comfort or encourage you. A house means nothing if there's no life and love inside.",
            "Title": "American Author",
            "Name": "Joyce Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joel-osteen.webp",
            "Text": "I've always been very happy. I've always been easy going and I've always been very encouraging; it's just my personality.",
            "Title": "American Clergyman",
            "Name": "Joel Osteen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/taylor-swift.webp",
            "Text": "Anything that encourages people to pick up an instrument and play, I'm fully behind.",
            "Title": "American Singer",
            "Name": "Taylor Swift"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gordon-b-hinckley.webp",
            "Text": "Encourage your children to read more and watch television less.",
            "Title": "American Clergyman",
            "Name": "Gordon B. Hinckley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lucius-annaeus-seneca.webp",
            "Text": "He who does not prevent a crime when he can, encourages it.",
            "Title": "Roman Statesman",
            "Name": "Lucius Annaeus Seneca"
        }
    ]
}