{
    "currentWord": {
        "wordRoot": "entertainment",
        "id": 5330,
        "phonemic": "ˌentəˈteɪnmənt|ˌentərˈteɪnmənt\r",
        "bigId": "49967719-98f6-4824-9d6a-acec7cb220c4",
        "wordForms": [
            "entertainments",
            "entertainment"
        ]
    },
    "senses": [
        {
            "id": "49967719-98f6-4824-9d6a-acec7cb220c4",
            "de": "Something that is done or happens to make people happy or interested.",
            "ty": "noun",
            "ex": "We enjoyed a weekend of music and entertainment.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "live entertainment",
                "musical entertainment",
                "evening entertainment"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/49967719-98f6-4824-9d6a-acec7cb220c4.webp",
            "Tips": [
                {
                    "title": "Types of Entertainment",
                    "description": "Entertainment can be live shows, movies, games, or activities. It's meant to engage and delight.",
                    "example": "The festival offered various types of entertainment like puppet shows and magic acts.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/AprTDopJpRKqQ7LGhRqFaSL2TME.webp"
                },
                {
                    "title": "Not Always Funny",
                    "description": "Not all entertainment is humorous; some can be thrilling, dramatic, or educational.",
                    "example": "The documentary provided entertainment by making us think differently about nature.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ZsjXRllDufQ6AmmkBMCrzkGN5k.webp"
                },
                {
                    "title": "Cultural Variations",
                    "description": "What's considered entertainment can vary greatly across cultures and personal preferences.",
                    "example": "For some, a chess tournament is great entertainment; for others, it’s a concert.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/D0RTYx1xvtr3sdHAFyNKtXlTbAI.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "ba2fda5b-743f-4f85-83ba-62da80f4d880",
            "de": "The action of providing or being provided with amusement or enjoyment.",
            "ty": "noun",
            "ex": "People who work in the entertainment industry.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "entertainment industry",
                "entertainment center",
                "home entertainment"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ba2fda5b-743f-4f85-83ba-62da80f4d880.webp",
            "Tips": [
                {
                    "title": "Entertainment Industries",
                    "description": "The businesses around creating fun, like movies and music, are part of the entertainment industry.",
                    "example": "He moved to Hollywood to pursue a career in the entertainment industry as an actor.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Passive or Active",
                    "description": "Entertainment can be passive, like watching a movie, or active, like playing a sport.",
                    "example": "They wanted active entertainment, so they played a team-building game.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Technology and Entertainment",
                    "description": "Advancements in tech have expanded entertainment, like video games and virtual reality.",
                    "example": "Virtual reality has added a new dimension to home entertainment options.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Amusement": {
            "wordRoot": "Amusement",
            "wordDefinition": "The main difference between amusement and entertainment is that amusement refers to something that makes you feel amused or laugh, while entertainment refers to something that occupies your time and keeps you engaged or interested.\n\nFor example, going to an amusement park is meant to be amusing because you ride fun roller coasters and eat cotton candy that makes you laugh and feel happy.\n\nAmusement is more about temporary enjoyment while entertainment is more about occupying your time in a pleasant way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2e199087-435d-4930-a9f0-815d50f9491b.webp"
        },
        "Distraction": {
            "wordRoot": "Distraction",
            "wordDefinition": "Distraction means something that takes away your attention from something important, while entertainment means activities or things that you do for fun, enjoyment or relaxation.\n\nDistractions can be harmful because they can prevent you from doing important things like studying, working, or paying attention to what's happening around you.\n\nSo, distractions are mostly unwanted and can have negative consequences, while entertainments are usually chosen and have positive effects.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1e84e0b0-1092-4282-8750-df92df0def38.webp"
        },
        "Diversion": {
            "wordRoot": "Diversion",
            "wordDefinition": "Diversion refers to something that is used to distract or redirect attention away from something else.\n\nIt can be used to help people take a break, relax or deal with stress. Examples of diversions include hobbies, games, and puzzles.\n\nOverall, diversions are used to help people take a break or cope with stressful situations, while entertainment is all about enjoyment and leisure.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d90f0904-5a62-4797-bea1-f26b974bb1fa.webp"
        },
        "Enjoy": {
            "wordRoot": "Enjoy",
            "wordDefinition": "Enjoy refers to the feeling of pleasure and happiness that someone experiences from an activity, object, or experience.\n\nFor example, a person can enjoy eating their favorite food or spending time with their friends.\n\nThese activities are designed to provide enjoyment or entertainment to the participants or spectators.\n\nIn essence, enjoy refers to the personal feeling of pleasure, while entertainment refers to external activities or performances that are designed to create that feeling for others.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d56f83af-003c-4e18-9965-e736997f7df3.webp"
        },
        "Fun": {
            "wordRoot": "Fun",
            "wordDefinition": "Fun describes any activity that is enjoyable, pleasurable or amusing, usually performed with friends and family or in groups.\n\nEntertainment can be both fun and pleasing to watch, while fun activities are typically less formal and less polished. People often seek out entertainment when they want to be entertained or stimulated, while fun is something that people do to have a good time, relax and let off some steam.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/26205a2a-2e80-48fa-bdf2-30712869eb3b.webp"
        },
        "Leisure": {
            "wordRoot": "Leisure",
            "wordDefinition": "Leisure refers to free time that can be spent doing whatever one desires, whether that be playing sports or taking a walk in the park.\n\nEntertainment is something that we seek out to pass our leisure time. We want to be entertained, distracted or amused during our free time.\n\nWhereas leisure is any unoccupied time that one has free to spend in any way that they choose.\n\nEntertainment is a specific activity that is done for fun or enjoyment, while leisure is a broader concept that refers to free time in general.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1daee87e-7620-4204-bc3b-b81ac04252cd.webp"
        },
        "Merriment": {
            "wordRoot": "Merriment",
            "wordDefinition": "Merriment refers to a state of excitement or amusement usually characterized by laughter, happiness and joy; it is the natural response to something funny or enjoyable.\n\nPeople often experience merriment when they are having fun with friends, family, or in a festive setting.\n\nEntertainment is planned and usually involves a performance, while merriment is a natural and spontaneous reaction to something enjoyable.\n\nBoth words can be used in different situations, but entertainment is better suited to describe something that is planned like a movie or concert, while merriment is better suited to describe a happy and festive environment or spontaneous fun with friends.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/540acc8e-56f3-4a1f-b2da-2296e29e348a.webp"
        },
        "Pastime": {
            "wordRoot": "Pastime",
            "wordDefinition": "Pastime, on the other hand, refers to a hobby or leisure activity that someone enjoys doing in their free time. Examples include reading books, playing sports, drawing, or playing an instrument.\n\nPastimes are usually a form of active participation, meaning the person is actively engaged in the activity and is not just a spectator.\n\nEntertainment is something we consume for enjoyment, while a pastime is an activity we participate in for recreation or leisure.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b0255228-e175-4a90-8827-1fcb36473ad1.webp"
        },
        "Pleasure": {
            "wordRoot": "Pleasure",
            "wordDefinition": "Pleasure refers to a feeling of satisfaction or enjoyment that is experienced when we engage in something that we enjoy or find pleasurable.\n\nPleasure can come from a wide range of experiences, including entertainment, but it can also come from other sources like food, nature, or spending time with loved ones.\n\nEntertainment is a form of pleasure, but pleasure can come from many other sources besides entertainment. Entertainment is applicable in situations where we are seeking out a specific form of amusement, while pleasure can be experienced in a wide range of settings and situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2750859c-486a-4dfe-a395-bfe5891baa73.webp"
        }
    },
    "videos": [
        {
            "Text": " And as the student video showed, we can impact and move. She's never going to know a world where video games aren't incredibly emotional and will probably make her cry. I just hope she likes video games. So, my closing thought. Games on the surface seem simple entertainment, but for those that like to look a little deeper,",
            "Title": "David Perry: Will...",
            "VideoId": "mfv_hOFT1S4",
            "Controls": "start=1233"
        },
        {
            "Text": " the brand the amazon in south america is the world's largest river therefore the earth's biggest selection of books clothes content and so on sirius is the brightest star therefore the radio channels where you can hear the brightest stars of music and entertainment and red bull associates to",
            "Title": "How to create a great...",
            "VideoId": "rzbXht7MJVM",
            "Controls": "start=143"
        },
        {
            "Text": " People with disabilities are the largest minority in the world, and we are the most underrepresented in entertainment. The doctors said that I wouldn't walk, but I am here in front of you. However, if I grew up with social media, I don't think I would be. I hope that together,",
            "Title": "I got 99 problems......",
            "VideoId": "buRLc2eWGPQ",
            "Controls": "start=709"
        },
        {
            "Text": " No one has to green-light your idea. And we all now feel some ownership in our own pop culture. And these are not characteristics of old media, and they're barely true of the media of today, but they will define the entertainment of the future. Thank you.",
            "Title": "Why videos go viral PIPE...",
            "VideoId": "BpxVIwCbBK0",
            "Controls": "start=411"
        },
        {
            "Text": " that looks at the backstories of music, and working with the young musicians at the New World Symphony on projects that explore the potential of the new performing arts centers for both entertainment and education. And of course, the New World Symphony",
            "Title": "Michael Tilson Thomas:...",
            "VideoId": "FD5ZKi-moMU",
            "Controls": "start=1111"
        },
        {
            "Text": " In this dystopian world, your resistance group is humanity's last hope. Unfortunately, you've all been captured by the tyrannical rulers and brought to the ancient colosseum for their deadly entertainment. Before you're thrown into the dungeon,",
            "Title": "Can you solve the...",
            "VideoId": "7Vd1dTBVbFg",
            "Controls": "start=8"
        },
        {
            "Text": " And lest you think that the physics of music is only useful for entertainment, consider this. Some physicists think that everything in the universe is created by the harmonic series of very tiny, very tense strings.",
            "Title": "The physics of playing...",
            "VideoId": "w6EGyFAGpXU",
            "Controls": "start=249"
        },
        {
            "Text": " In works that often combine entertainment and social commentary, we are invited to suspend our disbelief and consider the consequences of radical shifts in familiar and deeply engrained institutions. In this sense,",
            "Title": "How science fiction can...",
            "VideoId": "paXKoZ1pr5w",
            "Controls": "start=236"
        },
        {
            "Text": " for free not as a form of entertainment but as the lesson in just how far a handful of sequence and imagination and creativity and a spotlight can take you from the difficult nature of your everyday life",
            "Title": "Emily Ainsworth: Inside...",
            "VideoId": "4TApVPuTSPw",
            "Controls": "start=705"
        },
        {
            "Text": " terrible press Essex is the butt of a hundred jokes it's dismissed as the home of light entertainment and heavy industry my journey into the wilds of Essex starts",
            "Title": "The Other Side of Essex...",
            "VideoId": "J1RaCRCkOu4",
            "Controls": "start=6"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eartha-kitt.webp",
            "Text": "This is where you see the truth of entertainment, because it is not edited. You see it on stage as it is happening. Even if we fall down or forget our words, it's a part of live entertainment.",
            "Title": "American Actress",
            "Name": "Eartha Kitt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ben-carson.webp",
            "Text": "Don't let anyone turn you into a slave. You're a slave if you let the media tell you that sports and entertainment are more important than developing your brain.",
            "Title": "American Scientist",
            "Name": "Ben Carson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jackie-chan.webp",
            "Text": "Besides entertainment and action, I want to educate. You know, as a producer or director, we do have a responsibility to society.",
            "Title": "Chinese Actor",
            "Name": "Jackie Chan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nick-love.webp",
            "Text": "I do show violence as entertainment. Clearly, I'd be a liar if I said I didn't.",
            "Title": "English Director",
            "Name": "Nick Love"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tan-france.webp",
            "Text": "I didn't really care about the entertainment industry. That wasn't my life.",
            "Title": "English Designer",
            "Name": "Tan France"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/justin-gaethje.webp",
            "Text": "I know for a fact entertainment is more important than winning.",
            "Title": "American Athlete",
            "Name": "Justin Gaethje"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/howard-dietz.webp",
            "Text": "The world is a stage, the stage is a world of entertainment.",
            "Title": "American Musician",
            "Name": "Howard Dietz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shigeru-miyamoto.webp",
            "Text": "Providing new means of entertainment is the important thing.",
            "Title": "Japanese Designer",
            "Name": "Shigeru Miyamoto"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jessica-jung.webp",
            "Text": "I never said I was leaving the entertainment industry.",
            "Title": "American Musician",
            "Name": "Jessica Jung"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rza.webp",
            "Text": "I have love for the entertainment side of the world.",
            "Title": "American Musician",
            "Name": "Rza"
        }
    ]
}