{
    "currentWord": {
        "wordRoot": "establish",
        "id": 5546,
        "phonemic": "ɪˈstæblɪʃ|ɪˈstæblɪʃ\r",
        "bigId": "49b0e5d3-7211-4c60-98ff-c034701baeab",
        "wordForms": [
            "establishes",
            "establishing",
            "established",
            "reestablish",
            "establish"
        ]
    },
    "senses": [
        {
            "id": "49b0e5d3-7211-4c60-98ff-c034701baeab",
            "de": "To start or create something like an organization, system, or place.",
            "ty": "verb",
            "ex": "The school was established in 1985.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "establish a company",
                " establish a school",
                " establish a system"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/49b0e5d3-7211-4c60-98ff-c034701baeab.webp",
            "Tips": [
                {
                    "title": "Creation Aspect",
                    "description": "Focus on the initiation aspect when using 'establish' in context to creating entities.",
                    "example": "They sought to establish a new charity for disaster relief.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/A22SHujNZ3tc0vcoKUZ0VRbTps.webp"
                },
                {
                    "title": "Origins Matter",
                    "description": "'Establish' often highlights when and how something started, emphasizing its history.",
                    "example": "The museum was established by private collectors in the 1920s.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Z4Doe8uxZXUKOdIhVDkYKxbUBk8.webp"
                }
            ]
        },
        {
            "id": "0eee4b2a-bd37-43cb-9947-7e04e7bfd2f7",
            "de": "To prove or show something to be true.",
            "ty": "verb",
            "ex": "The police established his presence at the scene of the crime.",
            "use": "",
            "co": "Legal",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "establish the truth",
                " establish a fact",
                " establish innocence"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0eee4b2a-bd37-43cb-9947-7e04e7bfd2f7.webp",
            "Tips": [
                {
                    "title": "Evidence Importance",
                    "description": "Use 'establish' to imply that proof or evidence supports a claim or fact.",
                    "example": "The study established a link between diet and health.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Formal Context",
                    "description": "'Establish' sounds formal and is often used in academic, legal, and professional settings.",
                    "example": "The defense lawyer worked hard to establish his client's alibi.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "74097463-9f43-42a9-abe4-dd8c1c71dddd",
            "de": "To bring about a certain condition or state.",
            "ty": "verb",
            "ex": "The new law establishes certain restrictions on the use of public parks.",
            "use": "",
            "co": "Legal",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "establish conditions",
                " establish laws",
                " establish restrictions"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/74097463-9f43-42a9-abe4-dd8c1c71dddd.webp",
            "Tips": [
                {
                    "title": "Enforceability",
                    "description": "'Establish' conveys the authority behind creating rules or conditions that are to be followed.",
                    "example": "The committee will establish new guidelines for ethical conduct.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Resulting State",
                    "description": "Use 'establish' to show that an action has led to a new state of affairs or situation.",
                    "example": "The treaty established peace between the warring nations.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "54bd15b9-9dcf-47f5-81c5-cb248ff6f0f1",
            "de": "To be accepted or known in a particular way.",
            "ty": "verb",
            "ex": "She established herself as a leading surgeon.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "establish oneself as",
                " establish a name",
                " establish a reputation"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/54bd15b9-9dcf-47f5-81c5-cb248ff6f0f1.webp",
            "Tips": [
                {
                    "title": "Professional Identity",
                    "description": "'Establish' is used to describe how individuals or entities build a reputation or status.",
                    "example": "After years of study, he established himself in the scientific community.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Long-term Effort",
                    "description": "'Establish' implies time and dedication went into achieving a recognized status.",
                    "example": "The brand took decades to establish itself in the market.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "4646e4c3-dfe3-4f8d-ad04-1d900c12e245",
            "de": "To move into a secure position.",
            "ty": "verb",
            "ex": "The company established its headquarters in New York.",
            "use": "",
            "co": "Business",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "establish a presence",
                " establish headquarters"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4646e4c3-dfe3-4f8d-ad04-1d900c12e245.webp",
            "Tips": [
                {
                    "title": "Strategic Positioning",
                    "description": "In a business context, 'establish' often relates to strategic decisions about location or presence.",
                    "example": "They aimed to establish a distribution center in each continent.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Physical Presence",
                    "description": "Emphasize the physical aspect when 'establish' is used for setting up physical spaces.",
                    "example": "The bank established its new branch in the downtown area.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Build": {
            "wordRoot": "Build",
            "wordDefinition": "Build means to construct or create something, such as a building, a structure or a system. For example, \"We are going to build a new house.\".\n\nBoth words are applicable in various contexts, but build is typically used when referring to physical structures or systems, while establish is often used in a broader context, such as setting up new ideas, systems or relationships.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5682ce0e-d3fa-480e-b230-b4c03ae01708.webp"
        },
        "Create": {
            "wordRoot": "Create",
            "wordDefinition": "Create means to bring something new into existence, to make something that did not exist before. For example, an artist creates a painting, a chef creates a dish, or a writer creates a story.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a52e3d83-edb6-4339-90c4-5ea611821445.webp"
        },
        "Found": {
            "wordRoot": "Found",
            "wordDefinition": "The words establish and found both mean to start something or create something new, but they are used in different ways.\n\nFound is often used when talking about starting something completely new, like a company, a school, or a city.\n\nFor example: \"John and Jane founded a new tech startup in their garage.\"\n\nFound is used when you're starting something completely new, and establish is used when you're strengthening or making something official that already exists.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/faa51fe4-4683-4028-8fc2-20a706684301.webp"
        },
        "Initiate": {
            "wordRoot": "Initiate",
            "wordDefinition": "Initiate means to start something or begin a process, like a new project or a plan.\n\nIt is often used when beginning something or introducing something new. For example, you might initiate a new project or initiate a new plan of action.\n\nEstablish is used to refer to creating something long-lasting, while initiate is used to refer to beginning something new or starting a process.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/415be3d1-dc5a-4cf8-b9ec-cea2a2a8ca1e.webp"
        },
        "Install": {
            "wordRoot": "Install",
            "wordDefinition": "Install means to set up or put in place equipment or machinery. For example, someone might install new software on their computer or install a new air conditioning system in their house.\n\nEstablish is typically used when creating a system or organization, while install is typically used when setting up equipment or machinery.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1f6b4004-5496-4e5f-af3e-77015aaed7e1.webp"
        },
        "Plant": {
            "wordRoot": "Plant",
            "wordDefinition": "Plant means to put something into the ground in order for it to grow, such as a seed or a tree. It is also used in the context of placing something in a particular location or setting.\n\nFor example, \"She planted flowers in the garden\" or \"He planted a spy in the enemy's organization.\"\n\nEstablish refers to starting or creating something with the intention of making it permanent or successful, while plant refers to putting something in the ground or a particular location.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4b077d91-5e00-4ab9-be98-211c2ef2fbc7.webp"
        },
        "Set up": {
            "wordRoot": "Set up",
            "wordDefinition": "Set up means to arrange or organize something, often for a specific purpose or event. It is more temporary and can be used in informal situations, such as setting up a party or setting up a temporary office.\n\nEstablish is used for creating something long-lasting, while set up is used for arranging something for a specific purpose or event.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1f2bdafd-d239-4262-a7d6-cebdaf57d93b.webp"
        },
        "Start": {
            "wordRoot": "Start",
            "wordDefinition": "Start means to begin something that hasn't existed before. For example, you start a new job or you start a new hobby.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ed481109-dc07-4539-a428-fe9ac51ff40f.webp"
        }
    },
    "videos": [
        {
            "Text": " with restrictions on certain boats and equipment. Harmful practices, such as bottom trawling, can be banned altogether, and we can establish marine reserves closed to all fishing to help ecosystems restore themselves. There's also a role for consumer awareness and boycotts to reduce wasteful practices, like shark finning,",
            "Title": "Will the ocean ever run...",
            "VideoId": "WNdR808jMSA",
            "Controls": "start=191"
        },
        {
            "Text": " These procedures reestablish circulation to the cardiac muscle, restoring heart function. Heart attack treatment is advancing, but prevention is vital. Genetics and lifestyle factors both affect your risk. And the good news is that you can change your lifestyle. Exercise, a healthy diet, and weight loss",
            "Title": "What happens during a...",
            "VideoId": "3_PYnWVoUzM",
            "Controls": "start=183"
        },
        {
            "Text": " to withstand skepticism. In the case of telekinesis, the idea goes against established science, but lacks the powerful evidence in favor of it. Our universe is controlled and explained by the laws of physics, and one of these laws tells us that brain waves can't control objects",
            "Title": "Is telekinesis real? -...",
            "VideoId": "Jq9D_HkQhAA",
            "Controls": "start=185"
        },
        {
            "Text": " I've got that on lockdown I know my car and I'm gonna go to work every day and I'm gonna check out all these things and once your brain establishes a routine it stops the alertness goes away the fascination with the way the world works I think that's what travel in general",
            "Title": "Life Lessons From a...",
            "VideoId": "zUTL4Op56CM",
            "Controls": "start=126"
        },
        {
            "Text": " so they said hundreds of hours hundreds of thousands of dollars trying to establish this girl's identity trying to figure out who she was where she was from so that they could help her so that they could reunite her with her family men helped make her whole and it worked",
            "Title": "Storytelling can be...",
            "VideoId": "JAxgqRFq1-A",
            "Controls": "start=83"
        },
        {
            "Text": " At its best, prescriptivism is useful for informing people about the most common established patterns at a given point in time. This is important, not only for formal contexts, but it also makes communication easier between non-native speakers from different backgrounds.",
            "Title": "Does grammar matter? -...",
            "VideoId": "Wn_eBrIDUuc",
            "Controls": "start=211"
        },
        {
            "Text": " and establish who is in charge of the group. They even perform actions that seem all too human. But while chimps across the world only have a limited repertoire of vocalizations, they constantly invent and share new gestures with each other.",
            "Title": "How to Speak Chimpanzee...",
            "VideoId": "NBFBbFcixRY",
            "Controls": "start=179"
        },
        {
            "Text": " With his novel, Swift established a blueprint for dystopia, imagining a world where certain trends in contemporary society are taken to extremes, exposing their underlying flaws. And the next few centuries would provide plenty of material.",
            "Title": "How to recognize a...",
            "VideoId": "6a6kbU88wu0",
            "Controls": "start=88"
        },
        {
            "Text": " without paying royalties. Despite changes in character names and minor plot points, the parallels were obvious, and the studio was sued into bankruptcy. To prevent more plagiarism attempts, Stoker's widow decided to establish copyright",
            "Title": "How did Dracula become...",
            "VideoId": "7uiyz3139tE",
            "Controls": "start=235"
        },
        {
            "Text": " Do not use arable land. Because crops are already growing on that land that's very scarce around the world. Number Don't compete with food crops. That's already a well established entity, they don't need another entry.",
            "Title": "Bilal Bomani: Plant...",
            "VideoId": "Kqm9AEvJgxU",
            "Controls": "start=125"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kanye-west.webp",
            "Text": "My goal is just to be respected as a man when I walk down the street with my family. I don't care what your job is, you're not gonna talk down to me, you're not gonna try to get a rise out of me. I'm a man first. And in establishing that, some interesting things have happened.",
            "Title": "American Rapper",
            "Name": "Kanye West"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nelson-mandela.webp",
            "Text": "Our single most important challenge is therefore to help establish a social order in which the freedom of the individual will truly mean the freedom of the individual.",
            "Title": "South African Statesman",
            "Name": "Nelson Mandela"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yayoi-kusama.webp",
            "Text": "I would like to try harder to establish my thought and philosophy strongly and to go back to the universe with my love.",
            "Title": "Japanese Artist",
            "Name": "Yayoi Kusama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-darwin.webp",
            "Text": "To kill an error is as good a service as, and sometimes even better than, the establishing of a new truth or fact.",
            "Title": "English Scientist",
            "Name": "Charles Darwin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bruce-lee.webp",
            "Text": "Man, the living creature, the creating individual, is always more important than any established style or system.",
            "Title": "American Actor",
            "Name": "Bruce Lee"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maria-montessori.webp",
            "Text": "Establishing lasting peace is the work of education; all politics can do is keep us out of war.",
            "Title": "Italian Educator",
            "Name": "Maria Montessori"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-d-rockefeller.webp",
            "Text": "The most important thing for a young man is to establish a credit... a reputation, character.",
            "Title": "American Businessman",
            "Name": "John D. Rockefeller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joseph-joubert.webp",
            "Text": "All are born to observe order, but few are born to establish it.",
            "Title": "French Writer",
            "Name": "Joseph Joubert"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/satyadev-kancharana.webp",
            "Text": "You don't get paid much until you establish yourself in cinema.",
            "Title": "Indian Actor",
            "Name": "Satyadev Kancharana"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/prem-rawat.webp",
            "Text": "I declare that I will establish peace in this world.",
            "Title": "Indian Leader",
            "Name": "Prem Rawat"
        }
    ]
}