{
    "currentWord": {
        "wordRoot": "expect",
        "id": 6009,
        "phonemic": "ɪkˈspekt|ɪkˈspekt\r",
        "bigId": "1bfd0899-956b-40e7-a206-d38e9f9c80ef",
        "wordForms": [
            "expects",
            "expecting",
            "expected",
            "unexpected",
            "expectation",
            "expect"
        ]
    },
    "senses": [
        {
            "id": "1bfd0899-956b-40e7-a206-d38e9f9c80ef",
            "de": "To think that something will probably or certainly happen",
            "ty": "verb",
            "ex": "I expect that she will come to the party",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expect to",
                " expect that",
                " expect the unexpected"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1bfd0899-956b-40e7-a206-d38e9f9c80ef.webp",
            "Tips": [
                {
                    "title": "Certainty Level",
                    "description": "Use 'expect' when you are quite sure about future events, but there is still some uncertainty.",
                    "example": "I expect she'll finish the report by Friday.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/68kGNZYMys45j18LwvnjVf5lSjU.webp"
                },
                {
                    "title": "Predicting Behavior",
                    "description": "'Expect' can convey belief in how people will behave based on past actions.",
                    "example": "Given his punctuality, I expect Tom to be on time.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oenOuvMdMAE8Jm8iznvO1nDYI.webp"
                }
            ]
        },
        {
            "id": "190f49de-12e2-4002-b18d-649ca23dc282",
            "de": "To consider something as likely to happen",
            "ty": "verb",
            "ex": "They expect the weather to be sunny tomorrow",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expect rain",
                " expect sunshine",
                " expect snow"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/190f49de-12e2-4002-b18d-649ca23dc282.webp",
            "Tips": [
                {
                    "title": "Natural Phenomena",
                    "description": "'Expect' is commonly used for weather forecasts and natural events.",
                    "example": "Meteorologists expect the storm to hit the coast tonight.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "7389a96a-3314-4ee3-88ae-a82dfd3c5dfe",
            "de": "To believe that someone should behave in a certain way",
            "ty": "verb",
            "ex": "We expect all students to arrive on time",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expect compliance",
                " expect obedience",
                " expect respect"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7389a96a-3314-4ee3-88ae-a82dfd3c5dfe.webp",
            "Tips": [
                {
                    "title": "Social Expectations",
                    "description": "Use 'expect' to express norms or standards people are supposed to meet.",
                    "example": "Teachers expect students' homework to be submitted on time.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Setting Standards",
                    "description": "'Expect' implies a moral or social standard that one believes should be fulfilled.",
                    "example": "Parents expect honesty from their children.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "bab8155f-e4f7-442b-bb78-37009fedae89",
            "de": "To be pregnant and expecting the birth of a child",
            "ty": "verb",
            "ex": "She's expecting her first child in June",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "expecting a baby",
                " expecting a child",
                " expecting twins"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bab8155f-e4f7-442b-bb78-37009fedae89.webp",
            "Tips": [
                {
                    "title": "Family Planning",
                    "description": "In the context of pregnancy, 'expecting' is a polite, common term.",
                    "example": "They're expecting their second child next spring.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "e1538a90-c787-438c-b269-1caee39d78f7",
            "de": "To be waiting for someone or something",
            "do": "Literary",
            "ty": "verb",
            "ex": "A surprise awaits those who least expect it",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expect a surprise",
                " expect a package",
                " expect a letter"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e1538a90-c787-438c-b269-1caee39d78f7.webp",
            "Tips": [
                {
                    "title": "Anticipatory Surprise",
                    "description": "Literarily, 'expect' can describe awaiting something with a sense of surprise or disbelief.",
                    "example": "He didn't expect such an extravagant gift.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Dramatic Reveal",
                    "description": "Often used in literature or movies to heighten tension before a revelation.",
                    "example": "The audience did not expect the twist at the end of the play.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Anticipate": {
            "wordRoot": "Anticipate",
            "wordDefinition": "Both anticipate and expect refer to looking forward to something, but there is a slight difference in their meanings.\n\nAnticipate is used when you are looking forward to something with excitement or a positive feeling. For example, you may anticipate a fun vacation, a delicious meal or a concert of your favorite band.\n\nAnticipate is used when you're looking forward to something with excitement and positive feelings, while expect is used when you're looking forward to something with certainty, regardless of your emotional response.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/87dd4e90-d368-4d69-878d-45bb40f2d405.webp"
        },
        "Await": {
            "wordRoot": "Await",
            "wordDefinition": "Await means to stay or remain in a place until something happens or someone arrives. For example, if you are waiting for your friend at a coffee shop, you are awaiting their arrival.\n\nAwait is used more for a physical waiting, while expect is used more for a mental anticipation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7679a56b-028c-43f7-9b16-f3c45ce56907.webp"
        },
        "Count on": {
            "wordRoot": "Count on",
            "wordDefinition": "Count on means to rely on something or someone to be there or to do something without fail. For example, \"I can count on my friend to always be there for me.\".\n\nThis word is applicable when you have a strong level of trust or faith in someone or something.\n\nExpect means to anticipate or believe that something will happen or someone will do something. For example, \"I expect my friend to arrive on time.\".\n\nThis word is applicable when you have a certain level of anticipation for a certain outcome, however, it does not imply the same level of certainty or trust as \"count on.\"\n\nIn summary, when you count on something or someone, you have complete and unwavering trust in them. When you expect something or someone, you are simply anticipating a specific outcome, but not necessarily certain it will happen.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fdd31423-4394-4501-9a69-774bcce986e8.webp"
        },
        "Look for": {
            "wordRoot": "Look for",
            "wordDefinition": "Expect means to believe or anticipate that something will happen or is likely to happen. For example, you might say, \"I expect to receive a good grade on my test because I studied hard.\".\n\nLook for means to search or seek something out. For example, you might say, \"I am going to look for my phone because I can't find it.\".\n\nSo, while both words express a level of anticipation, expect is more about a belief or assumption, while look for is more about actively searching for something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a3fc5b43-1e42-4429-9131-163826bfe9bf.webp"
        },
        "Predict": {
            "wordRoot": "Predict",
            "wordDefinition": "Predict means to say or estimate what will happen in the future, based on observations, data or patterns. For example, a weatherman might predict that it will rain based on radar images, wind direction, and other factors that can be observed and measured.\n\nSo, while both words relate to making assumptions about what will happen in the future, expect is grounded in personal experience and intuition, while predict is more scientific and based on data analysis.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8a290aa8-a38f-4aed-b5a5-aaba4a406d2d.webp"
        },
        "Presume": {
            "wordRoot": "Presume",
            "wordDefinition": "Presume means to assume something to be true without having definite proof or evidence. For example, if you presume that someone is lying to you because they are not making eye contact, it means that you assume that they are lying without having any concrete evidence that they are.\n\nExpect is used when we have a reasonable and logical basis for our belief, while presume is used when we are making an assumption without any clear evidence.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6eebc24b-927c-4281-b35c-88723b9670ab.webp"
        },
        "Rely on": {
            "wordRoot": "Rely on",
            "wordDefinition": "Rely on means to have confidence or trust in someone or something to meet one's needs. Example: \"I rely on my alarm clock to wake me up in the morning.\".\n\nIn essence, expect refers to one's own anticipation or belief about something, while rely on refers to the trust placed on someone or something external to oneself.\n\nBoth words are applicable in different contexts, and it's essential to use them correctly to communicate effectively.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/77bccad3-a33f-468d-9fce-806ffb62da97.webp"
        },
        "Require": {
            "wordRoot": "Require",
            "wordDefinition": "Require means something is needed or mandatory for something else to happen or be done.\n\nFor example, if you need to drive a car, you are required to have a driver's license.\n\nExpect implies anticipation, while require connotes necessity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fbc7cac8-a671-467a-867d-38e8536b7768.webp"
        }
    },
    "videos": [
        {
            "Text": " don't have leashes. So our mentor is going to be the leash. We're here and we're kind of here to be brave and courageous and move through the messiness of whatever comes up. We actually expect you to get somewhat triggered here, and that's the whole point of it. And the whole point of why it's so healing,",
            "Title": "Surf Sisters - Ep. 2 PIPE...",
            "VideoId": "F3LS8CQJW4A",
            "Controls": "start=379"
        },
        {
            "Text": " just like asthma or diabetes. It's not a weakness or a personality trait, and they shouldn't expect themselves to just get over it anymore than they could will themselves to get over a broken arm. If you haven't experienced depression yourself, avoid comparing it to times you've felt down.",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=203"
        },
        {
            "Text": " and room pi, where the guests expect free dessert. What self-respecting night manager would ever want to work there even for an infinite salary? But over at Hilbert's Infinite Hotel, where there's never any vacancy and always room for more, the scenarios faced by the ever-diligent",
            "Title": "The Infinite Hotel...",
            "VideoId": "Uj3_KqkI9Zo",
            "Controls": "start=308"
        },
        {
            "Text": " A mouse, for instance, can hardly expect to survive more than a year in the wild. So, it has evolved to grow and reproduce more rapidly, like an evolutionary defense mechanism against its shorter lifespan. Larger animals, by contrast, are better at fending off predators,",
            "Title": "Why do animals have such...",
            "VideoId": "7m8QlSPP7t0",
            "Controls": "start=170"
        },
        {
            "Text": " painful and other times it can be really easy and happen much faster than you expected it but either way it is important and you feel so much better when it's done this explanation for trees are real hit with middle school boys I can tell you that and yes it is",
            "Title": "Poetry makes people...",
            "VideoId": "WHbgZcur7ik",
            "Controls": "start=45"
        },
        {
            "Text": " meeting the writer halfway in the imaginative play of creating a dynamic world of the senses. So when you write, use well-chosen words to engage sound, sight, taste, touch, smell, and movement. Then create unexpected connotations among your story elements,",
            "Title": "How to write descriptivel...",
            "VideoId": "RSoRzTtwgP4",
            "Controls": "start=239"
        },
        {
            "Text": " What if I wore my scarf like this? I can walk down the street in the exact same outfit and what the world expects of me and the way I'm treated depends on the arrangement of this piece of cloth. But this isn't going to be another monologue about the hijab",
            "Title": "What does my headscarf...",
            "VideoId": "18zvlz5CxPE",
            "Controls": "start=36"
        },
        {
            "Text": " Once you've got your characters and story, here are a few quick and easy comedy writing tricks to make them zing. The rule of three, or zig zig zag. Try setting up an expected pattern, zig zig, then flip it, zag.",
            "Title": "How to make your writing...",
            "VideoId": "zNTxSBgDNp4",
            "Controls": "start=219"
        },
        {
            "Text": " expecting anything in return. So you might even risk your life and so it started sort of all sort of flooding in about. how this was an experience of perhaps the whale displaying",
            "Title": "A whale saved my life PIPE...",
            "VideoId": "OXNCCdcBhcY",
            "Controls": "start=313"
        },
        {
            "Text": " know that the natural world is full of the unexpected it's full of surprise",
            "Title": "Filming Lions Hunting...",
            "VideoId": "OK5zPFzRD64",
            "Controls": "start=493"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eartha-kitt.webp",
            "Text": "When the people who are responsible for our country ask you a direct question, I expect them to accept a direct answer, not to be blackballed because you are telling the truth.",
            "Title": "American Actress",
            "Name": "Eartha Kitt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erma-bombeck.webp",
            "Text": "One thing they never tell you about child raising is that for the rest of your life, at the drop of a hat, you are expected to know your child's name and how old he or she is.",
            "Title": "American Journalist",
            "Name": "Erma Bombeck"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rihanna.webp",
            "Text": "People - especially white people - they want me to be a role model just because of the life I lead. The things I say in my songs, they expect it of me.",
            "Title": "American Musician",
            "Name": "Rihanna"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anais-nin.webp",
            "Text": "How wrong it is for a woman to expect the man to build the world she wants, rather than to create it herself.",
            "Title": "American Author",
            "Name": "Anais Nin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/h-l-mencken.webp",
            "Text": "Whenever you hear a man speak of his love for his country, it is a sign that he expects to be paid for it.",
            "Title": "American Writer",
            "Name": "H. L. Mencken"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-hart.webp",
            "Text": "Expect me to continue what I've been doing, which is trying to take over the world.",
            "Title": "American Actor",
            "Name": "Kevin Hart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dolly-parton.webp",
            "Text": "My songs are like my children - I expect them to support me when I'm old.",
            "Title": "American Singer",
            "Name": "Dolly Parton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeff-green.webp",
            "Text": "I was taught to show respect and expect respect given back.",
            "Title": "American Athlete",
            "Name": "Jeff Green"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kristen-stewart.webp",
            "Text": "I never expected that this would be my life.",
            "Title": "American Actress",
            "Name": "Kristen Stewart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elvis-presley.webp",
            "Text": "I never expected to be anybody important.",
            "Title": "American Singer",
            "Name": "Elvis Presley"
        }
    ]
}