{
    "currentWord": {
        "wordRoot": "experience",
        "id": 16197,
        "phonemic": "ɪkˈspɪəriəns|ɪkˈspɪriəns\r",
        "bigId": "e81d6d88-3fbb-4358-a81c-8fcfe99e40d0",
        "wordForms": [
            "experiences",
            "experiencing",
            "experienced",
            "experience"
        ]
    },
    "senses": [
        {
            "id": "e81d6d88-3fbb-4358-a81c-8fcfe99e40d0",
            "de": "The knowledge or skill acquired by a period of practical involvement in an activity.",
            "ty": "noun",
            "ex": "My work experience gave me a lot of confidence.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "work experience",
                " personal experience",
                " life experience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e81d6d88-3fbb-4358-a81c-8fcfe99e40d0.webp",
            "Tips": [
                {
                    "title": "Practical Involvement",
                    "description": "Relates to hands-on activities or direct participation, not just theoretical knowledge.",
                    "example": "Her experience in nursing comes from years of hospital work.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/HHq4yaQg4aQqv3QxLSqFwf3wkNI.webp"
                },
                {
                    "title": "Time-Dependent",
                    "description": "Implies learning that accumulates over a period, not instantly.",
                    "example": "His experience as a teacher developed over two decades.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tqZSFeamIB3ZHegulVqFi32llU.webp"
                },
                {
                    "title": "Personal Growth",
                    "description": "Often used to express how someone improved or matured through activities.",
                    "example": "Living abroad is an experience that can broaden one's perspective.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Jc0dWEhPLPRkSJIOPjgFSNqEfm8.webp"
                }
            ]
        },
        {
            "id": "e8fccd55-9195-468f-97a2-b72fe2ae87b8",
            "de": "An event or occurrence that leaves an impression on someone.",
            "ty": "noun",
            "ex": "It was an interesting experience to work abroad.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "amazing experience",
                " terrible experience",
                " memorable experience"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e8fccd55-9195-468f-97a2-b72fe2ae87b8.webp",
            "Tips": [
                {
                    "title": "Subjective Impact",
                    "description": "Emphasizes personal impact, different for everyone.",
                    "example": "Surviving the earthquake was a harrowing experience for her.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Unique Occurrences",
                    "description": "Highlights one-time events or experiences special to an individual.",
                    "example": "Watching the solar eclipse was a once-in-a-lifetime experience.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Positive",
                    "description": "Can refer to both positive and negative events.",
                    "example": "Getting lost in the city turned out to be a scary experience.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "332b2828-4589-4fee-9301-f7a9a78164fe",
            "de": "To undergo an event or occurrence.",
            "ty": "verb",
            "ex": "We experienced heavy rainfall during our vacation.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "experience difficulties",
                " experience success",
                " experience change"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/332b2828-4589-4fee-9301-f7a9a78164fe.webp",
            "Tips": [
                {
                    "title": "Active Participation",
                    "description": "You are actively going through a situation, not passive.",
                    "example": "She experienced culture shock when she first arrived in Japan.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Present Tense",
                    "description": "Often used in present or perfect tense to show something is currently happening or recently happened.",
                    "example": "They have experienced significant delays due to the storm.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Beyond Sight",
                    "description": "Can relate to any senses, emotions, or thoughts, not just visual.",
                    "example": "During the concert, we experienced a sense of unity.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Acumen": {
            "wordRoot": "Acumen",
            "wordDefinition": "Acumen is a person's natural ability to understand and solve problems or make good decisions. It is something a person is born with or develops through education and training.\n\nAcumen is an inherent ability, while experience is gained through practice and learning. Both are valuable in different situations, and successful individuals often have a combination of both.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bc99e076-8ab8-4575-88ec-0d047b66fe8c.webp"
        },
        "Expertise": {
            "wordRoot": "Expertise",
            "wordDefinition": "Expertise refers to a high level of skill or knowledge in a particular field. It's about having extensive knowledge, training, and proficiency in a specific area.\n\nExpertise is more applicable when someone is looking for a person with in-depth knowledge and specialization in a particular field.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f3d9b129-c7a6-458d-81a8-aca387fc433f.webp"
        },
        "Insight": {
            "wordRoot": "Insight",
            "wordDefinition": "Insight refers to the deep understanding or understanding that one gains from the experience. It is the knowledge or understanding that comes from analyzing or reflecting on an experience.\n\nFor example, if you gain insight from fixing cars, it means you have gained a deeper understanding of how cars work and how to fix them.\n\nExperience is about the actual participation in something, while insight is about the understanding gained from that participation.\n\nExperience is applicable when one wants to learn a skill, while insight is useful when one wants to gain deeper insights or understanding into something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4e43e66e-a7ee-46c4-a2a1-0e14cc1bfb7c.webp"
        },
        "Knowledge": {
            "wordRoot": "Knowledge",
            "wordDefinition": "Knowledge refers to the theoretical understanding or information acquired through study, research or observation.\n\nThey know how to interact with customers and handle food, which is knowledge that they have applied through their experience.\n\nExperience is applied when a person's ability to perform a task is based on hands-on learning from prior events, while knowledge is applied when one's ability to do something is based on theoretical or analytical understanding.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cdf6e4da-87b2-4d62-910e-bab428b2de6d.webp"
        },
        "Mastery": {
            "wordRoot": "Mastery",
            "wordDefinition": "Experience refers to the skills and knowledge you gain through doing something repeatedly. Mastery means having a high level of skill or knowledge in a particular subject or field.\n\nHowever, if you have competed at a professional level and won tournaments, you have mastery in soccer.\n\nExperience is applicable in situations where a basic level of knowledge or skill is sufficient, whereas mastery is necessary when excellence or expertise is required.\n\nIt takes time and practice to gain experience, but mastery requires a higher level of commitment and dedication.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5bf842f7-3c25-4a52-8ced-3475c531327e.webp"
        },
        "Proficiency": {
            "wordRoot": "Proficiency",
            "wordDefinition": "Proficiency refers to a person's ability to do something well. It is a measure of skill and expertise in a particular field.\n\nExperience is gained through practice and exposure to real-life situations, while proficiency is a measure of skill and expertise acquired through practice and knowledge.\n\nBoth terms are applicable in different scenarios; experience is useful when recalling specific situations or knowledge gained through practice while proficiency is more useful when assessing skill level or expertise.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aec6a1e4-469d-4965-9176-0b3f6e236260.webp"
        },
        "Skill": {
            "wordRoot": "Skill",
            "wordDefinition": "Experience is knowledge or skill gained through one's own involvement in or exposure to a task or activity. It is based on personal involvement and exposure to different situations, circumstances or environments.\n\nSkill refers to the proficiency, ability, talent or expertise developed through training, practice, or learning. It is a learned or developed talent or ability necessary to perform a specific task or job.\n\nBoth experience and skill are important in many areas of life, including education, work or sports. Experience helps one understand how to approach problems, work with people, and manage situations.\n\nSkill helps one to efficiently perform tasks and achieve goals. Experience is gained through practice, and skill is learned through training or education.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88113270-491c-4813-9509-5f2b0246c504.webp"
        },
        "Wisdom": {
            "wordRoot": "Wisdom",
            "wordDefinition": "Wisdom is the ability to apply knowledge gained through experience in a thoughtful and wise manner. Wisdom involves understanding the larger picture and making sound judgments based on that understanding.\n\nBoth experience and wisdom are important in different ways. Experience helps us learn and make mistakes, while wisdom helps us make sound decisions based on that experience.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4aec0a02-cd72-4852-8f3a-089974310079.webp"
        }
    },
    "videos": [
        {
            "Text": " are qualitatively different from those based on real experiences. This suggests that creating a false story about a personal topic takes work and results in a different pattern of language use. A technology known as linguistic text analysis has helped to identify four such common patterns",
            "Title": "The language of lying —...",
            "VideoId": "H0-WkpmTPrM",
            "Controls": "start=92"
        },
        {
            "Text": " guilt and remorse for hurting his wife. But the truth is that I have noticed that quite a lot of people who have affairs may feel terribly guilty for hurting their partner, but they don't feel guilty for the experience of the affair itself. And that distinction is important.",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=1017"
        },
        {
            "Text": " It is the hippocampus, strongly associated with emotion, that aids recollection by encoding important experiences into long-term memories. The ability to distinguish this importance makes elephant memory a complex and adaptable faculty beyond rote memorization.",
            "Title": "Why elephants never...",
            "VideoId": "lSXNqsOoURg",
            "Controls": "start=117"
        },
        {
            "Text": " OCD sufferers report feeling crazy for experiencing anxiety based on irrational thoughts and finding it difficult to control their responses. So what exactly causes OCD? The frustrating answer is we don't really know. However, we have some important clues.",
            "Title": "Debunking the myths of...",
            "VideoId": "DhlRgwdDc-E",
            "Controls": "start=160"
        },
        {
            "Text": " are made clear to him. This sort of scenario is considered so characteristic of Kafka's work that scholars came up with a new word for it. Kafkaesque has entered the vernacular to describe unnecessarily complicated and frustrating experiences,",
            "Title": "What makes something...",
            "VideoId": "wkPR4Rcf4ww",
            "Controls": "start=29"
        },
        {
            "Text": " The word bipolar means two extremes. For the many millions experiencing bipolar disorder around the world, life is split between two different realities - elation and depression. Although there are many variations of bipolar disorder,",
            "Title": "What is bipolar...",
            "VideoId": "RrWBhVlD1H8",
            "Controls": "start=6"
        },
        {
            "Text": " avoid comparing it to times you've felt down. Comparing what they're experiencing to normal, temporary feelings of sadness can make them feel guilty for struggling. Even just talking about depression openly can help.",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=217"
        },
        {
            "Text": " white men in a time when that was not popular the courage to even walk in that room with your head held high i don't think many people could do that when i think about my experiences and",
            "Title": "NASA Trailblazer:...",
            "VideoId": "E4j_LpKzcZQ",
            "Controls": "start=109"
        },
        {
            "Text": " expecting anything in return. So you might even risk your life and so it started sort of all sort of flooding in about. how this was an experience of perhaps the whale displaying",
            "Title": "A whale saved my life PIPE...",
            "VideoId": "OXNCCdcBhcY",
            "Controls": "start=313"
        },
        {
            "Text": " right now the world is experiencing what I experienced everyday as a child there",
            "Title": "How to deal with...",
            "VideoId": "v4P2Qwh1QCU",
            "Controls": "start=14"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/franz-kafka.webp",
            "Text": "The experience of life consists of the experience which the spirit has of itself in matter and as matter, in mind and as mind, in emotion, as emotion, etc.",
            "Title": "Novelist",
            "Name": "Franz Kafka"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/t-s-eliot.webp",
            "Text": "It is obvious that we can no more explain a passion to a person who has never experienced it than we can explain light to the blind.",
            "Title": "American Poet",
            "Name": "T. S. Eliot"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joseph-campbell.webp",
            "Text": "I don't believe people are looking for the meaning of life as much as they are looking for the experience of being alive.",
            "Title": "American Author",
            "Name": "Joseph Campbell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/virginia-woolf.webp",
            "Text": "Every secret of a writer's soul, every experience of his life, every quality of his mind is written large in his works.",
            "Title": "British Author",
            "Name": "Virginia Woolf"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-ward-beecher.webp",
            "Text": "The head learns new things, but the heart forever practices old experiences.",
            "Title": "American Clergyman",
            "Name": "Henry Ward Beecher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tyler-perry.webp",
            "Text": "As I experience life and go through things, that's what I write about.",
            "Title": "American Actor",
            "Name": "Tyler Perry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/soren-kierkegaard.webp",
            "Text": "Life is not a problem to be solved, but a reality to be experienced.",
            "Title": "Danish Philosopher",
            "Name": "Soren Kierkegaard"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/voltaire.webp",
            "Text": "Is there anyone so wise as to learn by the experience of others?",
            "Title": "French Writer",
            "Name": "Voltaire"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/w-c-fields.webp",
            "Text": "Sleep - the most beautiful experience in life - except drink.",
            "Title": "American Comedian",
            "Name": "W. C. Fields"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rihanna.webp",
            "Text": "I have such incredible experiences in my life.",
            "Title": "American Musician",
            "Name": "Rihanna"
        }
    ]
}