{
    "currentWord": {
        "wordRoot": "expiry",
        "id": 18885,
        "phonemic": "ɪkˈspaɪəri|ɪkˈspaɪəri\r",
        "bigId": "ed09c673-6dc6-43d2-84c8-2bc1d59f1b85",
        "wordForms": [
            "expiration",
            "expiry"
        ]
    },
    "senses": [
        {
            "id": "ed09c673-6dc6-43d2-84c8-2bc1d59f1b85",
            "de": "The end of a period of time during which something is valid.",
            "ty": "noun",
            "ex": "Expiry of the contract will be in two years.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expiry date",
                " contract expiry",
                " certificate expiry"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ed09c673-6dc6-43d2-84c8-2bc1d59f1b85.webp",
            "Tips": [
                {
                    "title": "Validity Period",
                    "description": "Expiry marks the end of a time when something can be used or is effective.",
                    "example": "Check the expiry on your passport before booking a trip.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/d8CjrAs1OIv9lrMr3814VrPe1o.webp"
                },
                {
                    "title": "Common Usage",
                    "description": "Often used in the context of perishable items like food, medications, or offers.",
                    "example": "The expiry of the discount is at midnight, so we need to hurry!",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/DLPgc4jJwb6ILAvTT3b8ZcrJ4.webp"
                }
            ]
        },
        {
            "id": "d72ca1b2-669f-4d03-bc7f-fc45a53bc43b",
            "de": "The cessation of a right or privilege through neglect to exercise it within some limit of time.",
            "ty": "noun",
            "ex": "After the expiry of the deadline, you would not be able to claim for the loss.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "expiry of rights",
                " expiry of privilege",
                " expiry of claim right"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d72ca1b2-669f-4d03-bc7f-fc45a53bc43b.webp",
            "Tips": [
                {
                    "title": "Legal Rights",
                    "description": "Expiry can indicate when legal or formal rights are no longer valid.",
                    "example": "Upon the expiry of the patent, the invention can be used freely by others.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Time Limits",
                    "description": "Used to talk about the last moment an action can be taken or a claim made.",
                    "example": "Notify us before the expiry of your trial to avoid being charged.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "915b09db-53f1-4990-b101-3aa54b47b9aa",
            "de": "The end of the life or duration of something.",
            "do": "Legal",
            "ty": "noun",
            "ex": "The expiry of a law or rule means it is no longer valid.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "expiry of law",
                " expiry of directive",
                " expiry of ordinance"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/915b09db-53f1-4990-b101-3aa54b47b9aa.webp",
            "Tips": [
                {
                    "title": "Legal Use",
                    "description": "In legal contexts, expiry relates to laws, regulations, or official rules ending.",
                    "example": "The expiry of the temporary tax law will revert rates to previous levels.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Technical Terminology",
                    "description": "Used in technical and legal discussions to describe the end of validity.",
                    "example": "The committee is reviewing the implications of the expiry of the statute.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Cessation": {
            "wordRoot": "Cessation",
            "wordDefinition": "Cessation means \"an end to something.\" It implies the termination of an activity or behavior. For example, when a person quits smoking, it can be said that there has been a cessation of smoking.\n\nExpiry means \"the end of the validity or usefulness of something,\" such as a document or product. It implies the cessation of the legal or effective period of something.\n\nCessation refers to the end of an action or behavior, while expiry refers to the end of the usefulness or validity of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf10895f-a5ed-4c0a-b080-3d3a40caa0a5.webp"
        },
        "Closure": {
            "wordRoot": "Closure",
            "wordDefinition": "Closure refers to the act of officially bringing something to an end or completion.\n\nClosure is about ending something officially, while expiry is about the end of a pre-determined time period.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1cc01bc3-045c-43d6-9033-1fa3a55f519b.webp"
        },
        "Conclusion": {
            "wordRoot": "Conclusion",
            "wordDefinition": "Conclusion refers to the end or result of something that has happened or been discussed.\n\nThe difference between the two words is that conclusion refers to the result of a thought process or discussion, while expiry refers to the end of a period of time or an agreement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3a6c7833-37a6-42dd-a36f-f06699355949.webp"
        },
        "Deadline": {
            "wordRoot": "Deadline",
            "wordDefinition": "Deadline refers to a specific time or date by which something needs to be completed or submitted.\n\nIt is typically used in the context of work, projects, assignments, or applications. For example, a student might have a deadline to submit an essay by the end of the week.\n\nA deadline is a time by which something needs to be done, while expiry is when something is no longer valid or usable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d5525b91-adc0-4b71-8390-0e9fd53a3fa7.webp"
        },
        "End": {
            "wordRoot": "End",
            "wordDefinition": "End refers to the point where something stops, finishes, or comes to a conclusion.\n\nIt can be used in various situations, such as the end of a book, the end of a journey, or the end of a relationship.\n\nTo summarize, end refers to the conclusion of something, while expiry refers to the date when something is no longer usable or valid.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/96e26181-5d90-4e13-86a8-e9cbdde4daff.webp"
        },
        "Finish": {
            "wordRoot": "Finish",
            "wordDefinition": "Expiry and finish are related to the end of a period or process but they are used in different contexts.\n\nExpiry refers to the end of something that has a limited duration or a specific date by which it must be finished. For example, a driver's license or a credit card has an expiry date that marks the end of its validity.\n\nFinish refers to the completion of a task or activity.\n\nFor example, finishing a book or a movie means reaching the end of it, regardless of how long it takes. Finishing a project at school means completing it to the best of your ability.\n\nExpiry refers to the end of a set duration or date, while finish refers to the completion of a task or activity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/52fc860f-c77a-4aef-bd6f-4c6cd2d3f73d.webp"
        },
        "Terminate": {
            "wordRoot": "Terminate",
            "wordDefinition": "Terminate means to end something abruptly or forcefully, usually by one party's decision. For example, if an employee is terminated from their job, it means they have been fired and are no longer employed by that company.\n\nIn simpler terms, expiry means a natural end while terminate means an abrupt end. Expiry is used for things like food, medicine, and contracts while terminate is used for things like employment, contracts, and relationships.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/46511ae9-7ee2-4c5a-89df-e24a07e8cab1.webp"
        }
    },
    "videos": [
        {
            "Text": " you will be typing in your name, the delivery address, your credit card number and the credit card security codes. And here's an example of a file we found from a server a couple of weeks ago. That's the credit card number, that's the expiration date, that's the security code, and that's the name of the owner of the card.",
            "Title": "Mikko Hypponen: Fighting...",
            "VideoId": "cf3zxHuSM2Y",
            "Controls": "start=436"
        },
        {
            "Text": " over heads but we do have like we said a couple of year like eclipses are actually much more common than this way they're just not common where people all right and they're especially not common where people are over and over and over again which is why for many people this really is a once-in-a-lifetime right expiry",
            "Title": "Watch the Total Solar...",
            "VideoId": "oLBwibYSzEk",
            "Controls": "start=1292"
        },
        {
            "Text": " thing that you find was then like your mission for the next ten years well it's that whole thing that we think of expiration so frequently is something that's totally out there and way from people when it turns out some of the most interesting things in the world",
            "Title": "Epic Fails of...",
            "VideoId": "2evdD5Zt2Us",
            "Controls": "start=968"
        },
        {
            "Text": " that's what family dinners are for not just to eat but to practice the finals of question and expiration with people who simply can't fire you there's another cause - silence - and that's all the things that could happen but don't",
            "Title": "The sound of things not...",
            "VideoId": "JqmAl6xf2zY",
            "Controls": "start=291"
        },
        {
            "Text": " lead with your toe let your toes and everything tell you where the obstructions are breaking your ankle out here nobody's gonna be helping you are they there's gonna come a day I don't know what my expiration date is but it's",
            "Title": "Grandma Sue PIPE Life Below...",
            "VideoId": "q8hg45Zsu1s",
            "Controls": "start=73"
        },
        {
            "Text": " and you had gotten a salad spinner instead. You know, it's the beef -- the beef with it is that it comes with an expiration date. Death is the deal breaker. I don't get that. I don't understand -- to me, it's disrespectful.",
            "Title": "How I made friends with...",
            "VideoId": "ARb2UfDgSHQ",
            "Controls": "start=491"
        },
        {
            "Text": " we're actually working later into life, and yet we're feeling less and less relevant. Some of us feel like a carton of milk -- an old carton of milk -- with an expiration date stamped on our wrinkled foreheads.",
            "Title": "What baby boomers can...",
            "VideoId": "7p1nCRQCiUM",
            "Controls": "start=298"
        },
        {
            "Text": " empathy training, as I call it. In the first category of policies to help deal with the loss, the most important policy is regarding time off. It's true that there is no expiration date to grieve",
            "Title": "3 ways companies can...",
            "VideoId": "n5QmIQsw-Lg",
            "Controls": "start=314"
        },
        {
            "Text": " really lists all our childhood problems that we have to expire we actually put an expiry date on all our childhood problems the latest date I put what i said i am going to expire my fear of my",
            "Title": "What's your 200-year...",
            "VideoId": "XAjalGXoLOA",
            "Controls": "start=222"
        },
        {
            "Text": " We actually put an expiry date on all our childhood problems. The latest date I put was, I said, I am going to expire my fear of my leftist, feminist mother-in-law, and this today is the date!",
            "Title": "What's your 200-year...",
            "VideoId": "Qzmt2wQMhYo",
            "Controls": "start=226"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/carmen-carrera.webp",
            "Text": "We cannot let fear and terror dictate how we live our lives, no matter what. Life is a blessing with an expiration date, and we must embrace it while we can.",
            "Title": "American Entertainer",
            "Name": "Carmen Carrera"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/pooja-bedi.webp",
            "Text": "There is no expiry date on love, there is no age by which you stop loving and there is so much of love out there in the world.",
            "Title": "Indian Actress",
            "Name": "Pooja Bedi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gordon-strachan.webp",
            "Text": "I've got more important things to think about. I've got a yogurt to finish by today, the expiry date is today.",
            "Title": "Scottish Athlete",
            "Name": "Gordon Strachan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/douglas-coupland.webp",
            "Text": "In my mind, I've always checked out in 2037; that's always been my expiration date. I'll be 75.",
            "Title": "Canadian Author",
            "Name": "Douglas Coupland"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hasan-minhaj.webp",
            "Text": "Racism has a very quick expiration date when exposed to actual contact with people.",
            "Title": "American Actor",
            "Name": "Hasan Minhaj"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-maxwell.webp",
            "Text": "Ideas have a short shelf life. You must act on them before the expiration date.",
            "Title": "American Clergyman",
            "Name": "John C. Maxwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/noah-baumbach.webp",
            "Text": "Dance is a profession with an expiration date for many people.",
            "Title": "American Writer",
            "Name": "Noah Baumbach"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/natasha-rothwell.webp",
            "Text": "I don't know if there is an expiration date on diversity.",
            "Title": "American Actress",
            "Name": "Natasha Rothwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/devendra-banhart.webp",
            "Text": "Good art doesn't really have an expiration date on it.",
            "Title": "Venezuelan Musician",
            "Name": "Devendra Banhart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lara-fabian.webp",
            "Text": "Believing in love doesn't have an expiration date.",
            "Title": "Canadian Musician",
            "Name": "Lara Fabian"
        }
    ]
}