{
    "currentWord": {
        "wordRoot": "expose",
        "id": 14905,
        "phonemic": "ɪkˈspəʊz|ɪkˈspəʊz\r",
        "bigId": "27c5fd1e-a39f-4361-8253-d92706209381",
        "wordForms": [
            "exposes",
            "exposed",
            "exposing",
            "expose"
        ]
    },
    "senses": [
        {
            "id": "27c5fd1e-a39f-4361-8253-d92706209381",
            "de": "To show something that is usually hidden",
            "ty": "verb",
            "ex": "He exposed his inner thoughts and feelings in his diary.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "expose the truth",
                " expose a secret",
                " expose an affair"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/27c5fd1e-a39f-4361-8253-d92706209381.webp",
            "Tips": [
                {
                    "title": "Hidden Revealed",
                    "description": "Use 'expose' when something concealed is made visible, either literally or figuratively.",
                    "example": "The wind exposed the hidden tattoo on his arm.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xyksctc8DjfZ2mIxy6JxnueXkA.webp"
                },
                {
                    "title": "Metaphorical Use",
                    "description": "'Expose' can describe revealing emotions or thoughts, not just physical objects.",
                    "example": "Her speech exposed deep empathy for the victims.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FOL5iEbNbsuoCJLRmXdxA4RUmN4.webp"
                }
            ]
        },
        {
            "id": "3dd8454b-7b76-46d2-bc98-ea9e667563fc",
            "de": "To put someone in a dangerous situation",
            "ty": "verb",
            "ex": "They were exposed to many risks during their journey.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "expose to danger",
                " expose to harm",
                " expose to risk"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3dd8454b-7b76-46d2-bc98-ea9e667563fc.webp",
            "Tips": [
                {
                    "title": "Implies Negativity",
                    "description": "This use of 'expose' often suggests vulnerability or placing someone in an unfavorable situation.",
                    "example": "Leaving the database unprotected exposed the company to hackers.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Non-Physical Danger",
                    "description": "Exposure can be to non-tangible threats like diseases or financial loss.",
                    "example": "He exposed himself to criticism by making bold claims.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "65b62f6f-5723-4261-a0fe-bacdf79ee60b",
            "de": "To allow light to reach a photographic film to create a picture",
            "do": "Photography",
            "ty": "verb",
            "ex": "You need to expose the film correctly to avoid overexposed or underexposed photos.",
            "use": "",
            "co": "Technical",
            "re": "",
            "tp": "",
            "cl": [
                "expose the film",
                " expose for highlights",
                " overexpose",
                " underexpose"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/65b62f6f-5723-4261-a0fe-bacdf79ee60b.webp",
            "Tips": [
                {
                    "title": "Photography Jargon",
                    "description": "In photography, 'expose' is a technical term related to the amount of light on film or sensor.",
                    "example": "If you expose a photo longer, you'll capture more details in low light.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Creative Effect",
                    "description": "'Expose' can be used creatively in photography to produce various artistic effects.",
                    "example": "She deliberately overexposed the shot to create a dreamy atmosphere.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "6873e260-3049-4ecd-9224-44ad709736e7",
            "de": "To make known, especially something bad or illegal",
            "ty": "verb",
            "ex": "The journalist exposed the corruption of the government.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "expose corruption",
                " expose fraud",
                " expose wrongdoing"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6873e260-3049-4ecd-9224-44ad709736e7.webp",
            "Tips": [
                {
                    "title": "Exposing Wrongdoings",
                    "description": "Use 'expose' to talk about revealing unethical, illegal, or corrupt behaviors.",
                    "example": "The audit exposed the company’s financial manipulations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Journalistic Term",
                    "description": "'Expose' is commonly used in journalism for reporting that uncovers hidden facts.",
                    "example": "The investigative report exposed the politician's lies.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Demonstrate": {
            "wordRoot": "Demonstrate",
            "wordDefinition": "Demonstrate means to show or prove something through evidence or practical means.\n\nIn simpler terms, demonstrate is used to show something in a positive light while expose is used to reveal something negative or hidden.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/72da8e41-218f-476e-ba99-275827fabbcb.webp"
        },
        "Disclose": {
            "wordRoot": "Disclose",
            "wordDefinition": "Disclose usually means to reveal information that was previously kept secret or private. For example, you might disclose your salary to a friend or disclose the details of a private conversation.\n\nSo in short, you would use disclose to share information that was previously kept private, and expose when you're revealing something that was hidden or concealed.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/69f659d9-b860-4d74-8b15-cf413331b2fc.webp"
        },
        "Display": {
            "wordRoot": "Display",
            "wordDefinition": "Display means to show something publicly, often for others to admire or learn from.\n\nIt is usually used in a positive or neutral context, such as displaying artwork in a gallery or displaying products in a store.\n\nTo summarize, display is used to showcase something in a positive or neutral way, while expose is used to uncover something negative or critical.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ab15b671-5ce8-44a8-b67c-2deef94aab89.webp"
        },
        "Divulge": {
            "wordRoot": "Divulge",
            "wordDefinition": "Divulge means to reveal or make known information that was previously kept secret or confidential, usually by choice.\n\nIt is often used when talking about personal or sensitive information. For example, a person might divulge their deepest fears to a close friend.\n\nIt can be used in a wider range of situations than divulge. For example, a journalist might expose corruption in a company or government.\n\nDivulge is used when talking about voluntarily sharing something personal or confidential, while expose is used when talking about revealing something that was hidden or covered up, whether intentionally or not.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f0534237-0287-4c3e-9f33-a508a0ba1380.webp"
        },
        "Manifest": {
            "wordRoot": "Manifest",
            "wordDefinition": "Manifest means to display, to demonstrate or to show something in a clear way. It is applicable in situations where someone wants to make something evident or clear, or to bring something into existence.\n\nExpose means to reveal something that was hidden, while manifest means to display something in a clear way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d8498191-605d-4c22-9a1e-cca7d330fb69.webp"
        },
        "Reveal": {
            "wordRoot": "Reveal",
            "wordDefinition": "Revealing means to make known or disclose information that was previously unknown or kept hidden.\n\nIt can have both negative and positive connotations and is often used in a more general sense, such as revealing a surprise or revealing the truth.\n\nReveal is more commonly used when talking about disclosing something that was kept a secret, like revealing the identity of a surprise party or revealing the results of a scientific experiment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/262fd06f-b8d9-4c47-8bbf-90128f4c731f.webp"
        },
        "Show": {
            "wordRoot": "Show",
            "wordDefinition": "Expose means to reveal something that was previously hidden or unknown while show means to display or present something that is already known.\n\nFor example, if you reveal someone's secret, you expose it. If you display a painting in an art gallery, you show it.\n\nExposure is often used in situations where something was intentionally kept secret, while showing is about presenting information.\n\nIn conclusion, expose is used when revealing something hidden, while show is used when displaying or presenting something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/37a43b42-b043-4bf3-84e5-43d9946c9644.webp"
        },
        "Uncover": {
            "wordRoot": "Uncover",
            "wordDefinition": "Uncover means to reveal something that was previously covered or hidden, often in a more accidental or incidental way, such as uncovering an artifact while digging in the ground or uncovering a secret while investigating a crime.\n\nExpose is used when someone intentionally reveals information or brings something to light, while uncover is used when something is accidentally discovered or revealed through investigation or physical removal of a cover or obstacle.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dec86cab-a760-4020-b9b9-b0b8a4da1da2.webp"
        }
    },
    "videos": [
        {
            "Text": " who showed the same levels of cognitive function and neural processing at the start, found that those who were exposed to a period of music learning showed enhancement in multiple brain areas, compared to the others. This recent research about the mental benefits of playing music has advanced our understanding of mental function,",
            "Title": "How playing an...",
            "VideoId": "R0JKCYZ8hng",
            "Controls": "start=242"
        },
        {
            "Text": " Since blood vessels and nerves in our teeth are enclosed deep within, at this stage, the expanding cavity doesn't hurt. But if the damage extends beyond the dentin, the bacterial invasion progresses causing excruciating pain as the nerves become exposed.",
            "Title": "What causes cavities? -...",
            "VideoId": "zGoBFU1q4g0",
            "Controls": "start=93"
        },
        {
            "Text": " The test starts when urine is applied to the exposed end of the strip. As the fluid travels up the absorbent fibers, it will cross three separate zones, each with an important task. When the wave hits the first zone, the reaction zone,",
            "Title": "How do pregnancy tests...",
            "VideoId": "aOfWTscU8YM",
            "Controls": "start=81"
        },
        {
            "Text": " imagining a world where certain trends in contemporary society are taken to extremes, exposing their underlying flaws. And the next few centuries would provide plenty of material. Industrial technology that promised to free laborers",
            "Title": "How to recognize a...",
            "VideoId": "6a6kbU88wu0",
            "Controls": "start=91"
        },
        {
            "Text": " and potentially even death. Fortunately, acute exposures are rare, but we are exposed daily to lower levels of ionizing radiation from both natural and man-made sources. Scientists have a harder time quantifying these risks.",
            "Title": "Is radiation dangerous?...",
            "VideoId": "zI2vRwFKnHQ",
            "Controls": "start=200"
        },
        {
            "Text": " basically rips open the soil is exposed in part it starts washing away or blowing away that's what we see in very very large parts of Iceland my mission is to support growing more forests and",
            "Title": "Iceland Is Growing New...",
            "VideoId": "pnRNdbqXu1I",
            "Controls": "start=64"
        },
        {
            "Text": " Deep underground lies stores of once inaccessible natural gas. This gas was likely formed over millions of years as layers of decaying organisms were exposed to intense heat and pressure",
            "Title": "How does fracking work?...",
            "VideoId": "Tudal_4x4F0",
            "Controls": "start=6"
        },
        {
            "Text": " without such a dramatic start in life it's unlikely any of them would have even got this far northern australia has the highest tides in the tropics which expose vast areas of shoreline",
            "Title": "ONE HOUR of Amazing...",
            "VideoId": "eEaZvEZye84",
            "Controls": "start=2672"
        },
        {
            "Text": " and make way for an entirely new kind of truth. So when an affair is exposed, what are some of the specific things that couples can do? We know from trauma that healing begins",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=982"
        },
        {
            "Text": " will do with technology will we allow it to expose our humanity showing our true selves and reinforcing the fact that we are indeed our brother's keeper or will",
            "Title": "A funny look at the...",
            "VideoId": "EH8aFWReMnE",
            "Controls": "start=734"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/fede-alvarez.webp",
            "Text": "If you think about it, you can have the best CGI, but you can always tell that it is CGI. Your brain can spot that is not real even though you think it looks cool. Your brain knows the truth, so you don't jump and you don't scream. It was very important for me to expose the audience to real elements.",
            "Title": "Uruguayan Director",
            "Name": "Fede Alvarez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yorgos-lanthimos.webp",
            "Text": "I wouldn't know what to say about something that worked in a perfect way, so I guess, in everything, I try to find what doesn't work and expose it and then see how it relates to people and their stories and their character.",
            "Title": "Greek Director",
            "Name": "Yorgos Lanthimos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tom-hanks.webp",
            "Text": "I went to college because I didn't have anywhere else to go and it was a fabulous hang. And while I was there I was exposed to this world that I didn't know was possible.",
            "Title": "American Actor",
            "Name": "Tom Hanks"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/h-l-mencken.webp",
            "Text": "Nine times out of ten, in the arts as in life, there is actually no truth to be discovered; there is only error to be exposed.",
            "Title": "American Writer",
            "Name": "H. L. Mencken"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/georgina-bloomberg.webp",
            "Text": "My mother grew up around horses and exposed my sister and I to riding early on. It was very important to her.",
            "Title": "American Celebrity",
            "Name": "Georgina Bloomberg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/werner-heisenberg.webp",
            "Text": "What we observe is not nature itself, but nature exposed to our method of questioning.",
            "Title": "German Physicist",
            "Name": "Werner Heisenberg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/diana-gabaldon.webp",
            "Text": "I think it's extremely important that children are exposed to reading.",
            "Title": "American Author",
            "Name": "Diana Gabaldon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/manini-mishra.webp",
            "Text": "Both Mihir and I don't want to expose our life on a public platform.",
            "Title": "Indian Actress",
            "Name": "Manini Mishra"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/margaret-trudeau.webp",
            "Text": "I miss being exposed to the leading thinkers of the world.",
            "Title": "Canadian Author",
            "Name": "Margaret Trudeau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephon-marbury.webp",
            "Text": "Losing exposes character, and winning breeds it.",
            "Title": "American Athlete",
            "Name": "Stephon Marbury"
        }
    ]
}