{
    "currentWord": {
        "wordRoot": "familiar",
        "id": 7767,
        "phonemic": "fəˈmɪliə(r)|fəˈmɪliər\r",
        "bigId": "faade12c-a6dd-4346-b45c-a9a3445795dd",
        "wordForms": [
            "familiars",
            "unfamiliar",
            "familiar"
        ]
    },
    "senses": [
        {
            "id": "faade12c-a6dd-4346-b45c-a9a3445795dd",
            "de": "Known from past experience, or already seen or recognized",
            "ty": "adjective",
            "ex": "Her face looks familiar.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "looks familiar",
                " sounds familiar",
                " feels familiar"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/faade12c-a6dd-4346-b45c-a9a3445795dd.webp",
            "Tips": [
                {
                    "title": "Experience Reinforcement",
                    "description": "Think of 'familiar' to highlight personal experiences when you've encountered something before.",
                    "example": "The streets of my hometown are familiar to me.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/IHVpIrOqGKxCmh8YidGK6JVwYY.webp"
                },
                {
                    "title": "Recognition Cue",
                    "description": "'Familiar' is often used to express a feeling of vague recognition, even if details are forgotten.",
                    "example": "His voice is familiar, but I can't remember his name.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ymZ5qTsxcfc3rmtJNevk8xYiK9o.webp"
                }
            ]
        },
        {
            "id": "bdd0a244-87a4-4681-9b78-f78e1632b1bd",
            "de": "Friendly, like a close friend or family member",
            "ty": "adjective",
            "ex": "He has a familiar manner.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "familiar manner",
                " familiar voice",
                " familiar touch"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bdd0a244-87a4-4681-9b78-f78e1632b1bd.webp",
            "Tips": [
                {
                    "title": "Warm Connection",
                    "description": "Use 'familiar' to describe someone who behaves in a warm, friendly way, like a friend would.",
                    "example": "The teacher’s familiar smile made the new student feel welcome.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Tone",
                    "description": "'Familiar' can convey a sense of comfort and ease in interactions, similar to being with close ones.",
                    "example": "Their familiar banter reminded me of my siblings.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "247f7379-a9a3-47ae-a4c3-e4209d4cfae9",
            "de": "In folklore, a supernatural being that helps and supports a witch or other person",
            "do": "Folklore",
            "ty": "noun",
            "ex": "Every witch has her own familiar.",
            "use": "",
            "co": "Literary",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/247f7379-a9a3-47ae-a4c3-e4209d4cfae9.webp",
            "Tips": [
                {
                    "title": "Literary Device",
                    "description": "In storytelling, 'familiar' might refer to magical companions, adding a mystical element.",
                    "example": "The wizard's familiar was a wise, talking raven.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "27c16371-6539-41bf-8e9d-12dded48a506",
            "de": "Common or usual",
            "ty": "adjective",
            "ex": "It's a familiar sight in this city.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "familiar sight",
                " familiar situation",
                " familiar scenario"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/27c16371-6539-41bf-8e9d-12dded48a506.webp",
            "Tips": [
                {
                    "title": "Everyday Normality",
                    "description": "'Familiar' can suggest something is so common in everyday life that it's no longer noteworthy.",
                    "example": "The familiar aroma of coffee wafts through the café.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Surprising",
                    "description": "Use 'familiar' to indicate that a situation or object doesn't surprise you because of its regularity.",
                    "example": "Rainy days are a familiar scene here in April.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "3cd37364-5b61-4804-a6ad-66afe1f8bbad",
            "de": "Unduly relaxed, showing no respect",
            "ty": "adjective",
            "ex": "His familiar behavior with his boss got him in trouble.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "familiar behavior",
                " familiar attitude",
                " familiar approach"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3cd37364-5b61-4804-a6ad-66afe1f8bbad.webp",
            "Tips": [
                {
                    "title": "Informal Tone",
                    "description": "'Familiar' may suggest someone is being too casual and potentially disrespectful in a serious setting.",
                    "example": "Your familiar remarks are inappropriate in a job interview.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Respect Boundaries",
                    "description": "Being 'familiar' can mistakenly come off as rude if the level of intimacy isn't mutual.",
                    "example": "He acted too familiar with guests he barely knew.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Accustom": {
            "wordRoot": "Accustom",
            "wordDefinition": "Accustom means to become used to something or someone over time, while familiar means to have knowledge or recognition of something or someone.\n\nAccustom is applicable when you are getting used to a new situation or adapting to changes, while familiar is applicable when you are recognizing something that you know well or have seen before.\n\nFor example, you might accustom yourself to living in a new city or familiarize yourself with a particular type of music.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf59e85b-c762-4fa5-8609-551169b6aadc.webp"
        },
        "Acquaint": {
            "wordRoot": "Acquaint",
            "wordDefinition": "Acquaint means to know or be familiar with someone or something, but not very well. For example, if you meet someone new, you would acquaint yourself with them by getting to know their name, where they are from, and what they do.\n\nAcquaint means to know something or someone slightly, while familiar means to know something or someone well.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2ebe21c1-1a70-4e3e-8f2c-ce54c7763a8e.webp"
        },
        "Common": {
            "wordRoot": "Common",
            "wordDefinition": "Common means that something is widespread or exists in a lot of places.\n\nIt describes things we see or experience on a regular basis. For example, \"Going to school is a common experience for teenagers.\".\n\nCommon is used to indicate how often something occurs while familiar is used to indicate our personal experience or awareness of something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/af247a1c-4ca1-4fff-983e-d20bda0907d4.webp"
        },
        "Conversant": {
            "wordRoot": "Conversant",
            "wordDefinition": "Conversant means having knowledge or experience in a particular subject or activity, whereas the word familiar means knowing something or someone well and in a personal way.\n\nFor example, if someone is conversant in French, it means they have a good understanding of the language and can speak it fluently.\n\nConversant describes a level of expertise or knowledge in a specific area. Familiar is more about having personal experience or recognition with something or someone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a2e1482d-7a7c-4a93-9360-46ad9b45b305.webp"
        },
        "Friend": {
            "wordRoot": "Friend",
            "wordDefinition": "Friend refers to someone you have a personal relationship with, and often implies a level of intimacy, trust, and shared interests.\n\nA friend is someone you enjoy spending time with, someone you confide in, and someone who supports you.\n\nIn short, familiarity is simply knowing someone or something, while being a friend involves a deeper level of personal connection and relationship.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9fcd18a0-59fb-43bc-89c4-2c7497fdb79a.webp"
        },
        "Intimate": {
            "wordRoot": "Intimate",
            "wordDefinition": "Intimate refers to a close or personal relationship with someone whom you know well.\n\nFamiliar is a term for knowing something or someone well, whereas intimate describes a relationship that involves a strong emotional bond.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b9c970b5-a1fa-454f-b67c-ceb43614c8d5.webp"
        },
        "Recognize": {
            "wordRoot": "Recognize",
            "wordDefinition": "Recognize means to acknowledge or identify something or someone that you have encountered before. For example, you might recognize a person you went to school with, even if you haven't seen them in years.\n\nFamiliar refers to something or someone you know well or have experience with, while recognize refers to identifying something or someone you have encountered before.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/782e53b6-e1b3-4bc2-bc0f-c2ef081f0db2.webp"
        },
        "Routine": {
            "wordRoot": "Routine",
            "wordDefinition": "Routine refers to a set sequence of actions that is regularly followed. For instance, you have a morning routine where you brush your teeth, have breakfast, and get dressed before heading out to your day.\n\nFamiliar refers to something that is known, while routine refers to a set of actions you follow repeatedly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b4e68cbb-0d92-45e3-aa52-aa75ad0aeee4.webp"
        },
        "Usual": {
            "wordRoot": "Usual",
            "wordDefinition": "Familiar means something that is well-known or easily recognized, while usual means something that is common or expected in a particular situation.\n\nFor example, a person's usual routine may involve waking up at a certain time, having breakfast, going to work or school, and returning home in the evening.\n\nA familiar song is one that a person knows well and can sing along to easily, while a usual meal may be one that is commonly eaten in a particular culture or region.\n\nFamiliar refers to something that is known or recognized, while usual refers to something that is typical or expected in a particular context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c4de0cda-d32a-467d-b356-947e5392f32d.webp"
        }
    },
    "videos": [
        {
            "Text": " Now, doing this is easier said than done. It's very hard to know, by the way, what it is you take for granted. And the reason is that you take it for granted. Let me ask you something you may take for granted. How many of you here are over the age of 25? That's not what you take for granted, I'm sure you're familiar with that.",
            "Title": "Bring on the learning...",
            "VideoId": "r9LelXa3U_I",
            "Controls": "start=426"
        },
        {
            "Text": " Wishing to be represented in the paintings they financed, these merchants preferred middle class subjects depicted in spaces that looked like their own homes surrounded by familiar objects. The maps that appear in Vermeer's paintings, for example, were considered fashionable and worldly",
            "Title": "Why is Vermeer's \"Girl...",
            "VideoId": "pM_IzEAv5d4",
            "Controls": "start=173"
        },
        {
            "Text": " but it was shaken by a power struggle between two noble families spanning generations and involving a massive cast of characters with complex motives and shifting loyalties. If that sounds familiar, it's because the historical conflicts known as the Wars of the Roses",
            "Title": "The wars that inspired...",
            "VideoId": "VjO55pKuBo4",
            "Controls": "start=12"
        },
        {
            "Text": " grandiose and vulnerable narcissism. There's also narcissistic personality disorder, a more extreme form, which we'll return to shortly. Grandiose narcissism is the most familiar kind, characterized by extroversion, dominance, and attention seeking.",
            "Title": "The psychology of...",
            "VideoId": "arJLy3hX1E8",
            "Controls": "start=70"
        },
        {
            "Text": " The journey begins and ends in a hero's ordinary world, but the quest passes through an unfamiliar, special world. Along the way, there are some key events. Think about your favorite book or movie. Does it follow this pattern?",
            "Title": "What makes a hero? -...",
            "VideoId": "Hhk4N9A0oCA",
            "Controls": "start=44"
        },
        {
            "Text": " even if it costs you your friends and family, or stick with comfortable and familiar illusions? Truth or habit? Light or shadow? Hard choices, but if it's any consolation, you're not alone. There are lots of us down here.",
            "Title": "Plato’s Allegory of the...",
            "VideoId": "1RWOpQXTltA",
            "Controls": "start=239"
        },
        {
            "Text": " term I'm very familiar with people are perhaps confused with how to manage and cope with the situation now for I can help when I was in my mid-thirties I had a meeting with my editor and it was my",
            "Title": "How to deal with...",
            "VideoId": "v4P2Qwh1QCU",
            "Controls": "start=51"
        },
        {
            "Text": " purses fly powered by wing of bat and tongue of pig witches bind hexes and black ribbon ready for burial and a human braid curses like these are all too familiar to doctor zabaleta as part",
            "Title": "Mexican Witchcraft PIPE...",
            "VideoId": "6ucyH9_Yf9A",
            "Controls": "start=74"
        },
        {
            "Text": " An unfamiliar chimp call raises the tension. It's an uncertain time. The size of the rival group is as yet unknown.",
            "Title": "Chimpanzee Cannibalism PIPE...",
            "VideoId": "al-f_WWoHI4",
            "Controls": "start=87"
        },
        {
            "Text": " Light, bright, and cheerful. It's some of the most familiar of all early 18th century music.",
            "Title": "Why should you listen to...",
            "VideoId": "Xcpc8VDsv3c",
            "Controls": "start=9"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johnny-depp.webp",
            "Text": "Things go wrong for me all the time with technology. I'm not familiar enough with it, and I'm too old-school a brain to be able to figure it out. I'm dumb. Anything that I have to attack with my thumbs, for any period of time, makes me feel stupid. So, I try to avoid it, as much as possible, to protect my thumbs.",
            "Title": "American Actor",
            "Name": "Johnny Depp"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/graham-potter.webp",
            "Text": "From a football perspective, putting young footballers into art, or singing - you're doing something that's not so familiar. It has helped us build a team and build a spirit.",
            "Title": "English Businessman",
            "Name": "Graham Potter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/esther-dyson.webp",
            "Text": "Part of the problem is when we bring in a new technology we expect it to be perfect in a way that we don't expect the world that we're familiar with to be perfect.",
            "Title": "American Businesswoman",
            "Name": "Esther Dyson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-lowy.webp",
            "Text": "To imagine a better life for yourself and your family and to leave behind all that is familiar requires a special kind of courage.",
            "Title": "Australian Businessman",
            "Name": "Frank Lowy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mike-patton.webp",
            "Text": "There's a danger in anything that is unfamiliar. That's the world we live in.",
            "Title": "American Musician",
            "Name": "Mike Patton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marc-platt.webp",
            "Text": "Watching familiar characters take unexpected turns is very appealing.",
            "Title": "American Producer",
            "Name": "Marc Platt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/annaleigh-ashford.webp",
            "Text": "I love finding ways to make familiar characters into someone unique.",
            "Title": "American Actress",
            "Name": "Annaleigh Ashford"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ednita-nazario.webp",
            "Text": "And, more important, none of Paul's music feels unfamiliar to me.",
            "Title": "American Musician",
            "Name": "Ednita Nazario"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/annalee-newitz.webp",
            "Text": "Technological change is both familiar and easy to observe.",
            "Title": "American Journalist",
            "Name": "Annalee Newitz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michel-de-montaigne.webp",
            "Text": "Few men have been admired of their familiars.",
            "Title": "French Philosopher",
            "Name": "Michel de Montaigne"
        }
    ]
}