{
    "currentWord": {
        "wordRoot": "fold",
        "id": 1028,
        "phonemic": "fəʊld|fəʊld\r",
        "bigId": "59262806-9018-47b2-80aa-9a799045d601",
        "wordForms": [
            "folds",
            "folding",
            "folded",
            "tenfold",
            "threefold",
            "fivefold",
            "fourfold",
            "sixfold",
            "fold"
        ]
    },
    "senses": [
        {
            "id": "59262806-9018-47b2-80aa-9a799045d601",
            "de": "To bend over or double up so that one part covers another.",
            "ty": "verb",
            "ex": "She folded the paper in half.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "fold in half",
                "fold the paper",
                "fold the clothes"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/59262806-9018-47b2-80aa-9a799045d601.webp",
            "Tips": [
                {
                    "title": "Physical action",
                    "description": "Used to describe a physical action, often with hands, to create a crease.",
                    "example": "He folded the map and put it in his pocket.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/SkAFKmtEHwpBqo3ELFKEVCogTMU.webp"
                },
                {
                    "title": "Visible result",
                    "description": "When you fold something, the result is usually visible, like a crease or overlap.",
                    "example": "After folding the napkins, the table looked very tidy.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/WkcNHPHvR4cbjBz1EMTO8TUHqxM.webp"
                },
                {
                    "title": "Methodical order",
                    "description": "Folding is often part of a methodical process, such as in cooking or organizing.",
                    "example": "Please fold these shirts before putting them in the drawer.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/EgimWfAn2gt8GWqg9gb9M1PKI.webp"
                }
            ]
        },
        {
            "id": "d7ebc5c8-dc29-4c8f-925a-5a016b33e106",
            "de": "To fail, especially in business, or to close.",
            "ty": "verb",
            "ex": "Due to financial difficulties, the company had to fold.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "company had to fold",
                " business fold",
                " fold under pressure"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d7ebc5c8-dc29-4c8f-925a-5a016b33e106.webp",
            "Tips": [
                {
                    "title": "Metaphorical sense",
                    "description": "Used metaphorically to mean giving up, especially in competition or business.",
                    "example": "The player folded after playing several high-stake rounds.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Negative connotation",
                    "description": "This sense of fold has a negative connotation, relating to failure or defeat.",
                    "example": "The business eventually folded in the economic recession.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "68dea920-bd2b-432e-aa6b-51294846a5aa",
            "de": "A bend or crease.",
            "ty": "noun",
            "ex": "There are several folds in the fabric.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "folds in fabric",
                " folds in paper",
                " multiple folds"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/68dea920-bd2b-432e-aa6b-51294846a5aa.webp",
            "Tips": [
                {
                    "title": "Visual texture",
                    "description": "A fold in something like fabric or paper creates a visible line or texture.",
                    "example": "The folds in the curtains added a nice decorative touch.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Characteristic feature",
                    "description": "Folds can be a characteristic feature in certain objects, like clothes or geological formations.",
                    "example": "The rocky landscape was marked by folds caused by ancient tectonic movements.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "f00eae3f-0a8b-4f8e-a22e-19fe15500ed9",
            "de": "To include or incorporate.",
            "ty": "verb",
            "ex": "The new plan folds in ideas from various team members.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "fold into mix",
                " fold into plan",
                " fold in ideas"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f00eae3f-0a8b-4f8e-a22e-19fe15500ed9.webp",
            "Tips": [
                {
                    "title": "Inclusion process",
                    "description": "To fold in is to combine, making a mixture or integration of items or ideas.",
                    "example": "You need to fold in the egg whites gently to keep the batter fluffy.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not always physical",
                    "description": "Folding in can refer to non-physical actions, such as adding ideas to a plan.",
                    "example": "The strategy meeting allowed everyone to fold in their suggestions.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "0e9eb0ac-bb64-4c7b-b021-2e0c0bb78ff8",
            "de": "The act or process of folding.",
            "ty": "noun",
            "ex": "She quickly got the hang of the fold.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "make a fold",
                " practice the fold",
                " quick fold"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0e9eb0ac-bb64-4c7b-b021-2e0c0bb78ff8.webp",
            "Tips": [
                {
                    "title": "Action emphasis",
                    "description": "Emphasizes the action of folding, like in origami or packaging.",
                    "example": "The art of paper folding is also known as origami.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "51cae12a-829e-426d-a006-87c82a699950",
            "de": "To give in or admit defeat under pressure.",
            "ty": "verb",
            "ex": "When the opponent raised the stakes, he knew he had to fold.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "fold under pressure",
                " fold the game",
                " quickly fold"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/51cae12a-829e-426d-a006-87c82a699950.webp",
            "Tips": [
                {
                    "title": "Emotional implication",
                    "description": "Folding under pressure implies a loss of courage or breakdown of resilience.",
                    "example": "Despite the tough questioning, the witness refused to fold.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Gambling terminology",
                    "description": "Commonly used in gambling to indicate withdrawing from the game, especially in poker.",
                    "example": "Seeing the high bet, he decided to fold, not willing to risk more money.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Bend": {
            "wordRoot": "Bend",
            "wordDefinition": "Bend refers to when something changes its shape by curving or twisting it, like when you bend a piece of wire into a circle.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/927acdaa-04f9-4d58-82bc-cf29de514c24.webp"
        },
        "Contract": {
            "wordRoot": "Contract",
            "wordDefinition": "Contract refers to making something smaller or tighter. For example, when you squeeze your hand into a fist, you are contracting your muscles.\n\nContract means to make something smaller or tighter, often used in business, while fold means to bend something in half or bring two parts together, often used in everyday situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/16e3c77a-4f67-49c3-9516-58b201dd0037.webp"
        },
        "Crease": {
            "wordRoot": "Crease",
            "wordDefinition": "A crease is a line or mark made on a piece of paper or fabric, usually by folding and pressing it together.\n\nCrease is applicable when you want to create a visible line on a paper or fabric and emphasize that part of the material, while fold is applicable when you want to make the material smaller, more compact or easier to handle.\n\nFor instance, you would fold a letter before putting it into an envelope, but you would crease the edges of a book cover to give it a more polished look.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/16ef0be4-fd15-48b3-a467-ab537acbb6b8.webp"
        },
        "Crumple": {
            "wordRoot": "Crumple",
            "wordDefinition": "Crumple means to crush and twist something into a loose, disordered mass, while fold means to bend one part of something over another part, typically so that it becomes smaller or neater.\n\nYou might crumple a piece of paper to throw it away, whereas you would fold a piece of paper to make it fit into an envelope.\n\nCrumpling is usually done with something soft or flexible, like paper or cloth, while folding is often done with something rigid, like cardboard or metal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0757a689-9508-4c97-8597-aea12b908b7f.webp"
        },
        "Double": {
            "wordRoot": "Double",
            "wordDefinition": "Double means to make something twice its original size or quantity. For example, if you double a recipe, you make two servings instead of one.\n\nIf you double your money, you have twice as much as you did before.\n\nDouble means to make something bigger or increase its quantity, while fold means to make something smaller or take up less space.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3e4d28ea-7f16-40c3-aa21-f571f174a92f.webp"
        },
        "Gather": {
            "wordRoot": "Gather",
            "wordDefinition": "Gather means to bring things or people together to a common point or location. For example, you can gather clothes that are lying around in different places and put them in one basket.\n\nOr a group of friends can gather at a park to have a picnic.\n\nFold means to create a crease in something and make it smaller or neat, while gather means to bring things together to make them easier to manage or to be in one place.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9e0ed609-a4a1-4831-88cf-4a316f42e7c9.webp"
        },
        "Pleat": {
            "wordRoot": "Pleat",
            "wordDefinition": "Both fold and pleat are related to the act of bending something.\n\nHowever, a fold is when you simply bend something in half, whereas a pleat is when you create a smaller fold by folding a larger piece of fabric back on itself.\n\nHowever, if you want to create a pleated skirt, you would fold the fabric back and forth to create smaller folds.\n\nIn general, folds are used for simpler, more straightforward bends, while pleats are used to create decorative designs in clothing or to add some structure to a garment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f00a3995-5d5e-4d74-9129-ce505fb779f7.webp"
        },
        "Tuck": {
            "wordRoot": "Tuck",
            "wordDefinition": "Tuck means to put something into a small space or to secure something by placing a part of it inside something else.\n\nIt is applicable to things like clothes and sheets, but it is also used for more specific actions like 'tucking in' a shirt or a blanket.\n\nFor example, you might tuck in your shirt or you might tuck your sheets under your mattress at night.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bdb3f28b-9664-4438-a958-8e81f4c88291.webp"
        },
        "Wrap": {
            "wordRoot": "Wrap",
            "wordDefinition": "Wrap is an action to cover something completely by encasing it, such as paper or fabric.\n\nIn simpler terms, when you fold something, you make it smaller or neater by bending it, while wrapping is completely covering something as it is.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/73a6f92b-8971-4023-a761-a0f9f6ceb212.webp"
        }
    },
    "videos": [
        {
            "Text": " helps to determine the direction of the smell's source so that within the first few moments of sniffing, the dog starts to become aware of not just what kind of things are out there but also where they're located. As air enters the nose, a small fold of tissue divides it into two separate folds,",
            "Title": "How do dogs \"see\" with...",
            "VideoId": "p7fXa2Occ_U",
            "Controls": "start=37"
        },
        {
            "Text": " One with eight petals is part of the fourfold category, and so on. There's another secret ingredient in these an underlying grid. Invisible, but essential to every pattern, the grid helps determine the scale of the composition before work begins, keeps the pattern accurate,",
            "Title": "The complex geometry of...",
            "VideoId": "pg1NpMmPv48",
            "Controls": "start=121"
        },
        {
            "Text": " and allow yourself to make mistakes and adjustments. This prototype lets you see how your preliminary sketches will come to life. You will want to first draw all individual parts on a single sheet, including all your main pieces, all the supporting pieces and the folds.",
            "Title": "Making a TED-Ed Lesson:...",
            "VideoId": "RZR_b753ZJ0",
            "Controls": "start=109"
        },
        {
            "Text": " And here are the low-power poses. So you're folding up, you're making yourself small. This one is very low-power. When you're touching your neck, you're really protecting yourself. So this is what happens. They come in, they spit into a vial,",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=653"
        },
        {
            "Text": " so scientists attach a plastic bead to one end that adds extra stress and encourages it to fold up first. This unboiling method won't work with a whole egg in its shell since the solution has to spread throughout a cylindrical chamber.",
            "Title": "How to unboil an egg -...",
            "VideoId": "CHMY4G9gTPA",
            "Controls": "start=145"
        },
        {
            "Text": " was stupid enough to allow the conference to fly me in coach and I had to go back now and fold myself into this tiny seat for 14 hours and I said I'm sure you weren't that stupid I'm sure you forced you force them to fly your",
            "Title": "If I don’t ask, I don’t...",
            "VideoId": "hNk4KgMyzLU",
            "Controls": "start=120"
        },
        {
            "Text": " Before you move on, I encourage you to actually think about a possible answer to this question. After we have folded the paper once, it is now two thousandths of a centimeter in thickness. If we fold it in half once again,",
            "Title": "Exponential Growth: How...",
            "VideoId": "AmFMJC45f1Q",
            "Controls": "start=65"
        },
        {
            "Text": " faithful both of these holidays had to do with the afterlife and about survival after death it was a calculated move on the part of the church to bring more people into the fold All Saints Day was",
            "Title": "Halloween History PIPE...",
            "VideoId": "R-VRAemIvbI",
            "Controls": "start=82"
        },
        {
            "Text": " this sealed nest is the safest place these leaf folding frogs can find to protect their precious brood at the first floral beacons of spring",
            "Title": "Best Of Frogs PIPE Top 5 PIPE...",
            "VideoId": "1dETo64bvJA",
            "Controls": "start=425"
        },
        {
            "Text": " Dry. Shake. Fold. Cuts itself. Fold. The fold is important",
            "Title": "Joe Smith: How to use a...",
            "VideoId": "SciUx65Q94U",
            "Controls": "start=132"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-madden.webp",
            "Text": "When the going gets tough, I'm not always sure what you do. I'm not saying that I know how to fix everything when the going gets tough, but I do know this: when the going goes tough, you don't quit. And you don't fold up. And you don't go in the other direction.",
            "Title": "American Entertainer",
            "Name": "John Madden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benito-mussolini.webp",
            "Text": "It is humiliating to remain with our hands folded while others write history. It matters little who wins. To make a people great it is necessary to send them to battle even if you have to kick them in the pants. That is what I shall do.",
            "Title": "Italian Politician",
            "Name": "Benito Mussolini"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hugh-hefner.webp",
            "Text": "Playboy' was not a sex magazine as far as I was concerned. Sex was simply part of the total package; I was trying to bring sex into the fold of a healthy lifestyle.",
            "Title": "American Publisher",
            "Name": "Hugh Hefner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cher.webp",
            "Text": "I don't need a man. But I'm happier with one. I like to have someone I can touch and squeeze and kiss. But I don't fold up and die if I don't have a man around.",
            "Title": "American Musician",
            "Name": "Cher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/abraham-lincoln.webp",
            "Text": "Standing as I do, with my hand upon this staff, and under the folds of the American flag, I ask you to stand by me so long as I stand by it.",
            "Title": "American President",
            "Name": "Abraham Lincoln"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/chris-farley.webp",
            "Text": "I seem to get motivated a few months at a time, and then something stressful breaks the routine, and I just fold.",
            "Title": "American Comedian",
            "Name": "Chris Farley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kenny-rogers.webp",
            "Text": "Know when to hold 'um, know when to fold 'um and know when to walk away from cameramen.",
            "Title": "American Musician",
            "Name": "Kenny Rogers"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lindsey-buckingham.webp",
            "Text": "The want to return to the fold doesn't mean you can repeat history.",
            "Title": "American Musician",
            "Name": "Lindsey Buckingham"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shirley-chisholm.webp",
            "Text": "If they don't give you a seat at the table, bring a folding chair.",
            "Title": "American Politician",
            "Name": "Shirley Chisholm"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oliver-wendell-holmes-sr.webp",
            "Text": "But friendship is the breathing rose, with sweets in every fold.",
            "Title": "American Writer",
            "Name": "Oliver Wendell Holmes, Sr."
        }
    ]
}