{
    "currentWord": {
        "wordRoot": "forget",
        "id": 9864,
        "phonemic": "fəˈɡet|fərˈɡet\r",
        "bigId": "47db8401-e9bf-431e-a65b-d6b530b86cda",
        "wordForms": [
            "forgets",
            "forgetting",
            "forgot",
            "forgotten",
            "forgettable",
            "unforgettable",
            "forget"
        ]
    },
    "senses": [
        {
            "id": "47db8401-e9bf-431e-a65b-d6b530b86cda",
            "de": "not to remember something",
            "ty": "verb",
            "ex": "I forgot where I placed my keys.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "forgot to do something",
                " quickly forget",
                " easily forget"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/47db8401-e9bf-431e-a65b-d6b530b86cda.webp",
            "Tips": [
                {
                    "title": "Temporary Forgetfulness",
                    "description": "Used to express that something slipped one's mind temporarily but can be remembered later.",
                    "example": "I forgot her name, but then it came back to me.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/zhc9gLe97NQ2gSZqm3JKcclyHy4.webp"
                },
                {
                    "title": "Intentional Reminder",
                    "description": "Often used in a polite request to remind someone of something they might have forgotten.",
                    "example": "Don't forget to call me when you arrive.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/pAHvxeiU583efl8nEzmXrlBjW5s.webp"
                },
                {
                    "title": "Emotional Impact",
                    "description": "Forgetting something important can imply carelessness and hurt feelings.",
                    "example": "He forgot our anniversary, and I was really upset.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/D2t5S7BUHnWq6H42QJwm9ZGFIo.webp"
                }
            ]
        },
        {
            "id": "d6b54e3d-8d22-49e1-aa40-27b8708f226e",
            "de": "not to consider or pay attention to",
            "ty": "verb",
            "ex": "We should not forget the sacrifices of our ancestors.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "never forget",
                " forget about it",
                " forget yourself"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d6b54e3d-8d22-49e1-aa40-27b8708f226e.webp",
            "Tips": [
                {
                    "title": "Conscious Ignoring",
                    "description": "Sometimes it means choosing not to think about something on purpose.",
                    "example": "Forget the haters; just do your best.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Momentary Inattention",
                    "description": "Can be used when someone momentarily fails to pay attention or consider something.",
                    "example": "Sorry, I forgot you were vegetarian when I ordered the pizza.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "e4adaecd-703e-4e31-a980-b7a3f03acd12",
            "de": "not to mention or include someone or something by accident",
            "ty": "verb",
            "ex": "She forgot to add sugar in the cake.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "forgot to say",
                " forget about it",
                " forgot to include"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e4adaecd-703e-4e31-a980-b7a3f03acd12.webp",
            "Tips": [
                {
                    "title": "Accidental Exclusion",
                    "description": "Indicates unintentionally leaving someone or something out.",
                    "example": "I forgot to invite Lucy to the meeting; I'll call her now.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Task-Related Slip",
                    "description": "Often used when a detail is missed in the process of doing something.",
                    "example": "I forgot to attach the file, sending it again.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0ae69e30-5749-4ea0-a236-a4273487e9db",
            "de": "to stop thinking about someone or something",
            "ty": "verb",
            "ex": "It's hard for me to forget him even after so many years.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "forget him",
                " forget about it",
                " put it out of your mind"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0ae69e30-5749-4ea0-a236-a4273487e9db.webp",
            "Tips": [
                {
                    "title": "Moving On",
                    "description": "Used to talk about letting go of past events or people.",
                    "example": "I know it's tough, but you need to forget her and move on.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Intentional Avoidance",
                    "description": "Can imply choosing not to dwell on something unpleasant or unworthy.",
                    "example": "Forget those bad reviews; focus on the positive feedback.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Disregard": {
            "wordRoot": "Disregard",
            "wordDefinition": "Disregard means to not pay attention to something or to intentionally ignore it. It is applicable when someone intentionally chooses to ignore or avoid a certain thing.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/69a498af-6896-4901-9f6a-8cb04f4a2a40.webp"
        },
        "Fail": {
            "wordRoot": "Fail",
            "wordDefinition": "Fail means to be unsuccessful in achieving a goal, and it is applicable when you have tried to do something but could not succeed.\n\nFor example, if you fail a test, it means that you did not get the required marks.\n\nFail is used when you do not succeed in achieving a goal, and forget is used when you do not remember something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6f9337a7-4780-4c69-b867-f169606c46ab.webp"
        },
        "Ignore": {
            "wordRoot": "Ignore",
            "wordDefinition": "Ignore means to actively choose not to pay attention to someone or something, often intentionally disregarding something.\n\nFor example, if someone is being mean to you in school and you choose to ignore them, you are making a conscious decision not to engage with them.\n\nBoth words are applicable in different situations. Forgetting is usually unintentional and can happen to anyone. Ignoring is a deliberate action and can be used as a coping mechanism or a way to show disapproval or lack of interest.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b67ff0f4-6752-4586-90b2-8d2ea28ef2af.webp"
        },
        "Miss": {
            "wordRoot": "Miss",
            "wordDefinition": "Miss means that you feel sad or upset because someone or something is not present. For example, if you miss your friend, you are sad because they are not with you, even though you remember them and their importance to you.\n\nForget is related to memory and miss is related to feelings of loss or absence. Each one is applicable in different situations based on the context of the event.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f88a88bc-2f8e-4507-8e4f-17ee6f9bc65b.webp"
        },
        "Neglect": {
            "wordRoot": "Neglect",
            "wordDefinition": "Neglect means to fail to take care of something or someone properly. For example, if you neglect your plants by not watering them and giving them sunlight, they will die.\n\nForget is related to memory or unintentionally leaving something behind while neglect relates to not taking proper care of something or someone on purpose.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/01767325-0750-45ac-884b-339c782f6033.webp"
        },
        "Omit": {
            "wordRoot": "Omit",
            "wordDefinition": "Forget means to fail to remember something or someone that one ought to remember, while Omit means to leave out or exclude something or someone.\n\nIf you omit a book from a list of required reading, it means that you have left that book out of the list intentionally.\n\nForget refers more to a lapse of memory while omit refers to a deliberate action of leaving something out.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/22951bc0-045d-4185-8d2f-32b2c61dbaac.webp"
        },
        "Overlook": {
            "wordRoot": "Overlook",
            "wordDefinition": "Forget means to fail to remember something or someone, while overlook means to miss seeing or noticing something.\n\nHowever, if you overlook a typo in a report, it means you missed it by mistake.\n\nForget is applicable when you didn't recall something at all, while overlook is applicable when you missed something by chance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/13cf3af2-d060-4ede-9dbf-5d449c30209d.webp"
        },
        "Slip": {
            "wordRoot": "Slip",
            "wordDefinition": "Slip means to make an error or mistake or to lose one's balance or footing. It's applicable when you make a small mistake or accidentally say something incorrectly.\n\nFor example, you might slip and call your teacher \"mom\" by mistake.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ff8dacd4-d655-48a3-bf26-07a55d17f687.webp"
        }
    },
    "videos": [
        {
            "Text": " a phenomenon known as the forgetting curve. But this loss can be prevented through memory consolidation, the process by which information is moved from our fleeting short-term memory to our more durable long-term memory. This consolidation occurs with the help of a major part of the brain, known as the hippocampus.",
            "Title": "The benefits of a good...",
            "VideoId": "gedoSfZvBgE",
            "Controls": "start=101"
        },
        {
            "Text": " So when we think of nonverbals, we think of how we judge others, how they judge us and what the outcomes are. We tend to forget, though, the other audience that's influenced by our nonverbals, and that's ourselves. We are also influenced by our nonverbals, our thoughts and our feelings and our physiology.",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=202"
        },
        {
            "Text": " He needs to become, for a while, the protector of the boundaries. It's his responsibility to bring it up, because if he thinks about it, he can relieve Heather from the obsession, and from having to make sure that the affair isn't forgotten, and that in itself begins to restore trust.",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=1039"
        },
        {
            "Text": " and enhancing your memory. This might explain why people never forget their first kiss. The idea of so much of our attraction being influenced by chemicals and evolutionary biology may seem cold and scientific rather than romantic, but the next time you see someone you like,",
            "Title": "The science of...",
            "VideoId": "169N81xAffQ",
            "Controls": "start=233"
        },
        {
            "Text": " or at least they did until we forgot their original purpose. For example, theater scenery used to consist of large painted backdrops, raised and lowered by stagehands who would whistle to signal each other. Absentminded whistles from other people could cause an accident.",
            "Title": "Where do superstitions...",
            "VideoId": "quOdF1CAPXs",
            "Controls": "start=171"
        },
        {
            "Text": " Let's forget about finger sections for a moment and look at the simplest case of having just two options per finger, up and down. This won't allow us to represent powers of ten, but it's perfect for the counting system that uses powers of two, otherwise known as binary.",
            "Title": "How high can you count...",
            "VideoId": "UixU1oRW64Q",
            "Controls": "start=123"
        },
        {
            "Text": " to think, to feel, to be so absorbed that for a while we forget where we are. So, how about writing fiction? How do you suck your readers into your stories? With an exciting plot? Maybe. Fascinating characters? Probably.",
            "Title": "How to write descriptivel...",
            "VideoId": "RSoRzTtwgP4",
            "Controls": "start=19"
        },
        {
            "Text": " being handled you can't forget that they live out there this is their world and you're going up into it to try to manipulate their movement I'm very fond full you're going to get beat every time",
            "Title": "Chase a Wild Buffalo...",
            "VideoId": "85_nJwYqE_c",
            "Controls": "start=360"
        },
        {
            "Text": " forgotten as long as the Cubs call their mother is compelled to keep retrieving them but this would try any mother's patience the young Cubs life is very precarious had the mother been away",
            "Title": "5 Amazing Animal...",
            "VideoId": "uIKJgxbhAzM",
            "Controls": "start=580"
        },
        {
            "Text": " much to my character as from a very early age I love challenges by practicing daily chess chess became as my native language I never forget when I was just seven years old and I was",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=91"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luka-modric.webp",
            "Text": "The war made me stronger; it was a very hard time for me and my family. I don't want to drag that with me forever, but I don't want to forget about it, either.",
            "Title": "Croatian Athlete",
            "Name": "Luka Modric"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/harry-s-truman.webp",
            "Text": "All my life, whenever it comes time to make a decision, I make it and forget about it.",
            "Title": "American President",
            "Name": "Harry S Truman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alexander-pope.webp",
            "Text": "How happy is the blameless vestal's lot? The world forgetting, by the world forgot.",
            "Title": "English Poet",
            "Name": "Alexander Pope"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mother-teresa.webp",
            "Text": "If we have no peace, it is because we have forgotten that we belong to each other.",
            "Title": "Albanian Saint",
            "Name": "Mother Teresa"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bad-bunny.webp",
            "Text": "I think it's important as an artist to never forget where you're from.",
            "Title": "Puerto Rican Singer",
            "Name": "Bad Bunny"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brady-jandreau.webp",
            "Text": "My part of the world - it's like time forgot it almost.",
            "Title": "American Actor",
            "Name": "Brady Jandreau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alvin-dark.webp",
            "Text": "Friendships are forgotten when the game begins.",
            "Title": "American Athlete",
            "Name": "Alvin Dark"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/evita-peron.webp",
            "Text": "My biggest fear in life is to be forgotten.",
            "Title": "Argentinian Statesman",
            "Name": "Evita Peron"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-paul.webp",
            "Text": "Live your life and forget your age.",
            "Title": "German Author",
            "Name": "Jean Paul"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maryam-dabo.webp",
            "Text": "Life is good - we forget that.",
            "Title": "English Actress",
            "Name": "Maryam D'Abo"
        }
    ]
}