{
    "currentWord": {
        "wordRoot": "garment",
        "id": 15023,
        "phonemic": "ˈɡɑːmənt|ˈɡɑːrmənt\r",
        "bigId": "6c0ae30c-198c-442a-b05a-34e001b974ab",
        "wordForms": [
            "garments",
            "garment"
        ]
    },
    "senses": [
        {
            "id": "6c0ae30c-198c-442a-b05a-34e001b974ab",
            "de": "A piece of clothing.",
            "ty": "noun",
            "ex": "She packed her suitcase with her favorite garments for the trip.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "wear a garment",
                " garment industry",
                " garment bag"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6c0ae30c-198c-442a-b05a-34e001b974ab.webp",
            "Tips": [
                {
                    "title": "Particular Clothing",
                    "description": "Refers to specific items you wear, not just any piece of fabric.",
                    "example": "He chose a woolen garment for the chilly evening.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/i77o7R7yQmvnG0QKpdMh2xb1oFE.webp"
                },
                {
                    "title": "Any Clothing",
                    "description": "Can describe any clothing piece, from a sock to a suit.",
                    "example": "Each garment in the museum's display shows a different era.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/EFgSIUSwgeFmwvZAI411UVFV458.webp"
                },
                {
                    "title": "Material Agnostic",
                    "description": "Does not specify material; can refer to cotton, silk, or any fabric.",
                    "example": "The tailor recommended choosing a breathable fabric for my new garment.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3GhE4lC5eW5kFszzTsq8UrTNhQA.webp"
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Apparel": {
            "wordRoot": "Apparel",
            "wordDefinition": "Apparel refers to all types of clothing items, including shirts, pants, dresses, and accessories like hats and jewelry.\n\nSo, while both words refer to clothing items, apparel is a broader term that can be used in many contexts, while garment is narrower and typically used in more technical contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/756487e2-fb0f-49e9-9c6d-d5cf44b7b99f.webp"
        },
        "Attire": {
            "wordRoot": "Attire",
            "wordDefinition": "Attire and garment are both words that refer to clothing.\n\nHowever, attire generally refers to a specific outfit or clothing combination that is worn for a particular occasion or purpose, such as formal attire for a wedding or business attire for a job interview.\n\nAttire is more specific while garment is more broad.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9ef65614-c26e-43a3-b4fe-0b075c501fab.webp"
        },
        "Clothing": {
            "wordRoot": "Clothing",
            "wordDefinition": "Clothing refers to any type of fabric or material worn on the body, including shirts, pants, dresses, and accessories such as hats or scarves.\n\nGarment refers specifically to a piece of clothing that is tailor-made, such as a suit or dress. It is a more formal term and is often used in the context of fashion or design.\n\nClothing refers to any type of material worn on the body and can be used in any context, while garment specifically refers to tailored clothing and is often used in a fashion context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9229e623-501f-4148-9bd6-8d1d09587848.webp"
        },
        "Dress": {
            "wordRoot": "Dress",
            "wordDefinition": "Dress usually refers to a specific type of clothing that is worn by women or girls, which usually includes a skirt and a top that are attached together.\n\nThe word garment is a more general term that refers to any piece of clothing, such as pants, shirts, dresses, and more.\n\nYou can use the term dress when referring to a specific type of clothing that women wear, while the term garment can be used to refer to any piece of clothing, no matter what type it is.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/16fabeea-2a21-4e84-abf8-6a0ad20482b5.webp"
        },
        "Outfit": {
            "wordRoot": "Outfit",
            "wordDefinition": "A garment refers to an individual article of clothing, such as a shirt or pants. An outfit refers to a complete set of clothing worn together, such as a shirt, pants, and shoes.\n\nGarment is applicable when you want to refer to a specific piece of clothing, such as \"I need to wash this garment\" or \"This garment is too small for me.\" Outfit is applicable when you want to refer to a complete ensemble, such as \"I really like your outfit\" or \"I need a new outfit for the party.\"\n\nGarment refers to individual pieces of clothing, while outfit refers to a complete set of clothes worn together.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/623c6c21-e2cd-43f7-8bee-015f67d1ca9a.webp"
        },
        "Raiment": {
            "wordRoot": "Raiment",
            "wordDefinition": "Both garment and raiment refer to clothing, but garment is more commonly used in modern English while raiment is seen in more formal or biblical contexts.\n\nIn other words, garment is a more general term for any piece of clothing, whereas raiment specifically refers to clothing seen as a sign of status or wealth.\n\nFor example, someone might say \"I need to wash my garments\" to refer to their everyday clothes, while \"He arrived wearing fine raiment\" connotes expensive or luxurious clothing.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9ea23cd1-2bd2-46af-baf2-3f21f3ea4a04.webp"
        },
        "Thread": {
            "wordRoot": "Thread",
            "wordDefinition": "A garment is a piece of clothing that is ready to wear, such as a shirt, dress, or pants. Thread is a long, thin strand made of cotton, silk, or other materials that is used to sew garments or other objects together.\n\nThread is applicable in sewing and crafting, as well as in industrial settings such as textile factories.\n\nIn summation, garments are ready-to-wear clothing items, while thread is used to sew garments and other objects together.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7975a315-465b-4744-b58f-f52bef119a17.webp"
        },
        "Wear": {
            "wordRoot": "Wear",
            "wordDefinition": "Garment refers to a piece of clothing or fabric, like a shirt or a dress. It describes the item itself. Wear refers to the act of putting on or having on a garment, like wearing a hat or wearing a coat.\n\nIt describes the action of having the garment on your body. So, when you are talking about the actual clothes themselves, you would use garment, and when you are talking about putting them on or having them on, you would use wear.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c98cf95a-1e38-444c-a495-8e86b6b9b1ff.webp"
        }
    },
    "videos": [
        {
            "Text": " this was a dress I covered in iron filings and I buried it in the ground for several months and after I dug out the dress I felt that the dress actually acquired his own life and became what I call a piece of future archaeology here I was interested in the idea that a garment that has a certain value now",
            "Title": "My life as an outsider PIPE...",
            "VideoId": "-gMZeql_3Uw",
            "Controls": "start=193"
        },
        {
            "Text": " leaving their dreaming sister behind. While keeping her magic robes hidden, the cowherd offered his own garment as a substitute. And after gaining her trust, the pair began exploring the countryside. She was struck by his caring nature, and he learned to see the world’s wonder through her eyes.",
            "Title": "The myth of the original...",
            "VideoId": "s_TGkDcjBqI",
            "Controls": "start=117"
        },
        {
            "Text": " shoulder straps, and a chest band that clasps in back. At first, the bras are included with the sale of a dress, but the popularity of the undergarment soon outstrips that of the garment itself. The three establish a business selling exclusively bras and call it Maidenform.",
            "Title": "How the bra was invented...",
            "VideoId": "8PWca6-fvec",
            "Controls": "start=37"
        },
        {
            "Text": " Semen is relatively basic, so it can disrupt the vagina’s pH. Tight, non-breathable, and wet garments incubate moisture and are thought to facilitate a more Candida-friendly environment. Soaps can damage the protective mucus that coats the vagina,",
            "Title": "What causes yeast...",
            "VideoId": "Bgc1C1xI2dA",
            "Controls": "start=153"
        },
        {
            "Text": " Where do they put it? Up high and without a lid. Reaching up to collect a coffee that I have paid for is an incredibly dangerous experience. But design also impinges on the clothes that I want to wear. I want garments that reflect my personality.",
            "Title": "Why design should...",
            "VideoId": "RD_SLJG7oi8",
            "Controls": "start=281"
        },
        {
            "Text": " The garment’s capacity to withstand years of washing and wear is largely determined by the density of that secondary cell wall. On the other hand, its softness is strongly influenced by the length of the fiber,",
            "Title": "Why is cotton in...",
            "VideoId": "tKLJ6KQAcjI",
            "Controls": "start=200"
        },
        {
            "Text": " so beautifully for us this is such a rare and wonderful opportunity for us to see all of the Anne garments together on a termite mound it's just such a special image or at least most of them anyway",
            "Title": "Safari Live - Day 69 PIPE...",
            "VideoId": "6SSfAO2nQRk",
            "Controls": "start=3373"
        },
        {
            "Text": " Consider the classic white t-shirt. Annually, we sell and buy two billion t-shirts globally, making it one of the most common garments in the world. But how and where is the average t-shirt made,",
            "Title": "The life cycle of a...",
            "VideoId": "BiSYoeqb_VY",
            "Controls": "start=5"
        },
        {
            "Text": " and the garments, and that night, I won best in swimsuit and best in long gown and placed second runner up among 40-plus candidates. That moment changed my life.",
            "Title": "Why I must come out PIPE...",
            "VideoId": "mCZCok_u37w",
            "Controls": "start=243"
        },
        {
            "Text": " in the only garments she owned, to come to the capital city and to share her story. She sat down with me for hours, just ushered me in to the world of poverty.",
            "Title": "Gary Haugen: The hidden...",
            "VideoId": "ofsncCF9O_U",
            "Controls": "start=143"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erin-oconnor.webp",
            "Text": "I've worn a lot of humdingers in my time, but as a model it's my duty - my responsibility - to bring life to any garment. That can be challenging when it comes to high fashion, where the creations can be very eccentric, but I've gained a reputation for being the go-to girl who can pull it off.",
            "Title": "English Model",
            "Name": "Erin O'Connor"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeanne-damas.webp",
            "Text": "I have always been surrounded by women with strong personality and feminine: my mother, my sister, my aunts, my friends. I am fascinated by the look they can have - simple details such as a step, a way of speaking, a gesture, a way of wearing a garment.",
            "Title": "Author",
            "Name": "Jeanne Damas"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/adam-neumann.webp",
            "Text": "Before WeWork, I had a baby clothing company. When I started out, I had no real contacts in the garment business and no mentor to guide me on how things worked. I just had an idea to put pads on the baby clothes on to protect the baby's knees.",
            "Title": "American Businessman",
            "Name": "Adam Neumann"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benjamin-disraeli.webp",
            "Text": "The right honourable gentleman caught the Whigs bathing, and walked away with their clothes. He has left them in the full enjoyment of their liberal positions, and he is himself a strict conservative of their garments.",
            "Title": "British Statesman",
            "Name": "Benjamin Disraeli"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michelangelo.webp",
            "Text": "What spirit is so empty and blind, that it cannot recognize the fact that the foot is more noble than the shoe, and skin more beautiful than the garment with which it is clothed?",
            "Title": "Italian Artist",
            "Name": "Michelangelo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-eastman.webp",
            "Text": "I used to think that music was like lace upon a garment, nice to have but not necessary. I have come to believe that music is absolutely essential to our community life.",
            "Title": "American Inventor",
            "Name": "George Eastman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lisaraye-mccoy-misick.webp",
            "Text": "I think it is important for every actress to be able to feel whatever garment she has on because, we as women, we know when we look good. We know when we feel good.",
            "Title": "American Actress",
            "Name": "LisaRaye McCoy-Misick"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/al-lewis.webp",
            "Text": "What motivated me? My mother. My mother was an immigrant woman, a peasant woman, struggled all her life, worked in the garment center.",
            "Title": "American Actor",
            "Name": "Al Lewis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/herodotus.webp",
            "Text": "When a woman removes her garment, she also removes the respect that is hers.",
            "Title": "Greek Historian",
            "Name": "Herodotus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/georg-c-lichtenberg.webp",
            "Text": "Even truth needs to be clad in new garments if it is to appeal to a new age.",
            "Title": "German Scientist",
            "Name": "Georg C. Lichtenberg"
        }
    ]
}