{
    "currentWord": {
        "wordRoot": "hesitant",
        "id": 5460,
        "phonemic": "ˈhezɪtənt|ˈhezɪtənt\r",
        "bigId": "59ceb9d4-cfc5-4918-b12d-48fa1325b418",
        "wordForms": [
            "hesitantly",
            "hesitant"
        ]
    },
    "senses": [
        {
            "id": "59ceb9d4-cfc5-4918-b12d-48fa1325b418",
            "de": "Unsure or slow to act because you feel unsure or nervous",
            "ty": "adjective",
            "ex": "She was hesitant about agreeing to the deal",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "be hesitant",
                " feel hesitant",
                " seem hesitant"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/59ceb9d4-cfc5-4918-b12d-48fa1325b418.webp",
            "Tips": [
                {
                    "title": "Emotional Uncertainty",
                    "description": "Use 'hesitant' to express feelings of mixed emotions or internal doubts when making decisions.",
                    "example": "She was hesitant to accept the promotion, fearing the increased responsibility.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/o6aUvN0p71Enm5FjIA9rXF2vE0o.webp"
                },
                {
                    "title": "In Decision-Making",
                    "description": "'Hesitant' describes someone who delays choosing because they're uncertain about the outcomes.",
                    "example": "I'm hesitant to invest in that stock because I don't have enough information.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/bABArOesK7VihaJk6lnJCe5ilg.webp"
                },
                {
                    "title": "Social Situations",
                    "description": "In social contexts, being 'hesitant' can show politeness or reluctance to offend others.",
                    "example": "He seemed hesitant to criticize her cooking, despite not liking it.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/5W3N7S48CD3uH8fBS5CdGo0Lho.webp"
                }
            ]
        },
        {
            "id": "3bcf890b-6899-4c65-ab18-d51e28d6f9ae",
            "de": "Tending to stop, pause, or wait before doing something, especially because you are unsure or nervous",
            "ty": "adjective",
            "ex": "He gave me a hesitant smile",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "hesitant smile",
                " hesitant laugh",
                " look hesitant"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3bcf890b-6899-4c65-ab18-d51e28d6f9ae.webp",
            "Tips": [
                {
                    "title": "Initial Interactions",
                    "description": "'Hesitant' often describes first reactions, such as a smile or handshake, when meeting someone new.",
                    "example": "His hesitant handshake suggested he was not confident.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Body Language",
                    "description": "'Hesitant' can be used to describe non-verbal cues that show someone is uncomfortable or unsure.",
                    "example": "Her hesitant nod made me think she didn't fully agree.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Voice Tone",
                    "description": "A 'hesitant' tone of voice indicates uncertainty or lack of confidence in spoken communication.",
                    "example": "He answered in a hesitant voice, which made me doubt if he was telling the truth.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Ambivalent": {
            "wordRoot": "Ambivalent",
            "wordDefinition": "Ambivalent means to have mixed feelings or conflicting emotions about something. For example, if you are ambivalent about a decision, you might feel both excited and scared at the same time.\n\nAmbivalent describes conflicting emotions while hesitant describes uncertainty or reluctance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bd6f34bf-6469-46cd-8c82-2193fa09cdcb.webp"
        },
        "Certain": {
            "wordRoot": "Certain",
            "wordDefinition": "Certain means having no doubt or being confident about something. It is applicable when you are completely sure about something and have no confusion or hesitation in your mind.\n\nFor example, \"I am certain that I locked the door before leaving the house.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fdbc68d0-9f10-4fe8-a072-b9ca42c61ac4.webp"
        },
        "Doubtful": {
            "wordRoot": "Doubtful",
            "wordDefinition": "Doubtful means having uncertainty or being unsure about something. It is applicable when you are unsure about whether something is true or not, or whether to believe or trust someone.\n\nFor example, \"I am doubtful about his story.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fdb9682f-f0f1-4479-a783-fe3b71361331.webp"
        },
        "Indecisive": {
            "wordRoot": "Indecisive",
            "wordDefinition": "Indecisive means to have difficulty making a decision or making up your mind. This could be applicable in situations where you may not be sure what the best choice is or feel overwhelmed by options.\n\nIn essence, hesitant implies that you know what to do but are cautious, whereas indecisive implies that you are unsure of what to do.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3195638c-e73d-4425-abb3-e0518c992841.webp"
        },
        "Reluctant": {
            "wordRoot": "Reluctant",
            "wordDefinition": "Reluctant means to be unwilling, resistant or hesitant in doing something. It's used when a person has strong doubts or is unwilling to do something.\n\nFor example, if someone is reluctant to join a new sports team, they may have a fear of failing, or they are unwilling to dedicate the necessary time and effort required.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7e816d38-0f91-41e1-929a-6e06e679f1f8.webp"
        },
        "Tentative": {
            "wordRoot": "Tentative",
            "wordDefinition": "Tentative means to be cautious and uncertain about something. It is applicable when someone is exploring or trying something new, and is not yet fully committed or confident in their abilities.\n\nHesitant is used when someone is unsure about what to do, while tentative is used when someone is trying something new and not yet fully confident.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e7c29cee-e091-4bb8-a3c8-adeb2f58f7ca.webp"
        },
        "Unwilling": {
            "wordRoot": "Unwilling",
            "wordDefinition": "Hesitant means to feel unsure or uncertain about something, while unwilling means to be opposed to doing something.\n\nIf someone is unwilling to try a new food, it means they have made up their mind that they do not want to try it, even if they have never tried it before.\n\nHesitant is used when someone is unsure or lacks confidence, while unwilling is used when someone actively resists or opposes something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1c8101ac-42cf-4e58-899c-c52dd784f8d5.webp"
        }
    },
    "videos": [
        {
            "Text": " on leopard seals they have been rarely photographed partly because they are considered one of the most dangerous predators in the ocean in fact a year earlier a researcher had been grabbed by one and pulled down to depth and killed so you could imagine Paul was maybe a little bit hesitant about getting into the water now what leopard seals do",
            "Title": "How photography connects...",
            "VideoId": "m-UrpcSRVGk",
            "Controls": "start=730"
        },
        {
            "Text": " I like that now it is some of these guys because they have been used in research some of them are afraid of the grass it's a foreign substrate to them so they're really hesitant they look around for affirmation like is this okay and they'll touch it gingerly and some of",
            "Title": "Inside a Retirement Home...",
            "VideoId": "q7hq7FMynuM",
            "Controls": "start=131"
        },
        {
            "Text": " anything that makes him afraid anything in this case we have we have recorded some sound perfect perfect time let's hear it we want the excitement we want him to believe the back see as you see he got a little hesitant look at that that's a battery actor come on buddy",
            "Title": "Shell Shocked PIPE Dog...",
            "VideoId": "myAhcWEv56Y",
            "Controls": "start=170"
        },
        {
            "Text": " from minor misunderstandings to bigger betrayals. We didn't have the kind of the relationship where we talked about the deeper stuff; but, like many siblings and like people in all kinds of relationships, we were hesitant to tell our truths, to reveal our wounds,",
            "Title": "Say your truths and seek...",
            "VideoId": "Fcm-mAwPkxg",
            "Controls": "start=472"
        },
        {
            "Text": " will fund that research but they're more hesitant to fund the kind ella is talking about she says that creates a blind spot in the western science world a blind spot to places we deem too dangerous i believe firmly that science has a geography problem",
            "Title": "Why War Zones Need...",
            "VideoId": "zbrLgh_59QU",
            "Controls": "start=588"
        },
        {
            "Text": " He feels like he just has his leg back, that he has his body back. Now I'm often asked when I'm going to be neurally linked to my synthetic limbs bidirectionally, when I'm going to become a cyborg. The truth is, I'm hesitant to become a cyborg.",
            "Title": "How we'll become cyborgs...",
            "VideoId": "PLk8Pm_XBJE",
            "Controls": "start=675"
        },
        {
            "Text": " you can see he's been very submissive bowing his head every time females go by laying very low why is it that the males are so incredibly timid and hesitant around female hyenas what's that about anatomically",
            "Title": "Hair-Raising Hyena...",
            "VideoId": "m3XuS8FN3Vg",
            "Controls": "start=641"
        },
        {
            "Text": " and elevating him to important posts. Brutus was hesitant to conspire against the man who had treated him like a son, but in the end, Cassius's insistence and Brutus's own fear of Caesar's ambitions won out.",
            "Title": "The great conspiracy...",
            "VideoId": "wgPymD-NBQU",
            "Controls": "start=160"
        },
        {
            "Text": " let's talk about something that's important to all of us children one of the most fascinating studies I've ever seen showed that more parents are hesitant to talk to kids about weight",
            "Title": "How to talk about weight...",
            "VideoId": "2qktz32WWhQ",
            "Controls": "start=28"
        },
        {
            "Text": " A man was standing at the door, hesitant to press the bell. One minute and 52 seconds. The doorbell rang, a ring that could have saved a life.",
            "Title": "How to recover from...",
            "VideoId": "LC5n91vKDZg",
            "Controls": "start=91"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/adam-rippon.webp",
            "Text": "I remember when I told my mom that I wanted to come out, and my mom was a little hesitant. She was saying, 'Are you sure? Do you think that might affect your scores?' or, 'Is it something that you think that you need to do?' And I told her, 'I don't care. It's important to me.",
            "Title": "American Athlete",
            "Name": "Adam Rippon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rachel-kushner.webp",
            "Text": "I'm hesitant to ever take on the crest of the veteran. So I don't know who I am to warn the younger writer about the perils to come. I think maybe the most dangerous influence is to think you have all the answers and should be giving counsel.",
            "Title": "American Writer",
            "Name": "Rachel Kushner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/raghava-lawrence.webp",
            "Text": "I wanted to do 'Kanchana' in Hindi but many heroes I approached were hesitant to act with the saree and also demanded that the climax song be removed completely. I wrote the script with such passion that I could not agree for any compromise.",
            "Title": "",
            "Name": "Raghava Lawrence"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robbie-williams.webp",
            "Text": "I'm a bit hesitant to do anything because I'm actually kind of lazy and I'd like an easier life from now on. The world's a massive place with lots of early mornings and late starts when you're working.",
            "Title": "British Musician",
            "Name": "Robbie Williams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/margaret-chan.webp",
            "Text": "HIV AIDS is a disease with stigma. And we have learned with experience, not just with HIV AIDS but with other diseases, countries for many reasons are sometimes hesitant to admit they have a problem.",
            "Title": "Chinese Public Servant",
            "Name": "Margaret Chan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bobby-bones.webp",
            "Text": "The first book was a life story that I was hesitant to write anyway because I didn't feel like I had a real life story... It was a surprise hit.",
            "Title": "American Entertainer",
            "Name": "Bobby Bones"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jhumpa-lahiri.webp",
            "Text": "It took me a long time to even dare to envision myself as a writer. I was very uncertain and hesitant and afraid to pursue a creative life.",
            "Title": "American Author",
            "Name": "Jhumpa Lahiri"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mark-goulston.webp",
            "Text": "You can't create more jobs for an economy where the vast majority of people are hesitant and even afraid to spend and buy.",
            "Title": "American Psychologist",
            "Name": "Mark Goulston"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/divya-khosla-kumar.webp",
            "Text": "I was hesitant to ask around for work, so I did a short film called 'Bulbul,' which was praised a lot by people.",
            "Title": "Indian Actress",
            "Name": "Divya Khosla Kumar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bob-crosby.webp",
            "Text": "Bing was always hesitant to accept appreciation in any form.",
            "Title": "American Musician",
            "Name": "Bob Crosby"
        }
    ]
}