{
    "currentWord": {
        "wordRoot": "ignore",
        "id": 16164,
        "phonemic": "ɪɡˈnɔː(r)|ɪɡˈnɔːr\r",
        "bigId": "b67ff0f4-6752-4586-90b2-8d2ea28ef2af",
        "wordForms": [
            "ignores",
            "ignoring",
            "ignored",
            "ignore"
        ]
    },
    "senses": [
        {
            "id": "b67ff0f4-6752-4586-90b2-8d2ea28ef2af",
            "de": "Not pay attention to, not acknowledge when seen, heard or perceived in some way",
            "ty": "verb",
            "ex": "She chose to ignore the rude comments.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "ignore someone's advice",
                " ignore a problem",
                " ignore a request"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b67ff0f4-6752-4586-90b2-8d2ea28ef2af.webp",
            "Tips": [
                {
                    "title": "Social Implications",
                    "description": "Ignoring can be seen as disrespectful or amicable depending on context, such as not reacting to aggression.",
                    "example": "She ignored their taunts, showing dignity.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/K4IbPzNBMRPrFoXJ80UVucLJDQ.webp"
                },
                {
                    "title": "Potential Consequences",
                    "description": "Be aware that neglecting matters, like requests or problems, might lead to bigger issues later.",
                    "example": "If you ignore this leak, it could cause major damage.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/A23TXiQjfnXGDB6cS9mj10Dv18.webp"
                },
                {
                    "title": "Selective Ignoring",
                    "description": "People sometimes ignore only certain aspects while still being engaged with the overall situation.",
                    "example": "He ignored the background noise, focusing on the music.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/5LBIEz4HF3y1uPOudg2pHmoFY.webp"
                }
            ]
        },
        {
            "id": "8076f25b-9999-49d5-9205-aeed1390d721",
            "de": "Intentionally not include or consider",
            "ty": "verb",
            "ex": "In the final report, they ignored all the other options.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8076f25b-9999-49d5-9205-aeed1390d721.webp",
            "Tips": [
                {
                    "title": "Academic Precision",
                    "description": "In academic contexts, ignoring can imply a careful decision to exclude certain details for clarity.",
                    "example": "The study ignores outlier data points to focus on the trend.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Breadth of Exclusion",
                    "description": "Ignoring in a comprehensive report suggests deliberation; what's omitted is often as telling as what's included.",
                    "example": "The policy ignored any benefits, focusing only on the drawbacks.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Consideration and Rejection",
                    "description": "Ignoring ideas can mean they were considered but then rejected as irrelevant or unimportant.",
                    "example": "We reviewed your idea but chose to ignore it for the current project.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Brush off": {
            "wordRoot": "Brush off",
            "wordDefinition": "Brush off means to dismiss something or someone casually or without giving much attention or importance to it.\n\nFor example, if someone came up to you and told you a lame joke, and you responded with a smile and quick \"ha ha, very funny,\" then you just brushed them off.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ed60ec24-0be2-4589-ba68-6cfc9df65769.webp"
        },
        "Dismiss": {
            "wordRoot": "Dismiss",
            "wordDefinition": "Dismiss means to reject or disregard something as unimportant or unworthy of consideration.\n\nIt is typically used in more formal or serious situations, such as a judge dismissing a case or a manager dismissing an employee from their job.\n\nDismiss carries a stronger connotation of actively rejecting something, while ignore simply implies a lack of attention or acknowledgement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f17ca330-a295-4aba-ad64-d5001e85cac8.webp"
        },
        "Disregard": {
            "wordRoot": "Disregard",
            "wordDefinition": "Disregard means to not pay attention to something, but with the understanding that it may be important. For example, if your teacher tells you to disregard a certain page in your textbook, it means that you should not focus on that page, but it could become important at a later time.\n\nDisregard implies that the thing being ignored might be important, while ignore implies a deliberate effort to avoid something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/69a498af-6896-4901-9f6a-8cb04f4a2a40.webp"
        },
        "Minimize": {
            "wordRoot": "Minimize",
            "wordDefinition": "Minimize means to reduce the impact or importance of something. It's used when you want to acknowledge something's existence but make it seem less significant.\n\nFor example, if you're talking about a mistake you made, you might try to minimize its impact by pointing out that it wasn't a big deal in the grand scheme of things.\n\nTo sum up, if you want to completely disregard something, you can use ignore, whereas if you want to acknowledge something but make it seem less important, you can use \"minimize.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3080bd15-41fc-4e53-841c-e035bfa9b84d.webp"
        },
        "Neglect": {
            "wordRoot": "Neglect",
            "wordDefinition": "Neglect means to fail to take care of something/someone properly, often resulting in harm or damage. It is applicable in situations where there is a responsibility to respond, but it is not fulfilled.\n\nExample: If you forget to feed your pet for a long time, you are neglecting it and causing it harm.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/01767325-0750-45ac-884b-339c782f6033.webp"
        },
        "Overlook": {
            "wordRoot": "Overlook",
            "wordDefinition": "Overlook means to unintentionally not notice something or someone, or to forgive or disregard a mistake. It is applicable when you accidentally miss something or when you choose to forgive someone or overlook their mistake.\n\nIgnore means intentionally avoiding something while overlook means unintentionally missing something or forgiving a mistake.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/13cf3af2-d060-4ede-9dbf-5d449c30209d.webp"
        },
        "Tune out": {
            "wordRoot": "Tune out",
            "wordDefinition": "Tune out means to unintentionally not pay attention to something or someone. It means you are not aware of it because you're not focused on it.\n\nIt's like when you're reading a book and someone is talking to you, you tune them out without even realizing it.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aeb22d58-3e85-40ee-ba2d-1730b68e8357.webp"
        }
    },
    "videos": [
        {
            "Text": " era thing because if we had no problem with it we just do it here so we hit it away because we knew it was uncomfortable because we know what our values are so what's been happening in the world is we've been evaluating all of the things that have been going on by ignoring our values because we don't realize we're in an infinite contest and we only look at our interests so we",
            "Title": "What game theory teaches...",
            "VideoId": "0bFs6ZiynSU",
            "Controls": "start=480"
        },
        {
            "Text": " and the bond between carbon and fluorine is incredibly tight. Like a couple that ignores everyone except each other, carbon and fluorine interact so strongly that the normal, intermolecular forces that help substances stick to each other don't stand a chance. Even the famously adhesive feet of geckos usually can't get a grip.",
            "Title": "Why doesn’t anything...",
            "VideoId": "uXaP43Zbz7U",
            "Controls": "start=115"
        },
        {
            "Text": " So, ignoring the geometry lesson, and taking matters into their own hands, the bees went back to the drawing board to rethink their beehive design. One suggested triangles, \"We can use triangles. Look! They fit together perfectly.\" Another bee suggested squares. Finally, a third bee piped up and said,",
            "Title": "Why do honeybees love...",
            "VideoId": "QEzlsjAqADA",
            "Controls": "start=152"
        },
        {
            "Text": " deepening and expanding our understanding of what human rights are, and how to better protect them. So if these principles are so well-developed, then why are human rights abused and ignored time and time again all over the world? The problem in general is that it is not at all easy",
            "Title": "What are the universal...",
            "VideoId": "nDgIVseTkuE",
            "Controls": "start=137"
        },
        {
            "Text": " have barely been used in commercial power plants because they cost a lot. But ultimately, the bigger problem is that in most parts of the world, it's still too easy and much cheaper to keep emitting carbon dioxide, and that makes it tempting to completely ignore coal's dark side.",
            "Title": "How to create cleaner...",
            "VideoId": "rO6S93FKIUM",
            "Controls": "start=294"
        },
        {
            "Text": " either everyone is telling the truth, or the two possessed students are paired together. In either case, ignore the duo. If there's only one group arguing, both others must be telling the truth, and if there are two conflicts, then the possessed students are in separate groups",
            "Title": "Can you solve the temple...",
            "VideoId": "nSbvlktToSY",
            "Controls": "start=202"
        },
        {
            "Text": " jealous but could the same be true for our four-legged friends our two dogs Ruby and Emma didn't mind being ignored while their owners were busy playing with their phones and other lifeless objects but what do you think will happen when their owners start showering",
            "Title": "Jealousy Bites PIPE Brain...",
            "VideoId": "7tKZB2k14iY",
            "Controls": "start=88"
        },
        {
            "Text": " when the going got tough, those arguments didn't take a toll on their memories. So this message, that good, close relationships are good for our health and well-being, this is wisdom that's as old as the hills. Why is this so hard to get and so easy to ignore?",
            "Title": "Robert Waldinger: What...",
            "VideoId": "8KkKuTCFvzI",
            "Controls": "start=592"
        },
        {
            "Text": " The keepers move the baby closer. The youngster cries out desperately for mum to pick her up but she still ignores the helpless baby.",
            "Title": "New-born Panda Reunited...",
            "VideoId": "2MC-ASv4YAQ",
            "Controls": "start=50"
        },
        {
            "Text": " head-to-head completely ignored by the dolphins didier gets a rare chance to record this intense showdown to close up",
            "Title": "Dolphin Gang War PIPE Ocean...",
            "VideoId": "C-vleUEUhWc",
            "Controls": "start=156"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kaitlyn-dever.webp",
            "Text": "When someone is bullying you, don't let it get to you. I remember my friends in school, someone said something mean to them, and they really let it get to them. And it really affected them. But I would just say try to ignore it as much as possible and just be yourself.",
            "Title": "American Actress",
            "Name": "Kaitlyn Dever"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/emmanuelle-beart.webp",
            "Text": "Of course I am political. You 'ave to be don't you? Every day it is about your future, your right to that future. 'Ow can people ignore this? We 'ave to leave a good world for our children, n'est-ce pas?",
            "Title": "French Actress",
            "Name": "Emmanuelle Beart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nina-turner.webp",
            "Text": "Nobody talks about the poor. Everybody talks about the middle class and just kinda want to ignore that the poor exist. And you cannot ignore that they exist if you want to help them.",
            "Title": "American Politician",
            "Name": "Nina Turner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-kasich.webp",
            "Text": "If we intend to provide a better life, and a better world, for future generations, we can't ignore the quality of the environment we leave them.",
            "Title": "American Politician",
            "Name": "John Kasich"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shibani-dandekar.webp",
            "Text": "As long as you aren't hurting anyone through your post, just do what makes you happy and what is important for you and ignore others.",
            "Title": "Indian Musician",
            "Name": "Shibani Dandekar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/reed-morano.webp",
            "Text": "Ultimately, the idea of being able to escape and lose myself in a new world every time I go to 'work' was too appealing to ignore.",
            "Title": "American Director",
            "Name": "Reed Morano"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/salman-rushdie.webp",
            "Text": "A book is a version of the world. If you do not like it, ignore it; or offer your own version in return.",
            "Title": "Indian Novelist",
            "Name": "Salman Rushdie"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-cordray.webp",
            "Text": "I'm not going to stand by and ignore things that I think are important to talk about.",
            "Title": "American Lawyer",
            "Name": "Richard Cordray"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sam-levenson.webp",
            "Text": "You must pay for your sins. If you have already paid, please ignore this notice.",
            "Title": "American Author",
            "Name": "Sam Levenson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/saul-leiter.webp",
            "Text": "I spent a great deal of my life being ignored. I was always very happy that way.",
            "Title": "American Artist",
            "Name": "Saul Leiter"
        }
    ]
}