{
    "currentWord": {
        "wordRoot": "inconsiderate",
        "id": 5836,
        "phonemic": "ˌɪnkənˈsɪdərət|ˌɪnkənˈsɪdərət\r",
        "bigId": "75ed744d-35c3-4dd9-8b02-acbbe10a55bf",
        "wordForms": [
            "inconsiderately",
            "inconsiderate"
        ]
    },
    "senses": [
        {
            "id": "75ed744d-35c3-4dd9-8b02-acbbe10a55bf",
            "de": "Not thinking or worrying about the feelings of others",
            "ty": "adjective",
            "ex": "It was inconsiderate of him to keep us waiting",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "inconsiderate behavior",
                " inconsiderate person",
                " inconsiderate actions"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/75ed744d-35c3-4dd9-8b02-acbbe10a55bf.webp",
            "Tips": [
                {
                    "title": "Social Situations",
                    "description": "Use 'inconsiderate' when someone ignores social norms or etiquette, causing annoyance or offense.",
                    "example": "Talking loudly on your phone in a quiet cafe is inconsiderate.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/JqJgtemeWU3jq6yq9NNVPpXQPC8.webp"
                },
                {
                    "title": "Neglect of Feelings",
                    "description": "'Inconsiderate' often implies neglecting others' feelings in favor of one's own comfort or convenience.",
                    "example": "Playing loud music late at night is inconsiderate to neighbors.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/MSPDy0XC0nbnqm9iW5EDcyv9KQ.webp"
                },
                {
                    "title": "Impact of Words",
                    "description": "Calling someone 'inconsiderate' can be strong criticism. Use with care to avoid offending.",
                    "example": "She called him inconsiderate for forgetting her birthday.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/BhgOjcX4HbLUvvQhgtPLEvVPKic.webp"
                }
            ]
        },
        {
            "id": "dbae0162-b004-42cb-b0f4-03c44afc7620",
            "de": "Not carefully considering the possible effects of your actions",
            "ty": "adjective",
            "ex": "Inconsiderate parking can block access for emergency vehicles",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "inconsiderate driving",
                " inconsiderate parking",
                " inconsiderate use"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/dbae0162-b004-42cb-b0f4-03c44afc7620.webp",
            "Tips": [
                {
                    "title": "Practical Impact",
                    "description": "Use 'inconsiderate' to describe actions with negative practical effects on others, like causing delays or hazards.",
                    "example": "Inconsiderate parking caused a traffic jam.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Beyond Intent",
                    "description": "'Inconsiderate' can describe unintended consequences of actions taken without malice, but with neglect.",
                    "example": "Leaving the door unlocked was inconsiderate to your roommate's security concerns.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Common Public Complaint",
                    "description": "The term is often used in public settings, like transportation or shared facilities, where people's actions affect many.",
                    "example": "His inconsiderate use of the shared kitchen left no space for others.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Caring": {
            "wordRoot": "Caring",
            "wordDefinition": "Caring refers to showing concern and kindness towards others, while inconsiderate refers to not thinking or caring about others' feelings or needs.\n\nCaring is applicable when you want to show empathy and support for someone, while inconsiderate is applicable when someone is being thoughtless or selfish.\n\nFor example, a caring person will help a friend in need, while an inconsiderate person might ignore someone who needs help.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2b92ba67-9068-4023-8d9d-9ba5f8db614f.webp"
        },
        "Discourteous": {
            "wordRoot": "Discourteous",
            "wordDefinition": "Discourteous refers to someone who is rude or impolite, while inconsiderate describes someone who is thoughtless or doesn't consider the feelings or needs of others.\n\nFor example, if someone cuts in line in front of you, they are being discourteous because they are not showing proper respect for others.\n\nIn summary, discourteousness is about violating social norms and rules of etiquette, while inconsiderate behavior is more about lacking empathy and awareness of other people's feelings.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0abd9fa4-6410-4ede-9a14-09635d362b53.webp"
        },
        "Impolite": {
            "wordRoot": "Impolite",
            "wordDefinition": "Impolite means not showing good manners.\n\nIt describes rude behavior that is intentional or unintentional. For example, not saying \"please\" or \"thank you,\" interrupting others while they talk, or speaking loudly in a quiet place are considered impolite.\n\nImpolite behavior is a violation of social norms or etiquette, while inconsiderate behavior is a lack of consideration for others.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/693a8b60-90fb-4a39-a057-f7df56bfcb3d.webp"
        },
        "Inattentive": {
            "wordRoot": "Inattentive",
            "wordDefinition": "Inattentive means not paying attention or not giving enough focus. This is applicable when someone is distracted, forgetful, or easily loses concentration.\n\nIn summary, being inattentive means you are not paying enough attention, while being inconsiderate means you are not thinking about other people's feelings.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/28bc1c33-12de-413a-a4d0-ea85596aa31d.webp"
        },
        "Insensitive": {
            "wordRoot": "Insensitive",
            "wordDefinition": "Insensitive means not being aware of or understanding other people's feelings or emotions. For example, if someone makes a joke about a sensitive topic like mental illness without considering how it might make someone feel, they are being insensitive.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4686732a-c66f-453c-ab45-c1f889727eff.webp"
        },
        "Rude": {
            "wordRoot": "Rude",
            "wordDefinition": "Rude means that someone is being impolite or disrespectful. For example, if someone interrupts another person while they are talking or makes fun of someone else, they are being rude because they are not showing basic respect for others.\n\nTo summarize, being inconsiderate means not thinking about others, while being rude means actively disrespecting others.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a88f9457-18f9-4c67-bf72-d763438ff59f.webp"
        },
        "Selfish": {
            "wordRoot": "Selfish",
            "wordDefinition": "Selfish means that someone is only concerned with their own interests and desires, and they disregard the needs of others.\n\nThe difference between the two is that inconsiderate implies a lack of thoughtfulness towards others, while selfish implies a disregard for others in a more deliberate and intentional way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8c01584b-4893-4b4c-b90f-5c8fd280f65f.webp"
        },
        "Thoughtless": {
            "wordRoot": "Thoughtless",
            "wordDefinition": "Both inconsiderate and thoughtless are used to describe someone who behaves without concern for others.\n\nThoughtless implies that someone isn't taking the time to think about the impact of their behavior on others.\n\nFor example, someone who forgets to thank a friend for their help is being thoughtless.\n\nSo, both words are applicable when describing behavior that is disrespectful and disregarding of others. But inconsiderate suggests a lack of awareness or empathy, while thoughtless implies a lack of consideration or reflection.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a1072b49-9a60-46f7-9f6f-b64e7e721f61.webp"
        },
        "Unkind": {
            "wordRoot": "Unkind",
            "wordDefinition": "Unkind refers to someone who deliberately says or does something cruel or hurtful.\n\nInconsiderate is when someone doesn't mean to be hurtful, but is thoughtless, while unkind is when someone is intentionally cruel or hurtful.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9bf56ee4-3ee0-461a-be85-8720c327a36f.webp"
        }
    },
    "videos": [
        {
            "Text": " Why does he think he's more important than anyone else?\" Jumping quickly to the fifth rung, we conclude that this guy is heartless, inconsiderate, he needs to be taught a lesson and put in his place. We feel angry, frustrated, vindictive, justified. On our sixth rung,",
            "Title": "Rethinking thinking -...",
            "VideoId": "KJLqOclPqis",
            "Controls": "start=189"
        },
        {
            "Text": " particularly at night, because obviously it's dark and bats being nocturnal, you know, that's when they like to come out, which is pretty inconsiderate of them. But luckily, we've got this nifty piece of kit that can detect bats not by sight, but by sound.",
            "Title": "Discovering Wildlife in...",
            "VideoId": "BE79vqPu1hg",
            "Controls": "start=706"
        },
        {
            "Text": " Try not to do that. That's called sodcasting, Imposing your sound on people around you carelessly and inconsiderately. Not nice. Of course, where this all comes into play most of all is when you've got something really important to do.",
            "Title": "How to speak so that...",
            "VideoId": "eIho2S0ZahI",
            "Controls": "start=428"
        },
        {
            "Text": " living on pasture now living a good life but we started the journey um uh this is gray horse he kicks everybody which is really inconsiderate you know kicks like a horse uh but we got them all trained and and",
            "Title": "Why Four Cowboys Rode...",
            "VideoId": "I63lqFupVmQ",
            "Controls": "start=1213"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rob-mcclure.webp",
            "Text": "My wife makes fun of me by calling me a grandpa because I have very little patience for inconsiderate children. So if we're walking in the mall, and some kid goes by really fast on a skateboard, I become the grumpiest eighty-five-year-old man in the world and start screaming at them.",
            "Title": "American Actor",
            "Name": "Rob McClure"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marshall-goldsmith.webp",
            "Text": "All of us have people in our lives who drive us crazy. We've spent hours reliving the unfair, unappreciative, inconsiderate treatment they have inflicted on us. But getting mad at this person makes just about as much sense as getting mad at a chair for being a chair.",
            "Title": "American Coach",
            "Name": "Marshall Goldsmith"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lizzy-caplan.webp",
            "Text": "I don't think you should be allowed to eat in a restaurant if you haven't waited tables at least once. It's so irritating when I see people being rude to waiters, like, it makes me want to slit their throats! Like, really? You're really this inconsiderate?",
            "Title": "American Actress",
            "Name": "Lizzy Caplan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/debra-winger.webp",
            "Text": "Just because we're on schedule is no reason to shoot bad acting. Someone once said to me, 'You're inconsiderate.' And I said, 'Inconsiderate? Bad acting is the ultimate inconsideration.' It's a collective slap to a million faces at the same time.",
            "Title": "American Actor",
            "Name": "Debra Winger"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/peter-hitchens.webp",
            "Text": "I fear crazy cyclists just as much as I fear inconsiderate drivers. They are like cultists, dressed up like huge insects in dehumanising uniforms, so sure they are saving the planet that they care little for its inhabitants.",
            "Title": "English Journalist",
            "Name": "Peter Hitchens"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/letitia-baldrige.webp",
            "Text": "Crashing could not be more inconsiderate to a host. It is a negative act because hosts likely have a particular plan for the event, an intention to move guests' attitudes in a certain direction.",
            "Title": "American Writer",
            "Name": "Letitia Baldrige"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/letitia-baldrige.webp",
            "Text": "Everybody forgets names and faces, and it's just inconsiderate to expect someone who isn't your boss or your sister-in-law to know exactly who you are.",
            "Title": "American Writer",
            "Name": "Letitia Baldrige"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/samuel-richardson.webp",
            "Text": "To what a bad choice is many a worthy woman betrayed, by that false and inconsiderate notion, That a reformed rake makes the best husband!",
            "Title": "English Novelist",
            "Name": "Samuel Richardson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cindy-sherman.webp",
            "Text": "Inconsiderate, rude behavior drives me nuts. And I guess the inconsiderate rudeness of social ineptitude definitely fuels my work.",
            "Title": "American Photographer",
            "Name": "Cindy Sherman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tito-ortiz.webp",
            "Text": "I cheated on my first wife, Kristin. I thought I was untouchable. How could I be that inconsiderate to someone?",
            "Title": "American Athlete",
            "Name": "Tito Ortiz"
        }
    ]
}