{
    "currentWord": {
        "wordRoot": "incur",
        "id": 2183,
        "phonemic": "ɪnˈkɜː(r)|ɪnˈkɜːr\r",
        "bigId": "7b5a288a-9239-45e2-a7ce-6e7019236c2e",
        "wordForms": [
            "incurs",
            "incurring",
            "incurred",
            "incur"
        ]
    },
    "senses": [
        {
            "id": "7b5a288a-9239-45e2-a7ce-6e7019236c2e",
            "de": "To be subject to something as a result of your actions.",
            "ty": "verb",
            "ex": "If you drive recklessly, you risk incurring severe penalties.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "incur debts",
                " incur penalty",
                " incur damage"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7b5a288a-9239-45e2-a7ce-6e7019236c2e.webp",
            "Tips": [
                {
                    "title": "Result of Actions",
                    "description": "Use 'incur' to emphasize consequences are a direct result of someone's actions.",
                    "example": "They incurred huge losses due to poor investment choices.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/cNgMVZsNIfGDw30SLKYoZ9eLYoY.webp"
                },
                {
                    "title": "Negative Outcomes",
                    "description": "'Incur' often precedes negative outcomes, not positive rewards or results.",
                    "example": "The company incurred fines for environmental violations.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/QRAwRiELXFE92tLDaDjnSuT9TAU.webp"
                },
                {
                    "title": "Legal and Formal",
                    "description": "'Incur' is frequently used in legal, formal, or financial contexts.",
                    "example": "She incurred additional charges after the due date.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Wq8D1SLD4E3eKRMBt3YGVzZe8Ew.webp"
                }
            ]
        },
        {
            "id": "8697d54a-68a9-43ec-89f6-7edcaa6647c7",
            "de": "To bring something down upon yourself, usually something negative",
            "ty": "verb",
            "ex": "He incurred his teacher's wrath by arriving late again.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "incur wrath",
                " incur criticism",
                " incur dissatisfaction"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8697d54a-68a9-43ec-89f6-7edcaa6647c7.webp",
            "Tips": [
                {
                    "title": "Negative Reactions",
                    "description": "'Incur' is used when one's actions bring about a negative reaction from another.",
                    "example": "His constant tardiness incurred the displeasure of his boss.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Responses",
                    "description": "Often linked to emotional responses such as anger, dissatisfaction, or disapproval.",
                    "example": "She incurred her friend's anger by revealing the secret.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subject of Sentence",
                    "description": "The subject is usually the person or entity that experiences the consequence.",
                    "example": "The athlete incurred a serious injury during the game.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Bear": {
            "wordRoot": "Bear",
            "wordDefinition": "Bear means to carry or hold something, often with a sense of difficulty or burden. For example, \"I had to bear the weight of the heavy box.\".\n\nIt can also mean to tolerate or endure something, such as pain or hardship. An example sentence could be: \"She had to bear the pain of a broken arm after falling off her bike.\".\n\nBear refers to holding or enduring something while incur refers to bringing upon oneself a negative consequence.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/74627720-6298-4396-9373-2d88d4ad4fd8.webp"
        },
        "Experience": {
            "wordRoot": "Experience",
            "wordDefinition": "Experience means to undergo a particular event, situation or feeling. For example, you can experience joy or sadness, or experience a new culture when you travel to a different country.\n\nExperience is to undergo or encounter a particular situation, while incur is to bring about something unpleasant or undesirable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e81d6d88-3fbb-4358-a81c-8fcfe99e40d0.webp"
        },
        "Face": {
            "wordRoot": "Face",
            "wordDefinition": "Face means to confront or come across something or someone, or to have something directed towards you. For example, you might face a difficult problem or face your fears.\n\nFace is applicable when you come across or confront something, while incur is applicable when you suffer a consequence or penalty.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/97b34b03-6887-468a-976d-64400ad9c261.webp"
        },
        "Meet": {
            "wordRoot": "Meet",
            "wordDefinition": "Incur means to bring upon oneself or experience something that is usually unpleasant, such as a debt, penalty or injury.\n\nMeet means to come into contact or encounter someone or something.\n\nIt can also refer to fulfilling an obligation or expectation. For example, you can meet friends at a restaurant, or you can meet a deadline for a school project.\n\nIncur is used when something negative or unpleasant happens to you, while meet is used more generally to describe encountering or fulfilling something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b866f5e5-51a2-4bb6-9b0e-fd8aabb6cef4.webp"
        },
        "Suffer": {
            "wordRoot": "Suffer",
            "wordDefinition": "For example, \"if you don't follow the safety rules, you may incur injuries\". Suffer means to experience pain or distress from something, typically something negative or unpleasant.\n\nFor example, \"if you don't follow the safety rules, you may suffer injuries\". Incur refers to becoming responsible for something while suffer refers to experiencing something negative.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d5c76b68-2360-48f2-afb7-9e9778638a8d.webp"
        },
        "Sustain": {
            "wordRoot": "Sustain",
            "wordDefinition": "Both incur and sustain refer to experiencing or suffering something negative, but they are used in slightly different contexts.\n\nTo sustain something means to experience or endure something negative that was brought upon you externally. For example, if you get into a car accident, you sustain injuries.\n\nIncur is used when you are responsible for the negative consequence, while sustain is used when something negative happens to you externally.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/daac1394-d0f1-429d-8c42-f41773b09132.webp"
        },
        "Undergo": {
            "wordRoot": "Undergo",
            "wordDefinition": "Undergo means to experience something, usually unpleasant, that is out of one's control or is a necessary part of a process.\n\nFor example, one might undergo surgery to remove a tumor.\n\nIncur applies to negative consequences that result from one's own actions or choices, while undergo applies to experiences that are beyond one's control or are required as part of a process.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c5d9afed-7e7b-4450-9ed1-193b79af2381.webp"
        }
    },
    "videos": [
        {
            "Text": " to operate her program. And the big reason why she's able to do this is she's not having to incur the costs of commercial real estate. She's doing this out of her home. And her program is actually more affordable than programs nearby. It's a win-win for her and for the parents. So I want to live in a world where there's more Christinas,",
            "Title": "Chris Bennett: A...",
            "VideoId": "8_cEKbzbC98",
            "Controls": "start=458"
        },
        {
            "Text": " that within the technology of democracy, in this system, they exercise their preferences, their choices and their voices to encourage that outcome. That's a hopeful message, but it's a message that's hopeful only if you understand it as incurring serious obligation for all of us.",
            "Title": "Noah Feldman: Politics...",
            "VideoId": "cDNEjS4la10",
            "Controls": "start=867"
        },
        {
            "Text": " the fate of millions resting in your hands will you be prepared for the aftermath to make the right decisions you need to know more about electromagnetic pulses how they work the damage they incur what you should not be scared of and what you should to help",
            "Title": "Nuclear Explosion in the...",
            "VideoId": "PPzIWsdnj0w",
            "Controls": "start=74"
        },
        {
            "Text": " for later release into protected wetlands. That, I think, is movement. And just recently, we've begun to work with those men who are segregated in what we call Supermax facilities. They've incurred violent infractions by becoming violent with guards",
            "Title": "Nalini Nadkarni: Life...",
            "VideoId": "1BS-XUntiLg",
            "Controls": "start=193"
        },
        {
            "Text": " without incurring the caloric cost, or as if you found 25 grand in a pocket of an old jacket you hadn't worn for ages, or whenever you want to tap into a superpower that will help you and everyone around you live a longer, healthier, happier life,",
            "Title": "The hidden power of...",
            "VideoId": "U9cGdRNMdQQ",
            "Controls": "start=408"
        },
        {
            "Text": " Also, many of our communities are incurring fewer emergency services costs. I have learned over and over again that when you listen to somebody's story with an open heart, walk in their shoes with them, you can't help but love and care for them",
            "Title": "The Housing First...",
            "VideoId": "5nys6iebjHw",
            "Controls": "start=778"
        },
        {
            "Text": " and speak to the prisoners under the following you may only make one statement, and you cannot tell them any new information. What can you say to help free the prisoners without incurring the dictator's wrath? After thinking long and hard,",
            "Title": "Can you solve the...",
            "VideoId": "98TQv5IAtY8",
            "Controls": "start=67"
        },
        {
            "Text": " think up now is one man I respect because in one day I so keep fighting two males in one day one in the morning and one in the afternoon the good news is he won't both battles as much as he incurred a very big scar I think on his",
            "Title": "Safari Live - Day 344 PIPE...",
            "VideoId": "Qwd4qMDDwhg",
            "Controls": "start=3215"
        },
        {
            "Text": " poisoned by the dye and in the glass making industry the kids are held in debt bondage that was actually incurred by their parents they work over these gas burners in intense heat and fumes with no ventilation no protective gear",
            "Title": "Jodi Cobb: Human Bondage...",
            "VideoId": "vlx7Ip_k6TA",
            "Controls": "start=277"
        },
        {
            "Text": " new then it can't be rushed think about the design the people here believe a funeral is the culmination of a person's entire life and that it's preferable to incur lifelong deaths than",
            "Title": "Coffin Maker PIPE National...",
            "VideoId": "JZDuVKn8dXc",
            "Controls": "start=37"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ram-nath-kovind.webp",
            "Text": "The highest priority of my government is to remove various difficulties faced by farmers and to raise their standard of living. The schemes of my government are not only removing their hardships but also reducing the expenditure incurred by them on farming.",
            "Title": "Indian Politician",
            "Name": "Ram Nath Kovind"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/william-james.webp",
            "Text": "Our errors are surely not such awfully solemn things. In a world where we are so certain to incur them in spite of all our caution, a certain lightness of heart seems healthier than this excessive nervousness on their behalf.",
            "Title": "American Philosopher",
            "Name": "William James"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-lankford.webp",
            "Text": "Most businesses believe regulators intend to fine them rather than help them protect their workers. Serious violations should bring real consequences, but minor violations should only incur warnings that encourage compliance.",
            "Title": "American Politician",
            "Name": "James Lankford"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/padmapriya-janakiraman.webp",
            "Text": "The starting point of social movements stems from deep pain and intolerance towards loss already incurred and hence any gain including just voicing the injustice empowers the movement and everybody else around them.",
            "Title": "Indian Actress",
            "Name": "Padmapriya Janakiraman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/pericles.webp",
            "Text": "All who have taken it upon themselves to rule over others have incurred hatred and unpopularity for a time; but if one has a great aim to pursue, this burden of envy must be accepted, and it is wise to accept it.",
            "Title": "Greek Statesman",
            "Name": "Pericles"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-k-polk.webp",
            "Text": "Well may the boldest fear and the wisest tremble when incurring responsibilities on which may depend our country's peace and prosperity, and in some degree the hopes and happiness of the whole human family.",
            "Title": "American President",
            "Name": "James K. Polk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/greg-daniels.webp",
            "Text": "When you think about 'The Simpsons' or 'King of the Hill' or something like that, the worlds tend to expand each episode, because there's no additional cost incurred to hire an animated character.",
            "Title": "American Writer",
            "Name": "Greg Daniels"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bram-fischer.webp",
            "Text": "If in my fight I can encourage even some people to understand and to abandon policies they now so blindly follow, I shall not regret any punishment I may incur.",
            "Title": "South African Lawyer",
            "Name": "Bram Fischer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-james.webp",
            "Text": "The only obligation to which in advance we may hold a novel, without incurring the accusation of being arbitrary, is that it be interesting.",
            "Title": "American Writer",
            "Name": "Henry James"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephanie-coontz.webp",
            "Text": "Marriage is no longer the only place where people make major life transitions and decisions, enter into commitments, or incur obligations.",
            "Title": "American Author",
            "Name": "Stephanie Coontz"
        }
    ]
}