{
    "currentWord": {
        "wordRoot": "influence",
        "id": 17457,
        "phonemic": "ˈɪnfluəns|ˈɪnfluəns\r",
        "bigId": "0d79f0c3-b806-4004-b5a8-ff1f1cbd4e6e",
        "wordForms": [
            "influences",
            "influencing",
            "influenced",
            "influencers",
            "influencer",
            "influence"
        ]
    },
    "senses": [
        {
            "id": "0d79f0c3-b806-4004-b5a8-ff1f1cbd4e6e",
            "de": "The ability to make another person or thing change by actions or words",
            "ty": "noun",
            "ex": "She has a lot of influence over the way her children behave.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "have influence",
                " under the influence",
                " influence over"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0d79f0c3-b806-4004-b5a8-ff1f1cbd4e6e.webp",
            "Tips": [
                {
                    "title": "Subtle Persuasion",
                    "description": "Think of 'influence' as a soft power, guiding rather than commanding.",
                    "example": "Her suggestions subtly influence our team's choices.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/M7ASwg9nLKOcRq1APBQj8Ayz6M.webp"
                },
                {
                    "title": "Not Always Visible",
                    "description": "'Influence' often works behind the scenes, not immediately obvious.",
                    "example": "His influence is often felt, though he rarely speaks up.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/w6q7ltYRYULrSeefq1TAPZGX200.webp"
                },
                {
                    "title": "Emotional Impact",
                    "description": "The word can carry an emotional weight, indicating respect and admiration.",
                    "example": "The poet's work continues to influence young writers today.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/reVlxyaHDC4HeZ6yxh1Rnreh7EE.webp"
                }
            ]
        },
        {
            "id": "2f714908-5954-492d-8013-bf656c69684f",
            "de": "To change how someone or something behaves, thinks, or develops",
            "ty": "verb",
            "ex": "The teacher's inspiration influenced my decision to study science.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "influence behavior",
                " influence decision",
                " influence development"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/2f714908-5954-492d-8013-bf656c69684f.webp",
            "Tips": [
                {
                    "title": "Wide Effect",
                    "description": "Used as a verb, 'influence' can refer to changes in a broad range of areas.",
                    "example": "A new law can influence many aspects of daily life.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Impersonal Force",
                    "description": "Sometimes used to suggest an almost mysterious guiding force.",
                    "example": "Market trends are influenced by many unpredictable factors.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "9c815af9-a809-48ac-8636-f36a4e689b04",
            "de": "A person or thing that can change other's behavior or thoughts",
            "ty": "noun",
            "ex": "He is a bad influence on my daughter.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "bad influence",
                " good influence",
                " positive influence"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9c815af9-a809-48ac-8636-f36a4e689b04.webp",
            "Tips": [
                {
                    "title": "Positive or Negative",
                    "description": "Remember 'influence' can be beneficial or harmful, depending on context.",
                    "example": "Peer pressure can be a negative influence on teenagers.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Personal Relationships",
                    "description": "Often used to describe the effect someone has on another's character or decisions.",
                    "example": "A mentor's influence can last a lifetime.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "64eea455-761e-4024-8de4-f40e7e54a252",
            "de": "The power to impact other people or things, especially in a secretive or indirect way",
            "do": "Political",
            "ty": "noun",
            "ex": "His influence in the political world is not visible, but it is very strong.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "political influence",
                " secret influence",
                " indirect influence"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/64eea455-761e-4024-8de4-f40e7e54a252.webp",
            "Tips": [
                {
                    "title": "Unseen Power",
                    "description": "Highlights the clandestine aspect of influence in politics or business.",
                    "example": "Lobbyists hold considerable influence over some lawmakers.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Strategic Hold",
                    "description": "Influence here is about strategic positioning and the power it confers.",
                    "example": "Major companies exert influence to shape industry regulations.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Authority": {
            "wordRoot": "Authority",
            "wordDefinition": "Authority refers to the power or right to make decisions and enforce laws or rules.\n\nIt is typically given to individuals or organizations by laws, regulations or formal position in a hierarchy. For example, a teacher has the authority to set rules and enforce them in the classroom.\n\nInfluence refers to the ability to affect or persuade someone's beliefs or actions without necessarily having formal power or authority.\n\nBoth authority and influence can be used to achieve a desired outcome, but authority is more about the use of power and control, while influence is more about persuasion and motivation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7b3c6097-5b25-40f0-ab74-13a84f45fc90.webp"
        },
        "Control": {
            "wordRoot": "Control",
            "wordDefinition": "Control usually means having power over someone or something, and being able to direct or regulate their actions or behavior.\n\nFor example, a teacher may have control over their students in a classroom because they are responsible for their learning and behavior.\n\nThe word influence means having the ability to affect or impact someone or something without necessarily having direct control.\n\nFor instance, a friend may have a positive influence on you, encouraging you to make good choices, but they likely don't have direct control over your decisions.\n\nEach word is applicable in different situations. Control is typically used when describing a situation where someone has explicit power over others to direct or regulate their behavior, while influence describes a more subtle form of impact or effect on someone or something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c2915bf5-2054-4b4d-8e53-a8b2ccbd1ff7.webp"
        },
        "Dominance": {
            "wordRoot": "Dominance",
            "wordDefinition": "Dominance refers to the exercise of power or control over others whereas influence refers to the ability to affect or persuade others without necessarily having power or control over them.\n\nDominance is often associated with situations where one person or group has authority over another and can use their position to make decisions or enforce particular behaviors.\n\nBoth dominance and influence can be applied in a variety of contexts, from personal relationships to business settings.\n\nHowever, dominance tends to be more coercive and unilateral while influence is more collaborative and two-way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9df1b2a8-c7ab-4bd1-9d2b-cf76d23bef31.webp"
        },
        "Effect": {
            "wordRoot": "Effect",
            "wordDefinition": "Effect refers to the result or consequence of something that has happened or been done. It's used to describe a specific outcome that has occurred due to a particular action or event.\n\nFor example, the effect of studying hard is getting good grades.\n\nTo sum it up, effect describes a specific outcome, while influence describes the impact something or someone has on another.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a3bfa0b2-2375-468a-9949-bf40ab48af5a.webp"
        },
        "Impact": {
            "wordRoot": "Impact",
            "wordDefinition": "Impact refers to the forceful result of a certain action or event.\n\nIt describes the immediate and direct effect of something. For example, if a car hits a wall, it will have an impact on the wall and leave a dent.\n\nImpact refers to the immediate effect of something while influence refers to the long-term effect that can shape and mold someone's attitudes or behavior.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7bff62c0-dff2-42c2-b9a1-4391d72ad5eb.webp"
        },
        "Leverage": {
            "wordRoot": "Leverage",
            "wordDefinition": "Leverage means using a strategic advantage to achieve a desired outcome or goal. It is applicable in situations where you want to use something to your advantage to get what you want.\n\nFor example, a business might leverage their strong financial position to negotiate better deals with suppliers.\n\nSo, essentially, influence is about persuasion, while leverage is about using strategic advantage.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88edae33-d93d-4ecf-a17d-442ed4c4e381.webp"
        },
        "Persuasion": {
            "wordRoot": "Persuasion",
            "wordDefinition": "Persuasion refers to the act of convincing or swaying someone to see things the way you see them, or take a particular action.\n\nInfluence is something that comes naturally or over time, while persuasion is a more deliberate or intentional effort to change someone's mind or behavior.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fe47966e-96da-43c1-a4fb-52d5d7526e7e.webp"
        },
        "Power": {
            "wordRoot": "Power",
            "wordDefinition": "Power is the ability to control or command someone or something.\n\nPower is often backed by authority, resources or force.\n\nBoth influence and power are applicable in different situations.\n\nPower is more applicable in organizational or institutional contexts where decisions need to be made or enforced.\n\nInfluence is the ability to persuade, while power is the ability to control.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/45a387c8-56f6-4ab7-b58f-1af8866b07d7.webp"
        },
        "Sway": {
            "wordRoot": "Sway",
            "wordDefinition": "Influence and sway are similar words that mean to have an effect on something or someone.\n\nHowever, the difference lies in the degree and type of effect. Influence implies having a positive impact and the ability to shape opinions or decisions, whereas sway suggests a more powerful or persuasive effect that can push someone to act or think a certain way, even if it is not in their best interest.\n\nFor example, a teacher may have an influence on their students by inspiring them to learn and achieve their goals. A public speaker may try to sway their audience by using emotional appeals or manipulating facts to convince them of a certain viewpoint, even if it is not based on truth or reason.\n\nInfluence is more subtle and constructive, while sway is more forceful and manipulative.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0bafecbb-bfb3-47f2-92a4-f71afb297379.webp"
        }
    },
    "videos": [
        {
            "Text": " norepinephrine creates a sort of tunnel vision, blocking out surrounding distractions, possibly even warping your sense of time, and enhancing your memory. This might explain why people never forget their first kiss. The idea of so much of our attraction being influenced by chemicals and evolutionary biology",
            "Title": "The science of...",
            "VideoId": "169N81xAffQ",
            "Controls": "start=225"
        },
        {
            "Text": " through the incredible influence of Ted and the widespread reaches of the internet people all around the world saw that talk and reached out to me with excitement and curiosity about spoken word poetry and it is without an ounce of exaggeration that I say my whole world changed probably the most",
            "Title": "Poetry makes people...",
            "VideoId": "WHbgZcur7ik",
            "Controls": "start=144"
        },
        {
            "Text": " though it isn't the exclusive cause of any of them. Posture can even influence your emotional state and your sensitivity to pain. So there are a lot of reasons to aim for good posture. But it's getting harder these days. Sitting in an awkward position for a long time can promote poor posture,",
            "Title": "The benefits of good...",
            "VideoId": "OyK0oE5rwFY",
            "Controls": "start=73"
        },
        {
            "Text": " So why do we remember some things and not others? Well, there are a few ways to influence the extent and effectiveness of memory retention. For example, memories that are formed in times of heightened feeling, or even stress, will be better recorded due to the hippocampus' link with emotion.",
            "Title": "The benefits of a good...",
            "VideoId": "gedoSfZvBgE",
            "Controls": "start=203"
        },
        {
            "Text": " Do you think they are fixed at birth, or that they can be developed, like a muscle? These beliefs matter because they can influence how you act when you're faced with setbacks. If you have a fixed mindset, meaning that you think your talents are locked in place, you might give up,",
            "Title": "3 tips to boost your...",
            "VideoId": "l_NYrWqUR40",
            "Controls": "start=127"
        },
        {
            "Text": " how they judge us and what the outcomes are. We tend to forget, though, the other audience that's influenced by our nonverbals, and that's ourselves. We are also influenced by our nonverbals, our thoughts and our feelings and our physiology. So what nonverbals am I talking about?",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=205"
        },
        {
            "Text": " including the brain. That's what inhalational anesthetics do. In Western medicine, diethyl ether was the first common one. It was best known as a recreational drug until doctors started to realize that people sometimes didn't notice injuries they received under the influence.",
            "Title": "How does anesthesia...",
            "VideoId": "B_tTymvDWXk",
            "Controls": "start=107"
        },
        {
            "Text": " really what happened we also knew that there was a melt pool quite drastically forming above where we were working every day the sun sun's influence was getting more and more the surface of the ice in some areas especially areas say where the the ice was that",
            "Title": "Filming Antarctica's...",
            "VideoId": "BtQhb8sWJNw",
            "Controls": "start=338"
        },
        {
            "Text": " cousin is doing research that could help inform us how we might influence the decisions of enough people to impact the world in a positive way I suppose getting sounds a bit like a self-help seminar but it is actually locust swarms",
            "Title": "Cannibal Bugs and...",
            "VideoId": "GaYA3sHfk5U",
            "Controls": "start=84"
        },
        {
            "Text": " that shapes a new member into a true believer. And most importantly, it uses both formal and informal systems of influence and control to keep members obedient, with little tolerance for internal disagreement or external scrutiny.",
            "Title": "Why do people join...",
            "VideoId": "kB-dJaCXAxA",
            "Controls": "start=134"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gordon-b-hinckley.webp",
            "Text": "When you touch the life of a man of this generation, that influence is felt through generations yet to come.",
            "Title": "American Clergyman",
            "Name": "Gordon B. Hinckley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/billie-eilish.webp",
            "Text": "I really like hip-hop and rap; that's my main influence. I really wanna be more of a hip-hop artist.",
            "Title": "American Singer",
            "Name": "Billie Eilish"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dolly-parton.webp",
            "Text": "I think your values are always influenced by your family and your community.",
            "Title": "American Singer",
            "Name": "Dolly Parton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mark-twain.webp",
            "Text": "Clothes make the man. Naked people have little or no influence on society.",
            "Title": "American Writer",
            "Name": "Mark Twain"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josh-billings.webp",
            "Text": "Woman's influence is powerful, especially when she wants something.",
            "Title": "American Comedian",
            "Name": "Josh Billings"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/salvador-dali.webp",
            "Text": "The secret of my influence has always been that it remained secret.",
            "Title": "Spanish Artist",
            "Name": "Salvador Dali"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-eliot.webp",
            "Text": "Blessed is the influence of one true, loving human soul on another.",
            "Title": "British Author",
            "Name": "George Eliot"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nelson-mandela.webp",
            "Text": "I have been influenced in my thinking by both west and east.",
            "Title": "South African Statesman",
            "Name": "Nelson Mandela"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/friedrich-nietzsche.webp",
            "Text": "The future influences the present just as much as the past.",
            "Title": "German Philosopher",
            "Name": "Friedrich Nietzsche"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bad-bunny.webp",
            "Text": "My style influences my music and everything around me.",
            "Title": "Puerto Rican Singer",
            "Name": "Bad Bunny"
        }
    ]
}