{
    "currentWord": {
        "wordRoot": "inspiration",
        "id": 13406,
        "phonemic": "ˌɪnspəˈreɪʃn|ˌɪnspəˈreɪʃn\r",
        "bigId": "a33c83e1-ae31-4d3e-94ae-1f1e5ae7291f",
        "wordForms": [
            "inspirations",
            "inspirational",
            "inspiration"
        ]
    },
    "senses": [
        {
            "id": "a33c83e1-ae31-4d3e-94ae-1f1e5ae7291f",
            "de": "Something that makes you want to do something or gives you an idea about what to do or create",
            "ty": "noun",
            "ex": "Her courage was an inspiration to all.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "source of inspiration",
                " find inspiration",
                " lose inspiration"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a33c83e1-ae31-4d3e-94ae-1f1e5ae7291f.webp",
            "Tips": [
                {
                    "title": "Motivational Trigger",
                    "description": "Often used for people, experiences, or events that drive you to start or continue an endeavor.",
                    "example": "The athlete's victory speech served as inspiration for my own training.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xad6yF0CIZMW67K84YGiufOTB2I.webp"
                },
                {
                    "title": "Creative Boost",
                    "description": "Refers to ideas or influences that fuel your creativity, particularly in arts and literature.",
                    "example": "The stunning landscape was my inspiration for the painting.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/bDbq4nfloQbuaRUooDMDD1PwLM.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "728ceccf-f88d-460e-a7a2-9a5d25a555a9",
            "de": "The process of being mentally stimulated to do or feel something, especially to do something creative",
            "ty": "noun",
            "ex": "I'm waiting for inspiration to strike.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "burst of inspiration",
                " creative inspiration",
                " draw inspiration"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/728ceccf-f88d-460e-a7a2-9a5d25a555a9.webp",
            "Tips": [
                {
                    "title": "Aha! Moments",
                    "description": "Describes when a great idea comes suddenly, often when least expected.",
                    "example": "In the shower, I had an inspiration for my novel's ending.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "f371410d-c541-4021-926a-d1071b0f47f5",
            "de": "A sudden brilliant or timely idea",
            "ty": "noun",
            "ex": "Then I had an inspiration.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "moment of inspiration",
                " flash of inspiration",
                " sudden inspiration"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f371410d-c541-4021-926a-d1071b0f47f5.webp",
            "Tips": [
                {
                    "title": "Spark of Genius",
                    "description": "Used to express when an idea is seen as exceptionally clever or original.",
                    "example": "Einstein's theory of relativity was a true inspiration in physics.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "1ea0bf61-3423-49f6-9f11-5796665b3557",
            "de": "The drawing in of breath; inhalation",
            "do": "Medical",
            "ty": "noun",
            "ex": "In patients with asthma, inspiration may be laboured.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "deep inspiration",
                " forced inspiration",
                " inspiration capacity"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1ea0bf61-3423-49f6-9f11-5796665b3557.webp",
            "Tips": [
                {
                    "title": "Medical Term",
                    "description": "In a medical context, it specifically refers to the process of taking air into the lungs.",
                    "example": "The doctor checked if my inspiration was normal during the check-up.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Metaphorical",
                    "description": "Unlike other meanings, in medical terms, it's a literal and physical action.",
                    "example": "Asthma patients may find inspiration difficult during an attack.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Creativity": {
            "wordRoot": "Creativity",
            "wordDefinition": "Creativity is the ability to come up with new and original ideas, while inspiration is the trigger or spark that ignites those ideas.\n\nIn other words, creativity is the skill or talent to create something new, whereas inspiration is the thing that motivates or influences that creation.\n\nCreativity can be applied to many things like art, writing, music, and innovation, where one can use their imagination to create something from scratch.\n\nIn conclusion, creativity is the skill, and inspiration is the motivating force that fuels that skill.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2342af3f-11be-4f1c-826e-ddcdfab31f20.webp"
        },
        "Encourage": {
            "wordRoot": "Encourage",
            "wordDefinition": "Encourage means to give someone confidence or support and to motivate them to keep going towards their goal even when it's tough.\n\nFor example: My parents encouraged me to keep studying for my exams even when I felt like giving up.\n\nBoth words are positive and can be used to motivate someone to achieve their goals, but encourage focuses more on the support and motivation to keep going, while inspiration focuses more on the creativity or imagination that someone can draw from in order to achieve their goals.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/17a8143e-892b-4810-ad86-3856d86f8048.webp"
        },
        "Impetus": {
            "wordRoot": "Impetus",
            "wordDefinition": "Impetus refers to a force that causes something to start or happen.\n\nIt can be thought of as a push or a motivation to get something done. For example, a student may receive an impetus to study harder after receiving a low grade on a test.\n\nImpetus is applicable when talking about something that requires a push to start or get going, while inspiration is used when talking about something that requires creativity or a new idea.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/97f18e1a-3a84-4204-a68b-de7431980d0c.webp"
        },
        "Influence": {
            "wordRoot": "Influence",
            "wordDefinition": "Influence means to impact or affect someone or something, often in a powerful way.\n\nInfluence refers to the ability to change or shape someone's thoughts, beliefs, and actions.\n\nInfluence refers to the impact one has on others, while inspiration refers to the process of being motivated and excited by something.\n\nInfluence can be both positive and negative, while inspiration is generally seen as a positive force that leads to creativity and productivity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0d79f0c3-b806-4004-b5a8-ff1f1cbd4e6e.webp"
        },
        "Innovate": {
            "wordRoot": "Innovate",
            "wordDefinition": "Innovate means to come up with a new idea or invent something that hasn't existed before. It is applicable when someone is trying to create something new or improve upon something that already exists.\n\nInnovate refers to the creation of something new, while inspiration refers to the feeling that motivates that creation process.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3220c28a-bcce-4153-a2e7-57b284490bfc.webp"
        },
        "Motivate": {
            "wordRoot": "Motivate",
            "wordDefinition": "Motivate means to give someone a reason to take action toward a specific goal or outcome.\n\nThe main difference is that inspiration is about ideas and creative thinking, while motivation is about taking action and working towards a specific goal.\n\nBoth are important and applicable in different situations. For example, a teacher might inspire her students with a new and exciting class project, while a coach might motivate his team to work hard and win a game.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b7b90314-6dad-440d-9a93-4ea5a1a54b09.webp"
        },
        "Spark": {
            "wordRoot": "Spark",
            "wordDefinition": "Spark refers to a sudden burst of energy or excitement that can help someone start something new or make a change.\n\nA spark is typically seen as a more immediate and short-term source of motivation.\n\nBoth words can be applicable in different situations. For example, a writer might find inspiration from reading a book or observing people, while a person trying to get motivated to exercise might need a spark to get started.\n\nInspiration tends to be more long-lasting and deeper, while a spark tends to be more immediate and surface level.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/45cecc00-cfb1-4f45-8d05-f8db55dac1fb.webp"
        },
        "Stimulus": {
            "wordRoot": "Stimulus",
            "wordDefinition": "Stimulus refers to an external factor or event that triggers a response or reaction from an individual.\n\nIt is often used in the context of physical or physiological responses to external stimuli such as light, sound, or touch.\n\nStimulus is a more scientific and objective term and is often used in research or experimentation.\n\nInspiration is a source of creative ideas and thoughts that come from within, while stimulus is an external force or trigger that causes a physical or mental response.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/890df04b-8835-4f9c-97ba-a4bb452fa884.webp"
        }
    },
    "videos": [
        {
            "Text": " which determine our roles in life. Some thinkers have gone on to credit the idea of the noble lie as a prototype for 20th century propaganda, and the philosopher king as inspiration for the dictators that used them. Should a few bad ideas tarnish Plato's status as one of the greatest philosophers in history?",
            "Title": "Plato’s best (and worst)...",
            "VideoId": "jLesc5lITvo",
            "Controls": "start=229"
        },
        {
            "Text": " assignment inspiration is about understanding the world around you and capturing that as a photographer and having it resonate and inspire people for this assignment you will be judged on your ability to photograph images that convey three different ideas these quests were really inspired from",
            "Title": "Assignment: Inspiration...",
            "VideoId": "gur6jAxgVag",
            "Controls": "start=46"
        },
        {
            "Text": " is it's the grieves are amazing but the passion they've inspired in the greek guardians that we have here they're such an inspiration to us because they've dedicated their whole lives to this place and i like the way they're all taking different approaches so pablo with his education",
            "Title": "Protecting the Hooded...",
            "VideoId": "cPO_9umcg9M",
            "Controls": "start=60"
        },
        {
            "Text": " but we also need to remember that innovation, ingenuity, inspiration -- these things come when we broaden our field of vision when we step back when we zoom out. And I can't think of a better way to do this than by studying the universe around us. Thanks.",
            "Title": "What we can learn from...",
            "VideoId": "kpzEsgSBUqc",
            "Controls": "start=376"
        },
        {
            "Text": " that would, hopefully, chime every hour. All he had to help him was a pocket watch for inspiration and his own calculations. And yet, his careful engineering worked. Striking clocks had already been around for hundreds of years,",
            "Title": "The exceptional life of...",
            "VideoId": "DKnwyVR4P88",
            "Controls": "start=20"
        },
        {
            "Text": " to speak with us today and keep up the absolutely inspirational work thank you so much pablo now thank you so much for your interest on our work and we welcome anybody that is interested on penguins and wildlife",
            "Title": "Protecting a Penguin...",
            "VideoId": "Qrm_iD-uAco",
            "Controls": "start=505"
        },
        {
            "Text": " and by education in ritual, literature, and history. A person cultivated in this way works to help others, guiding them by moral inspiration rather than brute force. To put his philosophy into practice,",
            "Title": "Who was Confucius? -...",
            "VideoId": "wFt_VGG0kJU",
            "Controls": "start=89"
        },
        {
            "Text": " Chris For many years, you've been an inspiration to others. Who or what inspires you and why? Good question. Chris, let me tell you, and that is the truth, each time when I free a child,",
            "Title": "Kailash Satyarthi: How...",
            "VideoId": "HI7zfpitZpo",
            "Controls": "start=1045"
        },
        {
            "Text": " monkeys will survive in the long term. And your work is so inspirational, but how did you first get into conserving Brown-headed spider monkey and why are they so important to you?",
            "Title": "The Spider Monkeys of...",
            "VideoId": "JZdBZIqYFL4",
            "Controls": "start=418"
        },
        {
            "Text": " the player who I admired and I respected so much and I learned so much from his games it gave me inspiration and gave me energy too",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=257"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gilbert-k-chesterton.webp",
            "Text": "Youth is the period in which a man can be hopeless. The end of every episode is the end of the world. But the power of hoping through everything, the knowledge that the soul survives its adventures, that great inspiration comes to the middle-aged.",
            "Title": "English Writer",
            "Name": "Gilbert K. Chesterton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/taylor-swift.webp",
            "Text": "Sometimes I write about my own life. And sometimes I write about situations I see my friends going through. Sometimes I write about a scene I saw in a movie. I take inspiration from all different places.",
            "Title": "American Singer",
            "Name": "Taylor Swift"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ralph-waldo-emerson.webp",
            "Text": "It is a fact often observed, that men have written good verses under the inspiration of passion, who cannot write well under other circumstances.",
            "Title": "American Philosopher",
            "Name": "Ralph Waldo Emerson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nicole-maines.webp",
            "Text": "The most inspirational person in my life has been my mother.",
            "Title": "American Actress",
            "Name": "Nicole Maines"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shakira.webp",
            "Text": "I adore my dad. He's a 78-year-old man and my inspiration.",
            "Title": "Musician",
            "Name": "Shakira"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/enrique-iglesias.webp",
            "Text": "My inspiration are the woman, friendship, and loneliness.",
            "Title": "Spanish Musician",
            "Name": "Enrique Iglesias"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tony-robbins.webp",
            "Text": "In life you need either inspiration or desperation.",
            "Title": "American Speaker",
            "Name": "Tony Robbins"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/giles-deacon.webp",
            "Text": "The natural world is a source of inspiration.",
            "Title": "British Designer",
            "Name": "Giles Deacon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hayao-miyazaki.webp",
            "Text": "I get inspiration from my everyday life.",
            "Title": "Japanese Director",
            "Name": "Hayao Miyazaki"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-starlin.webp",
            "Text": "Life itself is inspiration.",
            "Title": "American Artist",
            "Name": "Jim Starlin"
        }
    ]
}