{
    "currentWord": {
        "wordRoot": "invest",
        "id": 7382,
        "phonemic": "ɪnˈvest|ɪnˈvest\r",
        "bigId": "7f73624c-e228-43c0-99e9-4672fc6b86d8",
        "wordForms": [
            "invests",
            "investing",
            "invested",
            "reinvest",
            "invest"
        ]
    },
    "senses": [
        {
            "id": "7f73624c-e228-43c0-99e9-4672fc6b86d8",
            "de": "To put your money into something to make more money in the future",
            "ty": "verb",
            "ex": "I decided to invest my money in real estate.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "invest in stocks",
                " invest in a business",
                " invest in real estate"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7f73624c-e228-43c0-99e9-4672fc6b86d8.webp",
            "Tips": [
                {
                    "title": "Financial Growth",
                    "description": "Used to talk about spending money with the intention of making a profit.",
                    "example": "I'm planning to invest in a start-up company.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/H0jfNVyj2jATQtym85ZrKnnQ.webp"
                },
                {
                    "title": "Long-Term Commitment",
                    "description": "Implies waiting for a while before seeing any benefits or profit.",
                    "example": "Investing in your education may take time but is worthwhile in the long run.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/2aCHIAdkEa0yHbkZCXwfqu3Vd8.webp"
                },
                {
                    "title": "Research Required",
                    "description": "Before investing money, one should research to make informed decisions.",
                    "example": "Always do your homework before you decide to invest in the stock market.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/dqEoGZveh6fBPj5B3nQzTbZ71HQ.webp"
                }
            ]
        },
        {
            "id": "9ba2ed1f-5303-42eb-9ff9-92c5028112ad",
            "de": "To give time, effort, or qualities to something that will be useful or will make something successful",
            "ty": "verb",
            "ex": "She invested a lot of time in helping her daughter to study.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "invest time",
                " invest effort",
                " invest resources"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9ba2ed1f-5303-42eb-9ff9-92c5028112ad.webp",
            "Tips": [
                {
                    "title": "Personal Development",
                    "description": "Refers to investing time or effort in improving oneself or helping others grow.",
                    "example": "I invest hours each week in learning a new language.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Physical",
                    "description": "Investing doesn't just mean money; it can also be intangible resources.",
                    "example": "She invested her creativity into designing the poster.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "a79d366b-ff09-4212-9fee-0683d1e34829",
            "de": "To officially give someone a title or position",
            "do": "Legal",
            "ty": "verb",
            "ex": "He was invested as chief of the tribe.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "invest with power",
                " invest with authority",
                " invest with a title"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a79d366b-ff09-4212-9fee-0683d1e34829.webp",
            "Tips": [
                {
                    "title": "Formality and Regality",
                    "description": "Used in formal ceremonies where someone is granted a new rank or title.",
                    "example": "The knight was invested with a new title by the queen.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Symbolic Actions",
                    "description": "The act often includes symbolic gestures such as presenting a piece of clothing.",
                    "example": "The new judges were invested with their robes in the ceremony.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "837c59e1-3183-472c-b413-6552a3db52dd",
            "de": "To surround a place with military forces to stop people or supplies getting in or out",
            "do": "Military",
            "ty": "verb",
            "ex": "The city was invested for over a month.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "invest the city",
                " invest the castle",
                " invest the fort"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/837c59e1-3183-472c-b413-6552a3db52dd.webp",
            "Tips": [
                {
                    "title": "Military Strategy",
                    "description": "Refers to a military tactic of surrounding an area to cut off supplies.",
                    "example": "The general decided to invest the fortress to force a surrender.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Prolonged Activity",
                    "description": "Investing a place can last a long time and requires considerable resources.",
                    "example": "Their forces invested the town for weeks, waiting for the enemy to weaken.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Back": {
            "wordRoot": "Back",
            "wordDefinition": "Back typically refers to supporting or endorsing something or someone, while invest refers to putting money, time, or resources into something with the expectation of gaining a benefit or return in the future.\n\nFor example, if you say you are going to back a political candidate, it means you are going to support them by promoting their ideas and encouraging others to vote for them.\n\nBack is more applicable when discussing support or endorsement, while invest is more applicable when discussing putting resources towards a potential benefit or return.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f68cc801-375f-4772-9cc8-c2b2012e50fa.webp"
        },
        "Capitalize": {
            "wordRoot": "Capitalize",
            "wordDefinition": "Capitalize means to provide financial resources (usually in the form of money) to start or expand a business, while invest means to put money into a company or project with the expectation of making a profit.\n\nCapitalizing is more applicable when a new business needs funds to get started, while investing is more applicable when an established company is seeking additional funding for growth or expansion.\n\nIn short, capitalizing is about providing the initial funds for a business, while investing is about growing those funds over time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/adb06985-d77b-4ea2-abd1-0c9c36676116.webp"
        },
        "Endow": {
            "wordRoot": "Endow",
            "wordDefinition": "Endow means to provide a permanent source of income or financial support to someone or something, usually through a donation or bequest.\n\nThe main difference between endow and invest is that endowment is a one-time donation, while investment involves ongoing engagement and monitoring.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d2fe25ba-c8d8-4766-9ee0-42aed8180ae5.webp"
        },
        "Finance": {
            "wordRoot": "Finance",
            "wordDefinition": "Finance refers to managing money, such as budgeting, borrowing, and saving. It involves making decisions about how to use and allocate financial resources.\n\nIn simpler terms, finance is about managing money while investing is about making money grow. Finance is applicable in daily budgeting and spending decisions while investing is applicable for long-term financial planning and wealth building.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c96db670-6025-4a31-ad81-31e1558cc5ce.webp"
        },
        "Fund": {
            "wordRoot": "Fund",
            "wordDefinition": "Fund refers to money that has been contributed by a group of people or an organization for a specific purpose.\n\nThis money is usually used to support a project, cause or organization. For example, a government may fund a research project or a charity may have a fundraising campaign to fund their activities.\n\nInvesting involves taking risks with the expectation of receiving a return that is greater than the amount invested. For example, an individual may invest in stocks, mutual funds, or real estate with the goal of earning a profit.\n\nFund describes the act of providing money for a specific purpose, while invest describes the act of using money to potentially earn a profit.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/76ee58cc-682d-4ab3-ae9d-8fbb4f6713db.webp"
        },
        "Purchase": {
            "wordRoot": "Purchase",
            "wordDefinition": "Purchasing means buying something for a specific purpose or immediate use. For example, buying food, clothes or a car.\n\nInvesting is usually a long-term commitment and involves some level of risk, whereas purchasing is typically a short-term transaction with a more immediate benefit.\n\nIt's important to research and understand the risks before making an investment, but this is less of a concern when making a purchase.\n\nIn summary, investing is about putting money into something with the hope of gaining a benefit later on, while purchasing is about buying something for immediate use or consumption.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/673f3ed4-9aaa-409c-90eb-254062ea20c9.webp"
        },
        "Sponsor": {
            "wordRoot": "Sponsor",
            "wordDefinition": "Sponsor usually refers to providing financial support to an individual or organization for a specific event or project, such as sponsoring a charity walk or a music festival.\n\nThe sponsor may get some promotion or benefit from the sponsored event, but it's usually not with an expectation of receiving any financial return.\n\nOverall, while investing typically involves buying a stake in a company for a financial return, sponsoring is usually about supporting a cause or event with some kind of financial contribution.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9f8ca4db-b08e-40bc-b785-ec6162f8e2c0.webp"
        },
        "Support": {
            "wordRoot": "Support",
            "wordDefinition": "Support refers to providing assistance or encouragement to something or someone. This can take many forms, such as emotional support, financial support, or practical help.\n\nIn simple terms, investing is about making money, while support is about helping others or something you care about. Both are important in their own ways and can be applicable in different situations.\n\nFor example, you might invest money in a business that you believe in, but you might also offer your support by volunteering your time or donating to a nonprofit organization.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1f630745-f3a5-4454-92eb-c75d98a5f411.webp"
        }
    },
    "videos": [
        {
            "Text": " After our basic needs are met, we'd theoretically decide to invest in choices only to the point they're useful or enjoyable. Of course, how effectively any of us manage to maximize utility in real life is another matter. But it helps to remember that the ultimate source of value comes from us, the needs we share,",
            "Title": "The paradox of value -...",
            "VideoId": "e7S8jWh6AEs",
            "Controls": "start=186"
        },
        {
            "Text": " You know all those TED-Ed videos you love? The beautiful animations that help you learn new things? That experience is free for you, but it's really expensive for us, and that's okay. Our mission is to invest in thoughtful people, but we need some of you to invest in us. Why?",
            "Title": "TED-Ed is on Patreon! We...",
            "VideoId": "1kSEmgIJNqE",
            "Controls": "start=0"
        },
        {
            "Text": " Since we saw how difficult it was to fish there, our generation, my brothers and I were the ones who immediately said yes. We needed to change this, because fishing was very difficult. We invested a lot and we practically didn't get anything back. Now we work in eco-tourism.",
            "Title": "How One Community Saved...",
            "VideoId": "h4HzJSUPlH4",
            "Controls": "start=147"
        },
        {
            "Text": " In fact, any conversation about global poverty that doesn't include the problem of violence must be deemed not serious. And secondly, we have to begin to seriously invest resources and share expertise to support the developing world",
            "Title": "Gary Haugen: The hidden...",
            "VideoId": "ofsncCF9O_U",
            "Controls": "start=1011"
        },
        {
            "Text": " then they don't survive so it's worth investing the energy in being right on the inside thigh it's worth the energy invest in trying to protect it spot is the more affectionate one stripe is the naughtier one but when it comes to",
            "Title": "Top 5 Tiger Moments PIPE...",
            "VideoId": "meQ8JFGXwO4",
            "Controls": "start=1033"
        },
        {
            "Text": " and pull of affection was emotional whiplash you're wonderful you're horrible I love you I hate you I had to protect myself by believing that nothing meant anything so if you can't invest in anything the other person says what",
            "Title": "How to deal with...",
            "VideoId": "v4P2Qwh1QCU",
            "Controls": "start=549"
        },
        {
            "Text": " excellent life support system but paradoxically its success will ultimately depend on the ease with which it can be broken the time comes when a chick must break free some species invested time building up",
            "Title": "The Miracle of Hatching...",
            "VideoId": "7uWe0FMAq1E",
            "Controls": "start=3"
        },
        {
            "Text": " If you have dreams, it's your responsibility to make them happen. Yes, it may be hard to find talent. Yes, the market may be bad. But if no one invested in your idea, if no one bought your product,",
            "Title": "5 ways to kill your...",
            "VideoId": "sR6P5Qdvlnk",
            "Controls": "start=216"
        },
        {
            "Text": " investing the energy in being right on the inside thigh it's worth the energy invest in trying to protect it spot is the more affectionate one stripe is the naughtier one but when it comes to food",
            "Title": "Best Tiger Cub Moments...",
            "VideoId": "qg35FMoOwb0",
            "Controls": "start=197"
        },
        {
            "Text": " And if they don't eat, then they don't survive, so it's worth investing the energy in being Right on the inside thigh. It's worth the energy... invest in trying to protect it.",
            "Title": "Putting the Cub's Teeth...",
            "VideoId": "EQ_4dicv7aQ",
            "Controls": "start=193"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michelle-obama.webp",
            "Text": "When I get up and work out, I'm working out just as much for my girls as I am for me, because I want them to see a mother who loves them dearly, who invests in them, but who also invests in herself. It's just as much about letting them know as young women that it is okay to put yourself a little higher on your priority list.",
            "Title": "American First Lady",
            "Name": "Michelle Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/florence-pugh.webp",
            "Text": "What audiences love with series is that they can invest in characters for such a long period of time, and it's the same for actors. You can truly tell your story; then it's done.",
            "Title": "English Actress",
            "Name": "Florence Pugh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/g-eazy.webp",
            "Text": "Something I stand for is being brave enough to invest in creative ideas that I firmly believe in and bringing those to life.",
            "Title": "American Musician",
            "Name": "G-Eazy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vivienne-westwood.webp",
            "Text": "I just think people should invest in the world. Don't invest in fashion, but invest in the world.",
            "Title": "English Designer",
            "Name": "Vivienne Westwood"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/esther-dyson.webp",
            "Text": "My life is like a series of comic strips, which is why I like investing: I really like new stuff.",
            "Title": "American Businesswoman",
            "Name": "Esther Dyson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shweta-tripathi.webp",
            "Text": "I am always physically and emotionally invested in the characters I play.",
            "Title": "Indian Actress",
            "Name": "Shweta Tripathi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/song-hye-kyo.webp",
            "Text": "I await a project where I'd have to deeply invest my emotions in.",
            "Title": "South Korean Actress",
            "Name": "Song Hye-kyo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/logic.webp",
            "Text": "I've invested a couple million into touring, and that's paid off.",
            "Title": "American Musician",
            "Name": "Logic"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-haden-church.webp",
            "Text": "I invested, and I protected myself, so I enjoy that freedom.",
            "Title": "American Actor",
            "Name": "Thomas Haden Church"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jill-ellis.webp",
            "Text": "World Cups aren't moments to invest in players.",
            "Title": "British Coach",
            "Name": "Jill Ellis"
        }
    ]
}