{
    "currentWord": {
        "wordRoot": "itinerary",
        "id": 20527,
        "phonemic": "aɪˈtɪnərəri|aɪˈtɪnəreri\r",
        "bigId": "e7b9a8b2-916e-4f0e-b419-83adec948252",
        "wordForms": [
            "itineraries",
            "itinerary"
        ]
    },
    "senses": [
        {
            "id": "e7b9a8b2-916e-4f0e-b419-83adec948252",
            "de": "A detailed plan or route of a journey or tour",
            "ty": "noun",
            "ex": "They set a detailed itinerary for their world trip.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "travel itinerary",
                " detailed itinerary",
                " tour itinerary"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e7b9a8b2-916e-4f0e-b419-83adec948252.webp",
            "Tips": [
                {
                    "title": "Travel Planning",
                    "description": "An itinerary outlines stops and activities; helpful for time management on trips.",
                    "example": "Our Italy itinerary included Rome, Venice, and Florence over ten days.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/srbR17HSfzeiwHlCoXp8jDpKzVo.webp"
                },
                {
                    "title": "Not Binding",
                    "description": "Itineraries are plans, but they can change. They're not strict like schedules.",
                    "example": "Despite our itinerary, we stayed an extra day in Paris because we loved it.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/IW0tygaDBcQ4gKvEDDVMxPa8lqw.webp"
                },
                {
                    "title": "Tour Specific",
                    "description": "When on guided tours, the itinerary is preset by the company.",
                    "example": "The safari's itinerary included a sunrise game drive on day three.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/920lX7bfgVQJPsEi0cIW2Ooc.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "a6b75dc2-8b81-4b2f-9981-b410301beb33",
            "de": "A document or guidebook outlining the details of a trip or tour",
            "ty": "noun",
            "ex": "Our travel agent provided us with an itinerary to guide us through our vacation.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "printed itinerary",
                " provided itinerary",
                " following an itinerary"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a6b75dc2-8b81-4b2f-9981-b410301beb33.webp",
            "Tips": [
                {
                    "title": "Detailed Guide",
                    "description": "An itinerary as a document has information like dates, times, locations, and activities.",
                    "example": "The itinerary had all our hotel bookings and train schedules listed.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Travel Reference",
                    "description": "Use it as a quick reference during travel to remind you of your plans.",
                    "example": "Whenever we were unsure, we checked our itinerary for the next stop.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Preparation Tool",
                    "description": "Reading your itinerary beforehand helps you prepare for the journey.",
                    "example": "She read her itinerary carefully to pack clothes for the trip's activities.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Agenda": {
            "wordRoot": "Agenda",
            "wordDefinition": "An agenda is a list of items or topics to be discussed or accomplished at a meeting, event, or gathering. It outlines the goals and objectives of the meeting or event and helps to keep everyone on track and organized.\n\nAn agenda is applicable to meetings or events where a plan of discussion is needed, while an itinerary is applicable to trips or vacations that require planning and scheduling of activities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/45169f1a-fbcb-488e-b05d-04b752cf348c.webp"
        },
        "Journey": {
            "wordRoot": "Journey",
            "wordDefinition": "An itinerary is a planned schedule of events or places that someone intends to visit or do during a trip or journey. It includes the timing, destinations, and sometimes modes of transportation.\n\nA journey is the actual experience of traveling from one place to another, especially when it is long, difficult, or enjoyable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/05974bd2-2a72-45a9-80dd-09bdb0f2794f.webp"
        },
        "Path": {
            "wordRoot": "Path",
            "wordDefinition": "A path refers to a route or track that someone or something follows. It may involve physical movement, such as hiking or walking, but it can also be used metaphorically to describe someone's journey in life.\n\nAn itinerary tells you where you're going and what you'll do there, while a path is the actual route you take to get there, whether it's a physical journey or a personal journey.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8e75816c-7f24-4135-920e-0b5e78a5019c.webp"
        },
        "Programme": {
            "wordRoot": "Programme",
            "wordDefinition": "A program refers to a schedule of events or activities that will take place.\n\nPrograms are useful for giving attendees an idea of what to expect and can help them plan their time accordingly.\n\nIn summary, itineraries are used for travel arrangements and programs are used for scheduling events.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/919d9ae3-dc1f-410e-bd00-e4fe082d4b0e.webp"
        },
        "Route": {
            "wordRoot": "Route",
            "wordDefinition": "A route is the path or course taken to reach a destination. It may involve specific directions or landmarks to follow but does not typically include a detailed schedule or list of activities.\n\nAn itinerary is more focused on what you will do, while a route is more focused on how you will get there.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c2b448e8-f5f9-4e6d-a713-cebdbf6261db.webp"
        },
        "Schedule": {
            "wordRoot": "Schedule",
            "wordDefinition": "Schedule refers to a plan or timetable that shows when certain tasks or events will happen.\n\nIt is used in a variety of contexts, such as work schedules, school schedules, and sports schedules. For example, your schedule for a typical school day might include classes in the morning, lunch break in the afternoon, and extracurricular activities in the evening.\n\nItinerary refers to a planned route or journey, while schedule refers to a plan or timetable for when certain events will happen.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d83185bc-c648-42d4-9464-9bdc1e310654.webp"
        },
        "Timetable": {
            "wordRoot": "Timetable",
            "wordDefinition": "Itinerary and timetable are two words that are used to plan a trip or schedule, but they have a slight difference.\n\nA timetable refers to a schedule of events that occur at specific times, such as a bus, train or flight schedule or a school class schedule.\n\nTimetable is often used to organize people's daily routines or schedules. It tells you when and where an event will occur and provides a timeline for the day.\n\nTimetables are often used for routine tasks, such as commuting to work or school, or to plan a meeting schedule.\n\nTo summarize, an itinerary is a detailed plan that covers an overall trip, while a timetable is a schedule that helps you plan your daily routine or schedule for a specific event.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/53a01b90-0189-4f33-8635-13f89fda3d2c.webp"
        }
    },
    "videos": [
        {
            "Text": " because they're going to have to live with radioactivity their whole life. And so what we did with them is that we'd discuss the data we collected that day, and talk about where we should be going next -- strategy, itinerary, etc",
            "Title": "How I Teach Kids to Love...",
            "VideoId": "jAemh_JxgOk",
            "Controls": "start=378"
        },
        {
            "Text": " shift different types of Wildlife become more or less plentiful so it's worth keeping a must-see species list in mind when planning your itinerary",
            "Title": "The Galapagos Islands...",
            "VideoId": "6UqiDs-_1A8",
            "Controls": "start=69"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dolores-oriordan.webp",
            "Text": "I was a full-time mom for seven years. You go back on tour, you're back in hotels, you're ordering room service, and you're getting an itinerary slipped under your door every,day. You're kind of thinking, 'Did I go home for seven years, or was that just a dream?",
            "Title": "Irish Musician",
            "Name": "Dolores O'Riordan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/katy-tur.webp",
            "Text": "A traditional presidential campaign has a media bus with the candidate's name on it and an itinerary days in advance. Trump has a plane with his name on it (that we aren't invited on) and an itinerary that often mutates daily, along with his talking points.",
            "Title": "American Journalist",
            "Name": "Katy Tur"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ashley-jensen.webp",
            "Text": "My husband is always telling me: 'We're on holiday - we don't need to have an itinerary!' But I always want to see as much as I can. Sometimes, I come back from holiday needing a holiday.",
            "Title": "Scottish Actress",
            "Name": "Ashley Jensen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-rodrick.webp",
            "Text": "TMZ' took the illusion of privacy away. Now the paranoid star just assumes someone is always there. Decoy cars and false itineraries are floated to throw 'TMZ' off the scent.",
            "Title": "American Journalist",
            "Name": "Stephen Rodrick"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/margaret-brennan.webp",
            "Text": "A lot of the traveling that I have done is for work. I've been to spots in Afghanistan and Iraq that are lovely, too, but I wouldn't put those on travel itineraries.",
            "Title": "",
            "Name": "Margaret Brennan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/peter-landesman.webp",
            "Text": "The itinerary of most antiquities from their source - tomb, temple, quarry - to the shelves of museums or private collectors is murky and often purposely concealed.",
            "Title": "American Director",
            "Name": "Peter Landesman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lewis-howes.webp",
            "Text": "Every successful sports season I had included detailed daily itineraries. We received one in the morning and one before practice, and they set us up to win.",
            "Title": "American Author",
            "Name": "Lewis Howes"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/brook-lopez.webp",
            "Text": "In my family, Robin loves planning the trips. He does the itineraries and everything, always sends them out in a mass text.",
            "Title": "American Basketball Player",
            "Name": "Brook Lopez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-erickson.webp",
            "Text": "Memory runs by its own itinerary, departing and arriving at stations of the past on its own schedule.",
            "Title": "American Novelist",
            "Name": "Steve Erickson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/freema-agyeman.webp",
            "Text": "I constantly make lists and itineraries and then can't stick to any of them.",
            "Title": "British Actress",
            "Name": "Freema Agyeman"
        }
    ]
}