{
    "currentWord": {
        "wordRoot": "judge",
        "id": 10118,
        "phonemic": "dʒʌdʒ|dʒʌdʒ\r",
        "bigId": "efa08fb7-7b0b-4d67-92da-fb5ee91731a4",
        "wordForms": [
            "judges",
            "judging",
            "judged",
            "judge"
        ]
    },
    "senses": [
        {
            "id": "efa08fb7-7b0b-4d67-92da-fb5ee91731a4",
            "de": "To form an opinion or conclusion about something or someone.",
            "ty": "verb",
            "ex": "The teacher judged the students' essays.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "judge quickly",
                " judge harshly",
                " judge objectively"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/efa08fb7-7b0b-4d67-92da-fb5ee91731a4.webp",
            "Tips": [
                {
                    "title": "Context Matters",
                    "description": "The context can influence whether 'judge' implies quick, superficial assessment or a thoughtful conclusion.",
                    "example": "I shouldn't judge her choice without knowing the reasons.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/pZmaTJLvr52Lj2VqnwjXmcylDF0.webp"
                },
                {
                    "title": "Avoid Snap Judgments",
                    "description": "'Judge' often carries a negative connotation when decisions are made too quickly.",
                    "example": "Don't judge a book by its cover.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FraUn2HOAbReMN2tcMTPrYyA0g4.webp"
                },
                {
                    "title": "Neutrality Implied",
                    "description": "Using 'judge' can imply an attempt at neutrality or absence of bias.",
                    "example": "The committee judged all entries on merit alone.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/686b41DmgEEvvAbPH4htGEo4hs.webp"
                }
            ]
        },
        {
            "id": "205f7bc4-5e34-4436-9b0b-b07f100597ad",
            "de": "To decide a result in a competition or contest.",
            "ty": "verb",
            "ex": "He was asked to judge the singing competition.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "judge competition",
                " judge contest",
                " judge event"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/205f7bc4-5e34-4436-9b0b-b07f100597ad.webp",
            "Tips": [
                {
                    "title": "Expertise Required",
                    "description": "To 'judge' a competition often requires subject matter expertise or an artistic sense.",
                    "example": "As a renowned chef, he was invited to judge the cook-off.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Impartiality Expected",
                    "description": "Judging a contest implies fairness and lack of bias towards the competitors.",
                    "example": "She struggled to judge the contest impartially, as her brother was participating.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "12c96f9e-f8f8-40cd-91ce-f6f9b7e2b654",
            "de": "A person who has the power to make decisions on matters brought before a court of law.",
            "do": "Legal",
            "ty": "noun",
            "ex": "The judge will soon announce his verdict.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "judge presiding",
                " judge rules",
                " judge declares"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/12c96f9e-f8f8-40cd-91ce-f6f9b7e2b654.webp",
            "Tips": [
                {
                    "title": "Authority Figure",
                    "description": "As a noun, 'judge' refers to someone with official authority, especially in a legal context.",
                    "example": "The judge dismissed the irrelevant testimony.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Symbol of Justice",
                    "description": "A judge symbolizes law and order, and is expected to uphold fairness and justice.",
                    "example": "The judge is the guardian of justice in the courtroom.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5162406e-64a7-4a8f-928b-7d08dc2a64f3",
            "de": "To estimate or determine something, such as a number or value.",
            "ty": "verb",
            "ex": "Can you judge the distance between these two points?",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "judge distance",
                " judge quantity",
                " judge value"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5162406e-64a7-4a8f-928b-7d08dc2a64f3.webp",
            "Tips": [
                {
                    "title": "Assessment Skill",
                    "description": "Judging a number or value requires skill or experience to estimate accurately.",
                    "example": "He judged the weight of the fish at 15 pounds.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Guesswork Involved",
                    "description": "Sometimes 'judge' indicates an educated guess rather than a precise calculation.",
                    "example": "Can you judge how long we'll need to wait?",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "40178c33-3681-4fd6-9b86-64d7d1e8b6da",
            "de": "To make a moral judgement or find fault in someone or their actions.",
            "ty": "verb",
            "ex": "Who are you to judge my actions?",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "judge harshly",
                " judge morally",
                " judge unfairly"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/40178c33-3681-4fd6-9b86-64d7d1e8b6da.webp",
            "Tips": [
                {
                    "title": "Moral Implication",
                    "description": "'Judge' can imply moral superiority, often viewed negatively in casual conversation.",
                    "example": "He judged my decision, though he wasn't in my shoes.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subjective Nature",
                    "description": "When used personally, 'judge' suggests a subjective rather than an objective viewpoint.",
                    "example": "People may judge her lifestyle choices, but she's happy.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Adjudicator": {
            "wordRoot": "Adjudicator",
            "wordDefinition": "An adjudicator is a person who settles a dispute or decides on a particular matter, especially in a non-legal context. For example, a school might have an adjudicator to resolve conflicts between students or a competition might have an adjudicator to determine the winner.\n\nAn adjudicator is used in non-legal contexts to make decisions and settle disputes while a judge is used in legal contexts to preside over legal proceedings and make legal judgments.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8239156f-7b82-4705-bd8c-673470b40e76.webp"
        },
        "Appraiser": {
            "wordRoot": "Appraiser",
            "wordDefinition": "An appraiser is someone who values items or property based on their market worth. They typically work in the field of real estate, art, jewelry, or antiques.\n\nAn appraiser tells you how much something is worth while a judge decides who is right or wrong in a legal matter. Appraisers work in the field of valuing items, while judges work in the field of law.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/029ec74b-d321-4362-8cfb-ae00c3725aa0.webp"
        },
        "Arbiter": {
            "wordRoot": "Arbiter",
            "wordDefinition": "An arbiter typically refers to a person who is chosen to settle a dispute between two parties or a person who has the authority to make a final decision in a situation.\n\nGenerally, an arbiter is used more in situations where two parties are trying to reach a resolution but cannot agree, such as in marriage counseling or arbitration, while a judge is used in legal situations where a crime has been committed or a contract has been violated.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b03639f3-c6da-4a2e-989b-22c632ddc3c5.webp"
        },
        "Assessor": {
            "wordRoot": "Assessor",
            "wordDefinition": "An assessor is a person who evaluates or determines the value, quality or worth of something. For example, a real estate assessor evaluates the value of a property for tax purposes, or an insurance assessor appraises the value of a damaged car.\n\nAssessors do not make decisions on legal issues or impose penalties.\n\nIn short, assessors evaluate the worth of something while judges make legal decisions and impose penalties in a court of law.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9e9d6b66-4fbc-4b25-817a-a64581189ab4.webp"
        },
        "Critic": {
            "wordRoot": "Critic",
            "wordDefinition": "A critic is someone who gives their opinion on something, usually related to art, movies, music, books, etc. They evaluate and analyze the piece of work and express their thoughts on it, highlighting both its good and bad aspects.\n\nFor example, a movie critic might review a new film and share their thoughts on whether it was good or bad, whereas a judge presides over a court case and makes a decision on someone's guilt or innocence based on the evidence.\n\nCritics are applicable in the world of art and entertainment, while judges are found in the legal system.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f10015b8-ff8e-4a98-b102-d16921744212.webp"
        },
        "Examiner": {
            "wordRoot": "Examiner",
            "wordDefinition": "An examiner is someone who evaluates or tests something or someone. They usually assess a person's knowledge or skills during an examination, such as a teacher or an examiner for a driving test.\n\nAn examiner makes a decision based on the performance of the person they are evaluating.\n\nAn examiner evaluates, while a judge presides and makes decisions in legal cases.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0c646c2b-c0a8-4c29-8a0b-91a4929d17fe.webp"
        },
        "Inspector": {
            "wordRoot": "Inspector",
            "wordDefinition": "An inspector is someone who checks things to make sure they are safe, functioning properly, and following rules and regulations.\n\nFor example, a building inspector checks to make sure a building is safe to live or work in, while a food inspector checks food to make sure it's safe to eat.\n\nAn inspector focuses on ensuring things are safe and following regulations, while a judge focuses on making legal decisions and upholding the law.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8aff65b3-8e84-4021-9ecc-73902a43d346.webp"
        },
        "Referee": {
            "wordRoot": "Referee",
            "wordDefinition": "A referee is a person who oversees sports and games. They make sure that the rules of the game are followed and settle any disputes that might arise.\n\nReferees are usually found on sports fields and in other competitive settings.\n\nA judge oversees legal proceedings and makes legal decisions, while a referee oversees sports and games and ensures that the rules are followed.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1370d77e-c323-484a-a8a8-45b79f14d0ec.webp"
        }
    },
    "videos": [
        {
            "Text": " \"Well, it looks like giving tired judges a day off isn't one of those values, anyway.\" Traditions and holidays are important to all cultures, but a hero in one era may become a villain in the next as our historical knowledge expands and our values evolve. And deciding what these traditions should mean today",
            "Title": "History vs. Christopher...",
            "VideoId": "GD3dgiDreGc",
            "Controls": "start=312"
        },
        {
            "Text": " where they will not be judged by the color of their skin, but by the content of their character. In both cases, the speaker's present their audience with a possible future and try to enlist their help in avoiding or achieving it. But what makes for good deliberative rhetoric, besides the future tense?",
            "Title": "How to use rhetoric to...",
            "VideoId": "3klMM9BkW5o",
            "Controls": "start=82"
        },
        {
            "Text": " If you use them poorly, bad idea. Right? So when we think of nonverbals, we think of how we judge others, how they judge us and what the outcomes are. We tend to forget, though, the other audience that's influenced by our nonverbals, and that's ourselves. We are also influenced by our nonverbals,",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=199"
        },
        {
            "Text": " out on the road get those quests assignment inspiration is about understanding the world around you and capturing that as a photographer and having it resonate and inspire people for this assignment you will be judged on your ability to photograph images that convey three different ideas",
            "Title": "Assignment: Inspiration...",
            "VideoId": "gur6jAxgVag",
            "Controls": "start=43"
        },
        {
            "Text": " So how do you get the truth, or something close? One of the best ways is to get the original news unfiltered by middlemen. Instead of articles interpreting a scientific study or a politician's speech, you can often find the actual material and judge for yourself.",
            "Title": "How to choose your news...",
            "VideoId": "q-Y-z6HmRgI",
            "Controls": "start=104"
        },
        {
            "Text": " So they are so powerful that in a common law country, if you go to a hospital and you refuse life-saving medical treatment, a judge will not order it forced upon you, because they will respect your self-determination and your autonomy.",
            "Title": "Chimps have feelings and...",
            "VideoId": "VLe84OkwKOA",
            "Controls": "start=532"
        },
        {
            "Text": " we have to decide in advance how to value human life and judge the greater good. So researchers who study autonomous systems are collaborating with philosophers to address the complex problem of programming ethics into machines,",
            "Title": "Would you sacrifice one...",
            "VideoId": "yg16u_bzjPE",
            "Controls": "start=249"
        },
        {
            "Text": " but only 19 have led to actual impeachment proceedings. The eight cases that ended in a conviction and removal from office were all federal judges. And impeachment of a sitting president is even more rare.",
            "Title": "How does impeachment...",
            "VideoId": "hSszixvo7d8",
            "Controls": "start=223"
        },
        {
            "Text": " woman did sports they became professionals we had world's first female judge that was fully recognized to do anything as opposed to other parts of the world we had world's first female",
            "Title": "Defying stereotypes: the...",
            "VideoId": "yYALOFCuw-Q",
            "Controls": "start=426"
        },
        {
            "Text": " likely to get crushed every now and then the beachmaster proclaims his dominance with a row the bigger the ball the louder and deeper his voice a rival can judge from it",
            "Title": "Elephant Seals PIPE Life in...",
            "VideoId": "JrzenOfcmBo",
            "Controls": "start=204"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/future.webp",
            "Text": "I like all types of women. I accept them as they are when they come into my life... But I'm not a romantic. I'm just up-front. I like to be a part of something real, not make-believe. I tell women to tell me the truth, to just lay it out. Let me be the judge and decide if I want you around or not. Let me have my choice.",
            "Title": "American Musician",
            "Name": "Future"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/floyd-mayweather-jr.webp",
            "Text": "Don't ever know who you may meet, or just because a person may not be dressed up all fancy, don't mean they're not an important person. You just don't ever know who you're gonna meet in life. So that's why I look at everybody as equal. Can't just judge. I treat everybody with respect. Every man.",
            "Title": "American Boxer",
            "Name": "Floyd Mayweather, Jr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-jackson.webp",
            "Text": "It's a complete lie, why do people buy these papers? It's not the truth I'm here to say. You know, don't judge a person, do not pass judgement, unless you have talked to them one on one. I don't care what the story is, do not judge them because it is a lie.",
            "Title": "American Singer",
            "Name": "Michael Jackson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/venus-williams.webp",
            "Text": "When you are in the public eye, you have to protect yourself. There are so many people judging you. I just try to be myself.",
            "Title": "American Tennis Player",
            "Name": "Venus Williams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/martin-luther-king-jr.webp",
            "Text": "I look to a day when people will not be judged by the color of their skin, but by the content of their character.",
            "Title": "American Leader",
            "Name": "Martin Luther King, Jr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oscar-wilde.webp",
            "Text": "Children begin by loving their parents; after a time they judge them; rarely, if ever, do they forgive them.",
            "Title": "Irish Poet",
            "Name": "Oscar Wilde"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dalai-lama.webp",
            "Text": "I find hope in the darkest of days, and focus in the brightest. I do not judge the universe.",
            "Title": "Tibetan Leader",
            "Name": "Dalai Lama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/chadwick-boseman.webp",
            "Text": "One of the first things I was taught as an actor was, 'Don't judge the character.",
            "Title": "American Actor",
            "Name": "Chadwick Boseman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ralph-waldo-emerson.webp",
            "Text": "Judge of your natural character by what you do in your dreams.",
            "Title": "American Philosopher",
            "Name": "Ralph Waldo Emerson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alan-rickman.webp",
            "Text": "So you can't judge the character you're playing ever.",
            "Title": "British Actor",
            "Name": "Alan Rickman"
        }
    ]
}