{
    "currentWord": {
        "wordRoot": "list",
        "id": 19779,
        "phonemic": "lɪst|lɪst\r",
        "bigId": "b2715178-90a7-45be-8be3-37a2033682e7",
        "wordForms": [
            "lists",
            "listing",
            "listed",
            "listings",
            "list"
        ]
    },
    "senses": [
        {
            "id": "b2715178-90a7-45be-8be3-37a2033682e7",
            "de": "A number of connected items or names written or printed consecutively, typically one below the other.",
            "ty": "noun",
            "ex": "Here is a list of things I need to buy from the grocery store.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "grocery list",
                " to-do list",
                " wish list"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b2715178-90a7-45be-8be3-37a2033682e7.webp",
            "Tips": [
                {
                    "title": "Context Matters",
                    "description": "Understand when a 'list' is expected, like for shopping or tasks, to help you communicate efficiently.",
                    "example": "Grocery lists help avoid forgetting items.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/frJlvpJ8uEKFtOr8b2b8jsLcZA4.webp"
                },
                {
                    "title": "Order Implications",
                    "description": "The order in a list can imply priority, with the first often being the most important.",
                    "example": "My list starts with 'buy milk', since it's urgent.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/heBqTGbra1hAT2h8c4GkfQsKaY.webp"
                },
                {
                    "title": "List vs. Sentence",
                    "description": "Use lists for clarity and conciseness over long sentences when detailing items or steps.",
                    "example": "Shopping's easier with a bullet-point list.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/JuSEXBNpWFzCHmkdqDQqjhkxsI.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "13bc540a-6c93-444e-ab88-1304d419ef04",
            "de": "To write or print a number of connected items or names consecutively, typically one below the other.",
            "ty": "verb",
            "ex": "She listed all the items she needed to get from the store.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "list items",
                " list ingredients",
                " list tasks"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/13bc540a-6c93-444e-ab88-1304d419ef04.webp",
            "Tips": [
                {
                    "title": "Verb Consistency",
                    "description": "When 'listing' items verbally, maintain a consistent format to aid comprehension.",
                    "example": "My meal plan lists breakfast, lunch, and dinner options.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Clarity in Instructions",
                    "description": "When directing others, 'list' steps to follow clearly to ensure tasks are completed correctly.",
                    "example": "Please list the safety procedures.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "032c83cc-1368-4f81-beeb-865d2c7609e1",
            "de": "A strip or border of a specified material or color running along the edge of a fabric, especially one lengthwise on a carpet.",
            "ty": "noun",
            "ex": "The list on the edge of the carpet is a beautiful contrast.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "carpet list",
                " fabric list",
                " color list"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/032c83cc-1368-4f81-beeb-865d2c7609e1.webp",
            "Tips": [
                {
                    "title": "Visual Effect",
                    "description": "A 'list' in textile terms can add visual appeal or serve as a functional border.",
                    "example": "This rug's blue list matches the room.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "8eda0a5b-b618-489c-97c9-5a85cb3dd73e",
            "de": "The action of a ship leaning to one side.",
            "ty": "verb",
            "ex": "The ship began to list to the right because of the storm.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "ship list",
                " list to the right",
                " list to the left"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8eda0a5b-b618-489c-97c9-5a85cb3dd73e.webp",
            "Tips": [
                {
                    "title": "Safety Relevance",
                    "description": "In maritime contexts, a 'list' is critical—indicating potential danger or instability.",
                    "example": "Correct the list to stabilize the vessel!\r",
                    "imageUrl": ""
                },
                {
                    "title": "Direction Specific",
                    "description": "The direction of a list (right or left) provides specific information essential in navigation.",
                    "example": "The ship lists to the left, adjust cargo!",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0ca6f285-24c3-49b2-91a0-a2272103527e",
            "de": "The action of enlisting in an army or other military service.",
            "ty": "verb",
            "ex": "He decided to list in the army after he graduated.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "list in the army",
                " list in the navy",
                " list in the military"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0ca6f285-24c3-49b2-91a0-a2272103527e.webp",
            "Tips": [
                {
                    "title": "Commitment Step",
                    "description": "Using 'list' in a military context conveys a decision to commit to service.",
                    "example": "After college, she plans to list in the navy.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Catalogue": {
            "wordRoot": "Catalogue",
            "wordDefinition": "A catalogue is a more detailed and comprehensive collection of items that usually includes descriptions, pictures, and prices.\n\nIt is often used by businesses to showcase their products or services. For example, furniture stores may have a catalogue of their products that customers can browse through to see what is available.\n\nIt can be used for various purposes such as making a grocery list, to-do list or a guest list for a party. Lists are usually shorter than catalogues and are meant to be easily understood without any unnecessary information.\n\nA catalogue is more detailed and used by businesses to showcase their products, while a list is simpler and can be used for various purposes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/941a39ec-5b31-4254-987a-eb9b3c6a2311.webp"
        },
        "Directory": {
            "wordRoot": "Directory",
            "wordDefinition": "A directory is a structured database that stores information about files or folders on a computer or network.\n\nA directory is like a virtual folder that contains lists of files, subdirectories, and other data.\n\nA directory is a type of list that provides a structured way to organize and access files and folders on a computer or network, while a list is a collection of items that can be used for a variety of purposes.\n\nDirectories are used in operating systems, file managers, and network protocols, while lists can be used in everyday life for tasks such as making a grocery list or creating a to-do list.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c2f74637-d2a1-41cf-a704-520aded0835c.webp"
        },
        "Index": {
            "wordRoot": "Index",
            "wordDefinition": "Index and list both refer to items organized in a certain order.\n\nHowever, there is a difference in how they are used. An index is a tool used to quickly find specific information within a book or document.\n\nAn index is used for finding information quickly within a book or document, while a list is used to organize items for personal or public use.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e29bada7-0430-47b1-bde9-33ced15d8331.webp"
        },
        "Inventory": {
            "wordRoot": "Inventory",
            "wordDefinition": "Inventory refers to a comprehensive record of goods or items available in stock for sale or use. It includes details such as item description, quantity, and value.\n\nInventory is mainly used in business or trade when keeping track of goods owned or available for sale.\n\nInventory is used to keep track of goods in stock, while a list is a simple record of items in a specific order.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e6f7da11-a586-4fb8-9c5e-5f9eeac60dd1.webp"
        },
        "Record": {
            "wordRoot": "Record",
            "wordDefinition": "The main difference between the words list and record is that a list is a series of items written down or verbally communicated in a particular order, whereas a record is a written or electronic document that contains information about an event, person, or thing.\n\nRecord is typically used to describe a more formalized document that contains information about a particular subject or event.\n\nFor example, a medical record contains information about a patient's health history, while a criminal record contains information about a person's criminal history.\n\nA record can also refer to a written or electronic document of transactions, such as a sales record or a financial record.\n\nA list is more casual and used to keep track of things or tasks, while a record is more formal and used to document or record important information.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/39d86227-3e4d-4457-95c0-d2441a2bfb8d.webp"
        },
        "Register": {
            "wordRoot": "Register",
            "wordDefinition": "Register refers to an official or formal record of something. For instance, you may need to register for a class or register your car with the DMV.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c3d315ee-352d-4337-a592-7a5c9a8f9a0f.webp"
        },
        "Roll": {
            "wordRoot": "Roll",
            "wordDefinition": "Roll is usually defined as a document or list that is in a rolled-up form or a cylindrical form.\n\nIt can refer to a register or list of names, a roll call, or a list of bills or documents.\n\nIn simple terms, lists are generally flat and linear, while rolls are cylindrical and often contain more complex information.\n\nLists can be used for organizing, planning, and tracking, while rolls are often used for official records and archives.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f1614cd1-d2bc-4063-8eee-07fc08c135d6.webp"
        },
        "Roster": {
            "wordRoot": "Roster",
            "wordDefinition": "Both list and roster refer to a group of items or people, but differ slightly in their usage.\n\nA roster is a list of names or people organized in a specific order, such as a sports team roster or a work schedule roster.\n\nList is a more general term used for grouping any related items, while roster specifically refers to a list of people organized in a specific order.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/14082716-7b9e-4fd6-b100-62d984b76dd7.webp"
        }
    },
    "videos": [
        {
            "Text": " I'm going to show you that you didn't succeed, by producing a decimal that is not on your list. I'll construct my decimal one place at a time. For the first decimal place of my number, I'll look at the first decimal place of your first number. If it's a one, I'll make mine a two; otherwise I'll make mine a one. For the second place of my number,",
            "Title": "How big is infinity? -...",
            "VideoId": "UPA3bwVVzGI",
            "Controls": "start=221"
        },
        {
            "Text": " You're afraid if you look for your passion and don't find it, you'll feel like you're an idiot, so then you make excuses about why you're not going to look for your passion. They are excuses, ladies and gentlemen. We're going to go through a whole long list -- your creativity in thinking of excuses not to do what you really need to do",
            "Title": "Larry Smith: Why you...",
            "VideoId": "qrNDkRHAA4E",
            "Controls": "start=109"
        },
        {
            "Text": " you'd be choosing an option that sharply decreases your net pleasure. Perhaps, then, you believe that there are things in life with greater intrinsic value than pleasure. Truth, knowledge, authentic connection with other human beings. These are all things that might make the list. By never learning the truth,",
            "Title": "Would you opt for a life...",
            "VideoId": "XNP1x11Z2Ig",
            "Controls": "start=169"
        },
        {
            "Text": " are being investigated, too. So, if you know someone struggling with depression, encourage them, gently, to seek out some of these options. You might even offer to help with specific tasks, like looking up therapists in the area, or making a list of questions to ask a doctor. To someone with depression,",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=177"
        },
        {
            "Text": " i counted steps i got a standing desk and i learned that my one hour of walking every day was as good for my head as it was for my body and finally life's too short to live without ice cream when i was first diagnosed i made a list of all my favorite foods",
            "Title": "The psychological weight...",
            "VideoId": "DLYb3IgQ1Qk",
            "Controls": "start=274"
        },
        {
            "Text": " by devising a complex riddle involving this list of clues. Can you resist tackling a brain teaser written by one of the smartest people in history? Let's give it a shot. The world's rarest fish has been stolen from the city aquarium.",
            "Title": "Can you solve...",
            "VideoId": "1rDVz_Fb6HQ",
            "Controls": "start=13"
        },
        {
            "Text": " listing over a hundred common dreams and their meanings. And in the years since, we haven't paused in our quest to understand why we dream. So, after a great deal of scientific research, technological advancement, and persistence,",
            "Title": "Why do we dream? - Amy...",
            "VideoId": "2W85Dwxx218",
            "Controls": "start=15"
        },
        {
            "Text": " official face transplant list every day I you kind of wake up you think this could be the day and and then you get through tons where there's not a call or anything and you kind of get a little discouraged and disappointed but",
            "Title": "Watch One Family's...",
            "VideoId": "fFua9-Rc4pw",
            "Controls": "start=328"
        },
        {
            "Text": " and one of his most important roles is to defend the pride and territory against competitors hyenas are top of the list when it comes to a lion's enemies a large clan of hyena have been",
            "Title": "Hair-Raising Hyena...",
            "VideoId": "m3XuS8FN3Vg",
            "Controls": "start=722"
        },
        {
            "Text": " And one of his most important roles is to defend the pride and territory against competitors. Hyenas are top of the list, when it comes to a lion's enemies.",
            "Title": "Eternal Adversaries:...",
            "VideoId": "pta_sLKi6nM",
            "Controls": "start=45"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rutger-hauer.webp",
            "Text": "It took me a long time to find out that I was born to be an actor. It was the last thing on my list, although my list was very small. I didn't know what to do. But kids weren't supposed to know what to do back then; we were all cute and we'd find out what we'd do later in life.",
            "Title": "Dutch Actor",
            "Name": "Rutger Hauer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jenna-morasca.webp",
            "Text": "A good way to take a baby step into the world of animal rights is to make a list of small things you can do to help your issue and work your way up to the big things. Make a promise to do one thing on your list each month.",
            "Title": "American Model",
            "Name": "Jenna Morasca"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/katherine-heigl.webp",
            "Text": "A lot of children don't find forever homes because they're on that special-needs list, even if it's because of something as simple as her mother smoked cigarettes for a month, not knowing she was pregnant.",
            "Title": "American Actress",
            "Name": "Katherine Heigl"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/phil-hellmuth.webp",
            "Text": "I guess I'm the happiest when I'm picking up my kids from school. The most important things on my list are my wife and kids and my health. Happiness is having a family you love.",
            "Title": "American Celebrity",
            "Name": "Phil Hellmuth"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-nicholson.webp",
            "Text": "I've never been able to say I've been influenced by a list of artists I like because I like thousands and thousands and I've been influenced in some way by all of them.",
            "Title": "American Actor",
            "Name": "Jack Nicholson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/patrick-schwarzenegger.webp",
            "Text": "My mom always talks about how hard it was to grow up in a political family. It's always split up, and just - I want to have fun in life. No, politics isn't on the list.",
            "Title": "American Actor",
            "Name": "Patrick Schwarzenegger"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/natalya-neidhart.webp",
            "Text": "I am big on writing to-do lists and having new goals to reach all the time, as it keeps me motivated and inspired.",
            "Title": "Canadian Athlete",
            "Name": "Natalya Neidhart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/roddy-llewellyn.webp",
            "Text": "Everybody in their life has a list of what they want to do: I'm very lucky indeed to do one thing on that list.",
            "Title": "British Journalist",
            "Name": "Roddy Llewellyn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bernard-hopkins.webp",
            "Text": "I respect people's opinion. Everybody has they own 'pound for pound' list.",
            "Title": "American Athlete",
            "Name": "Bernard Hopkins"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/matthew-perry.webp",
            "Text": "When I die, I'd like' Friends' to be listed behind 'helping people.",
            "Title": "Actor",
            "Name": "Matthew Perry"
        }
    ]
}