{
    "currentWord": {
        "wordRoot": "loyal",
        "id": 6149,
        "phonemic": "ˈlɔɪəl|ˈlɔɪəl\r",
        "bigId": "3032a8a5-59a2-47ab-bdb3-bd8aa49f01ed",
        "wordForms": [
            "loyally",
            "loyalists",
            "loyal"
        ]
    },
    "senses": [
        {
            "id": "3032a8a5-59a2-47ab-bdb3-bd8aa49f01ed",
            "de": "Someone who stays true to someone else or supports them completely",
            "ty": "adjective",
            "ex": "He has been a loyal follower of the political party for many years.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "loyal supporter",
                " loyal friend",
                " loyal customer"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3032a8a5-59a2-47ab-bdb3-bd8aa49f01ed.webp",
            "Tips": [
                {
                    "title": "Steadfast Support",
                    "description": "Refers to unwavering commitment to a person, often seen in friendships and partnerships.",
                    "example": "Her loyal support during his recovery was invaluable.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/WcMbpGDrxSJ2Tgo05kXwXcjnOU.webp"
                },
                {
                    "title": "Not Blind Allegiance",
                    "description": "Being loyal doesn't mean agreeing with everything. One can be loyal but still offer constructive criticism.",
                    "example": "Despite their disagreements, he remained a loyal friend.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ra1dYYcae7HU4d8K51D4RHNE9Y.webp"
                },
                {
                    "title": "Emotional Bond",
                    "description": "Indicates a deep emotional connection that goes beyond casual friendships or acquaintances.",
                    "example": "She's been a loyal companion through both good times and bad.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/2Ys3EQPA0RVJuT6VwbvaYKdY23k.webp"
                }
            ]
        },
        {
            "id": "d5e254cb-7f91-4d84-bfd8-56c45d4914ac",
            "de": "Dependable, reliable",
            "ty": "adjective",
            "ex": "The car has been very loyal and hasn't broken down once.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "loyal service",
                " loyal companion",
                " loyal employee"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d5e254cb-7f91-4d84-bfd8-56c45d4914ac.webp",
            "Tips": [
                {
                    "title": "Consistency",
                    "description": "Implies consistency in reliability, often valued in products and services.",
                    "example": "Her loyal patronage over the years earned her a special discount.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Mutual Expectation",
                    "description": "In a work context, loyalty is expected to be mutual between employer and employee.",
                    "example": "He is a loyal employee who also feels valued by his company.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Unconditional",
                    "description": "In many contexts, loyalty can have conditions and may change if core values are compromised.",
                    "example": "Their service was loyal until the company's ethics no longer aligned with their own.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "d0b668b5-e0c0-4724-9442-e07d4d3fb4f5",
            "de": "Remaining committed to a person or cause",
            "do": "Political",
            "ty": "adjective",
            "ex": "She remained loyal to the party even when others left.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "loyal to the cause",
                " loyal party member",
                " loyal opposition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d0b668b5-e0c0-4724-9442-e07d4d3fb4f5.webp",
            "Tips": [
                {
                    "title": "Political Integrity",
                    "description": "In politics, being loyal is often linked with integrity and standing by one's commitments.",
                    "example": "He was a loyal senator who stood by his campaign promises.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ideological Commitment",
                    "description": "Political loyalty may involve a strong adherence to specific ideological principles.",
                    "example": "Despite pressure, she remained loyal to her party's core principles.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Synonymous with Agreement",
                    "description": "In the political domain, one can be part of the 'loyal opposition' and still retain integrity to the cause.",
                    "example": "As a member of the loyal opposition, he criticized the bill but supported the democratic process.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Commit": {
            "wordRoot": "Commit",
            "wordDefinition": "Commit implies taking responsibility for an action or decision, while the word loyal refers to being faithful or dedicated to a person, organization or cause.\n\nFor example, you can commit to completing a task by a certain deadline, but loyalty refers to your support and dedication to a friend, family member or your country.\n\nCommitment focuses on taking action, while loyalty is more about the emotional connection you have with someone or something.\n\nIn summary, commitment is applicable in situations where you need to take responsibility for something, whereas loyalty is applicable in situations where you need to show support and dedication to a person or organization.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3500097a-34e2-429e-a695-57176476c3b6.webp"
        },
        "Dedicate": {
            "wordRoot": "Dedicate",
            "wordDefinition": "Dedicate means to give one's time, effort or attention to a particular activity or cause. For example, someone might dedicate their life to helping others or dedicate themselves to a specific project or task.\n\nBoth words are important and can be applicable in different situations. Dedicate is more suited to describing actions or tasks, while loyal more describes the feelings or attitudes.\n\nFor instance, a soldier might dedicate their life to serving their country, while also being loyal to their country and their fellow soldiers.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/38d81a3d-e5f2-46e1-af6d-aafd84037dd9.webp"
        },
        "Devoted": {
            "wordRoot": "Devoted",
            "wordDefinition": "Devoted means that you are very dedicated and loyal to someone or something, and you have a strong affection or love for it.\n\nThe main difference between the two words is that devoted implies an emotional connection, while loyal implies a sense of duty or responsibility.\n\nFor example, a devoted fan of a sports team may have an emotional attachment to the players and the culture of the team, while a loyal employee may feel a sense of duty and commitment towards their job and their colleagues.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/60181667-247f-4d9b-9ccb-39f3dfd01a8a.webp"
        },
        "Faithful": {
            "wordRoot": "Faithful",
            "wordDefinition": "Faithful usually describes a person who is reliable and stays true to their promises or commitments. For example, a faithful friend is someone who you can always count on to be there for you when you need them.\n\nLoyal generally means being devoted or dedicated to someone or something. This can include being faithful, but it goes a step further by showing a strong sense of allegiance or devotion.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a2d978d0-8dc7-42d8-ace7-34a0b3ccaf0d.webp"
        },
        "Fervent": {
            "wordRoot": "Fervent",
            "wordDefinition": "Fervent means having intense and passionate feelings towards something or someone.\n\nIt is often used to describe someone who has a strong belief, enthusiasm, or zeal for a cause or an idea. For example, a fervent environmentalist will do everything in their power to protect the planet.\n\nTherefore, while both words describe a strong attachment to something or someone, fervent is more about passionate feelings or beliefs, whereas loyal is more about commitment and faithfulness.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3273f91e-58b0-4ccf-98f6-304ecb334d73.webp"
        },
        "Reliable": {
            "wordRoot": "Reliable",
            "wordDefinition": "Reliable refers to a person or thing that can be depended on to do what they are supposed to do effectively and efficiently.\n\nReliable people or things are consistent in their performance, without any errors or delays.\n\nThus, loyalty is about commitment and faithfulness in relationships, while reliability is about being trustworthy and dependable in work or tasks.\n\nFor example, a loyal friend will always support and defend you, while a reliable employee will always finish their work on time, without any errors.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b20b748c-53ec-4fb2-95be-4bdc0b45bf47.webp"
        },
        "Steadfast": {
            "wordRoot": "Steadfast",
            "wordDefinition": "Steadfast means being firm and unwavering in one's beliefs or principles, regardless of the circumstances or opposition faced.\n\nFor example, being steadfast in one's commitment to environmental conservation means staying committed to the cause, even in the face of opposition from others or setbacks.\n\nSteadfastness is more about inner resolve and determination, rather than outward actions.\n\nBoth loyalty and steadfastness are important virtues that are applicable in different situations. Loyalty is more about relationships and personal connections, while steadfastness is more about staying true to one's beliefs and values, regardless of the challenges faced.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2e23e381-b5f6-444a-8f5c-744438670ca1.webp"
        },
        "Trustworthy": {
            "wordRoot": "Trustworthy",
            "wordDefinition": "Trustworthy refers to someone who can be relied on to do what they say they will, and to keep information or secrets safe. They are truthful, honest and dependable.\n\nFor example, a loyal friend would stand by you even if they disagree with your decision, while a trustworthy employee would always show up on time and get their work done efficiently.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b24de433-8c7f-45a1-8114-d4dedd34af8e.webp"
        }
    },
    "videos": [
        {
            "Text": " their backpacks and their pickup trucks and driving through the night students who had taken a week off school people who are self-employed unemployed even a few who would used vacation time to leave their jobs and come and help after years in the military loyal following orders these men and",
            "Title": "Lessons we can learn...",
            "VideoId": "dcIwzW3bpX8",
            "Controls": "start=107"
        },
        {
            "Text": " the part of the brain that controls decision-making and not language. But if you don't know why you do what you do, and people respond to why you do what you do, then how will you ever get people to vote for you, or buy something from you, or, more importantly, be loyal",
            "Title": "How great leaders...",
            "VideoId": "qp0HIF3SfI4",
            "Controls": "start=448"
        },
        {
            "Text": " trying horses oh yeah everyone loves them uh great aren't they horses just a graceful loyal self-satisfied pampered sniveling little my little ponies every last one of them you show me a humble horse mate and i'll show you",
            "Title": "A Scottish Fly Moves In...",
            "VideoId": "-F-94UODk_0",
            "Controls": "start=74"
        },
        {
            "Text": " I'm very loyal to my friends so I said to myself okay here's how it's gonna work mark I'm gonna look down at my foot if I see anything down there that could that could serve as a weapon I'm back in",
            "Title": "To Climb the World PIPE...",
            "VideoId": "NFfTHoJ9khs",
            "Controls": "start=516"
        },
        {
            "Text": " so why can't you also be loyal to humankind as a whole? Of course, there are occasions when it becomes difficult, what to put first, but, you know, life is difficult. Handle it.",
            "Title": "Nationalism vs....",
            "VideoId": "szt7f5NmE9E",
            "Controls": "start=1206"
        },
        {
            "Text": " For example, I can be a good patriot, loyal to my country, and at the same time, be loyal to my family, my neighborhood, my profession, humankind as a whole, truth and beauty.",
            "Title": "Why fascism is so...",
            "VideoId": "xHHb7R3kx40",
            "Controls": "start=173"
        },
        {
            "Text": " The mothers are worried and quickly scoop up the youngest. Here, the two males face each other. The family man backs towards one of his more loyal wives, calling for support.",
            "Title": "Defending a Monkey Harem...",
            "VideoId": "Bm1q-V2b1Sc",
            "Controls": "start=150"
        },
        {
            "Text": " family man backs towards one of his more loyal wives calling for support one of the youngsters suddenly switches from mother to father this should calm things down",
            "Title": "Best Monkey Moments PIPE...",
            "VideoId": "opyPkipNNhE",
            "Controls": "start=392"
        },
        {
            "Text": " He finally enlisted the help of his loyal foster son, a warrior named Sigurd, to slay the monster his brother had become. Sigurd did as instructed.",
            "Title": "The Norse myth that...",
            "VideoId": "ByCTeTI3SDg",
            "Controls": "start=229"
        },
        {
            "Text": " every day andrea sets off with her loyal helpers on the 45-minute walk to the bye",
            "Title": "Disabled Baby Elephant...",
            "VideoId": "nXvPGxaS2E8",
            "Controls": "start=21"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alice-walker.webp",
            "Text": "I made my first white women friends in college; they loved me and were loyal to our friendship, but I understood, as they did, that they were white women and that whiteness mattered.",
            "Title": "American Author",
            "Name": "Alice Walker"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kanye-west.webp",
            "Text": "You don't have to be scared of me, because I am loyal. Why are people so scared of creative ideas and so scared of truth? All I want to do is do good.",
            "Title": "American Rapper",
            "Name": "Kanye West"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-brown.webp",
            "Text": "I'm a very sensitive person. I do like to be respected. I'm very loyal. I like it to be a two-way street.",
            "Title": "American Athlete",
            "Name": "Jim Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paris-hilton.webp",
            "Text": "I'm the nicest, most loyal person in the world when it comes to my friends.",
            "Title": "American Celebrity",
            "Name": "Paris Hilton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/david-schwimmer.webp",
            "Text": "I'm fiercely loyal to my friends, and I really cherish my friendships.",
            "Title": "American Actor",
            "Name": "David Schwimmer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luther-strange.webp",
            "Text": "It's really important if you're in politics to have a loyal friend.",
            "Title": "American Politician",
            "Name": "Luther Strange"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-boeheim.webp",
            "Text": "When you can't be loyal to your friends, I don't like that world.",
            "Title": "American Coach",
            "Name": "Jim Boeheim"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/carli-lloyd.webp",
            "Text": "I'm loyal. I'm real. I'm not afraid to say what I'm thinking.",
            "Title": "American Athlete",
            "Name": "Carli Lloyd"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ronnie-dunn.webp",
            "Text": "Country fans are the most loyal in the world.",
            "Title": "American Musician",
            "Name": "Ronnie Dunn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/judy-blume.webp",
            "Text": "I have the most loyal readers in the world.",
            "Title": "American Author",
            "Name": "Judy Blume"
        }
    ]
}