{
    "currentWord": {
        "wordRoot": "narrow",
        "id": 15874,
        "phonemic": "ˈnærəʊ|ˈnærəʊ\r",
        "bigId": "7bcae632-aa4c-4c94-bf93-300a5588165b",
        "wordForms": [
            "narrower",
            "narrowest",
            "narrows",
            "narrowing",
            "narrowed",
            "narrowly",
            "narrowness",
            "narrow"
        ]
    },
    "senses": [
        {
            "id": "7bcae632-aa4c-4c94-bf93-300a5588165b",
            "de": "Not wide, having a small distance from side to side",
            "ty": "adjective",
            "ex": "The street is too narrow for cars",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "narrow street",
                " narrow gap",
                " narrow bridge"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7bcae632-aa4c-4c94-bf93-300a5588165b.webp",
            "Tips": [
                {
                    "title": "Physical Spaces",
                    "description": "Relates to physical width, like paths or items you have to move through or around.",
                    "example": "The alley was too narrow for the truck.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/rbkFcTDWV2p10bwcivAfuVxkZU.webp"
                },
                {
                    "title": "Descriptive Imagery",
                    "description": "Used to create a vivid picture of small or confined spaces in writing.",
                    "example": "The narrow hallway echoed with each step.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/dK1dAVEjG1lmm2OvVyaTiPoNvks.webp"
                }
            ]
        },
        {
            "id": "8d7149cc-73c7-46ff-9704-10637f1e5184",
            "de": "To make or become less wide",
            "ty": "verb",
            "ex": "The road narrows ahead",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "narrow down",
                " narrow focus",
                " narrow view"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8d7149cc-73c7-46ff-9704-10637f1e5184.webp",
            "Tips": [
                {
                    "title": "Change Over Time",
                    "description": "Used when something becomes tighter or more confined gradually.",
                    "example": "The selection of candidates narrowed as interviews progressed.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Focus Reduction",
                    "description": "Often used to express reducing the scope of something to be more specific.",
                    "example": "We must narrow our marketing focus to target adults.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "7bfdc6e7-7716-4bbd-8352-10579f28b34e",
            "de": "Limited in extent or range",
            "ty": "adjective",
            "ex": "She has a narrow view of the world",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "narrow minded",
                " narrow outlook",
                " narrow perspective"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7bfdc6e7-7716-4bbd-8352-10579f28b34e.webp",
            "Tips": [
                {
                    "title": "Not Just Geography",
                    "description": "Applies to thinking, suggesting limited variety in thoughts or experiences.",
                    "example": "His narrow views didn't change despite the evidence.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Lack of Openness",
                    "description": "Can imply a person is not open to new ideas or opinions.",
                    "example": "Her narrow mindset held her back in many situations.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "7dbfa8bb-f0d7-4945-b474-bd45c0f3a92a",
            "de": "Just enough to succeed",
            "ty": "adjective",
            "ex": "He won by a narrow margin",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "narrow escape",
                " narrow victory"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7dbfa8bb-f0d7-4945-b474-bd45c0f3a92a.webp",
            "Tips": [
                {
                    "title": "Barely Sufficient",
                    "description": "Indicates minimal success or just meeting a requirement.",
                    "example": "He passed the exam by a narrow margin.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Intense Competition",
                    "description": "Can be used in sports or contests to describe a close win.",
                    "example": "The team secured a narrow victory in the final seconds.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "3085bea9-f100-462d-8a14-79ffc520e334",
            "de": "To limit the options one is considering",
            "ty": "verb",
            "ex": "She narrowed her choices down to two",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "narrow down choices",
                " narrow down options"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3085bea9-f100-462d-8a14-79ffc520e334.webp",
            "Tips": [
                {
                    "title": "Decision-Making",
                    "description": "Use when referring to the process of eliminating options.",
                    "example": "She narrowed her college choices to three after the campus visits.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Precision in Thought",
                    "description": "Refers to being exact or careful about the details under consideration.",
                    "example": "To answer the question, we must narrow our focus to relevant data only.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Close": {
            "wordRoot": "Close",
            "wordDefinition": "Close means to shut or make something shut, or to bring something near to oneself or others. For example, you can close a window, a door, or a book.\n\nIt can also mean to end something, like closing a deal or closing a store. Close is used to refer to an act of shutting something or bringing something near.\n\nClose is often used to describe physical actions like shutting doors or windows, while narrow is more likely to be used to describe something that's thinner or limited in perspective.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/80d2c5c2-3879-4040-b1df-040c1f579e8b.webp"
        },
        "Constricted": {
            "wordRoot": "Constricted",
            "wordDefinition": "Constricted refers to something that is physically compressed or restricted, while narrow refers to something that has a small width or is restricted in terms of size or amount.\n\nFor example, a constricted airway would refer to a medical condition where the airway is physically narrowed, making it difficult to breathe.\n\nConstricted tends to refer to physical restriction or limitation, while narrow tends to refer to a lack of space or width.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dbaa3fa0-adcd-467f-91e9-3ad32a8c6955.webp"
        },
        "Cramp": {
            "wordRoot": "Cramp",
            "wordDefinition": "Cramp refers to a feeling of tightness or pain in a muscle when it is unable to relax. It is a physical sensation.\n\nIn usage, cramp is applied to describe physical sensations such as stomach cramps, leg cramps or menstrual cramps. Narrow, on the other hand, describes objects or areas that are limited in width, such as a narrow alley, a narrow bridge or a narrow path.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c0c7db6a-9542-48a1-94a2-73881bb03079.webp"
        },
        "Limit": {
            "wordRoot": "Limit",
            "wordDefinition": "Limit refers to the point or boundary beyond which something cannot extend or exceed.\n\nIt usually describes a quantifiable value, such as a maximum number of items or a specific amount of time. For example, the speed limit on a highway is the top speed allowed for vehicles to travel.\n\nThe word narrow refers to something that is thin or slender in width or has limited space. It is more commonly used to describe physical features or attributes rather than quantitative boundaries.\n\nLimit refers to a quantitative boundary or constraint, while narrow refers to a physical feature that is thin or has limited space.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e497b1b7-a978-44f5-b7c6-4d67aac6a116.webp"
        },
        "Pinch": {
            "wordRoot": "Pinch",
            "wordDefinition": "Pinch refers to squeezing or compressing something, often with the fingers or hand.\n\nSo, while narrow describes the size or width of something, pinch describes an action that involves physically squeezing something or feeling trapped in a situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2f6cd608-c53d-457e-a4bd-72dda631e7d7.webp"
        },
        "Slim": {
            "wordRoot": "Slim",
            "wordDefinition": "Narrow means something that is not wide, while the word slim means something that is thin.\n\nFor example, a narrow hallway would mean that the space is not wide enough to accommodate many people, while a slim person would mean that they are low in body weight.\n\nNarrow is often used to describe physical spaces such as doorways, streets or passages, while slim describes physical objects such as mobile phones or laptops as well as people's bodies.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/017721d8-8732-4a61-a9d2-2412c9931b76.webp"
        },
        "Thin": {
            "wordRoot": "Thin",
            "wordDefinition": "It can describe something that is tight, confined or limited, like a narrow hallway or a narrow-minded person.\n\nThin refers to the measurement of something that is slim in width or depth.\n\nIt can describe something that is not very dense, like thin hair or thin paper.\n\nNarrow refers to the limited width of something, while thin refers to the slimness of something. Their usage depends on the context and what needs to be described in a specific situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6d0f8625-a506-4992-98fe-c7db26df5eb4.webp"
        },
        "Tight": {
            "wordRoot": "Tight",
            "wordDefinition": "Tight usually refers to something that is closely packed or fitting closely, such as tight clothing, a tight lid or a tight knot.\n\nIt can also mean something that is constricting or causes pressure, like a tight grip or a tight budget.\n\nSo to summarize, narrow describes width while tight describes fitting or pressure.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/71ac2852-66c8-417b-b7b6-41aa8c26ffdb.webp"
        }
    },
    "videos": [
        {
            "Text": " normal hares whiskers also sit three times deeper in the skin where they attach to nerve endings telling the cat how far each one is being bent back and how quickly their whiskers are the same width as their body allowing cats to navigate the narrowest spaces",
            "Title": "BBC Earth 50 Top Natural...",
            "VideoId": "a6roH6RffnA",
            "Controls": "start=1119"
        },
        {
            "Text": " allows them to withstand immense pressure. But they're the exception. Most deep-sea creatures are confined to a narrow range in the water column where nutrients are scarce since the food drifting downwards from the surface rapidly sinks to the sea floor.",
            "Title": "The otherworldly...",
            "VideoId": "U69LIr0OrNc",
            "Controls": "start=176"
        },
        {
            "Text": " And in many of our own life decisions, we use information gained from past experience and our surroundings to narrow down our choices to the best options so that maybe next time, we can avoid eating that poisonous mushroom in the first place.",
            "Title": "Can you solve the frog...",
            "VideoId": "cpwSGsb-rTs",
            "Controls": "start=238"
        },
        {
            "Text": " It turns out that the crime rate goes up and down irrespective of how many young people we send to prison. We tend to think about justice in a pretty narrow good and bad, innocent and guilty. Injustice is about being wrongfully convicted.",
            "Title": "Alice Goffman: How we're...",
            "VideoId": "-2Dj9M71JAc",
            "Controls": "start=670"
        },
        {
            "Text": " and a lovely narrow little face and these lovely little ears. They're tapping into something deep rooted within us. We love our cats because they love us. They're everything to me. She's like the last jigsaw of our family.",
            "Title": "Are These Cats Actually...",
            "VideoId": "0FiVTpGLtXc",
            "Controls": "start=208"
        },
        {
            "Text": " the rising tide breaches their nursery creating a narrow inlet to the pool and an opportunity for the intelligent organ she is thought to be the first of her kind in the world to hunt seals in this",
            "Title": "Orca's Extraordinary...",
            "VideoId": "9TLg-YlDog0",
            "Controls": "start=128"
        },
        {
            "Text": " narrow maze like toilet pipes is this even possible the underwater passage leaves no room for error add a turn the rat finds a pocket of air just enough to help it",
            "Title": "See How Easily a Rat Can...",
            "VideoId": "0t2VPBF6Kp4",
            "Controls": "start=54"
        },
        {
            "Text": " release you set yourself free grudges bitterness resentment they're all burdens they narrow our options our relationships our experiences of life",
            "Title": "What forgiveness can...",
            "VideoId": "TEfxPpnMuNQ",
            "Controls": "start=672"
        },
        {
            "Text": " The meat is positioned so deep in the narrow box, it's out of reach of the crow's beak.",
            "Title": "Are Crows the Ultimate...",
            "VideoId": "cbSu2PXOTOc",
            "Controls": "start=0"
        },
        {
            "Text": " oh dear big cheeks and narrow bottlenecks",
            "Title": "10 TOP Natural History...",
            "VideoId": "FeJKJ5MoCHY",
            "Controls": "start=521"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kaui-hart-hemmings.webp",
            "Text": "In putting setting to work, I like to think about long shots and close-ups. The long shot is the overall view of the place in which the characters live - the island, the town, the wide sweep of place. Then we narrow in. The close-up, the tight focus, makes the place different from anywhere else.",
            "Title": "American Writer",
            "Name": "Kaui Hart Hemmings"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "Our public life withers when only the most extreme voices get attention. Most of all, democracy breaks down when the average person feels their voice doesn't matter; that the system is rigged in favor of the rich or the powerful or some narrow interest.",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/holly-hunter.webp",
            "Text": "I love to look at physically beautiful people, and obviously others do, too. But there's such a narrow definition of what that is; the people who are my friends in life, the more I get to know them over the years, the more beautiful they are to me.",
            "Title": "American Actress",
            "Name": "Holly Hunter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/susan-sarandon.webp",
            "Text": "To know that once you decide to look at life outside of the narrow limits of just your world and start to understand that you can make a difference in very simple ways - in volunteering and all the way up to bigger world problems.",
            "Title": "American Actress",
            "Name": "Susan Sarandon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/taiye-selasi.webp",
            "Text": "When I'm working, I'm so narrowly focused on sound, language, rhythm, flow, that I rarely feel the emotion of the text. It's only after - long after - I've finished a piece that I can experience in any way its emotional charge.",
            "Title": "Ghanaian Writer",
            "Name": "Taiye Selasi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eckhart-tolle.webp",
            "Text": "Narrow your life down to this moment. Your life situation may be full of problems - most life situations are - but find out if you have a problem at this moment. Do you have a problem now?",
            "Title": "German Speaker",
            "Name": "Eckhart Tolle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/newt-gingrich.webp",
            "Text": "If you live your life as a hostage to everybody else's decision, you either have to live a very narrow life, or you have to spend a lot of time in pain.",
            "Title": "American Politician",
            "Name": "Newt Gingrich"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/famke-janssen.webp",
            "Text": "There's certain things I try to avoid, as an actress, just to keep my world from being as narrow as it could be.",
            "Title": "Dutch Actress",
            "Name": "Famke Janssen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sean-m-carroll.webp",
            "Text": "I think it's important that science just doesn't stay within narrow boundaries.",
            "Title": "American Scientist",
            "Name": "Sean M. Carroll"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/faye-wattleton.webp",
            "Text": "I was raised in a very sheltered, narrow environment.",
            "Title": "Sociologist",
            "Name": "Faye Wattleton"
        }
    ]
}