{
    "currentWord": {
        "wordRoot": "obvious",
        "id": 5080,
        "phonemic": "ˈɒbviəs|ˈɑːbviəs\r",
        "bigId": "7b56455b-0fae-42ce-995e-582610c4da5d",
        "wordForms": [
            "obviously",
            "obvious"
        ]
    },
    "senses": [
        {
            "id": "7b56455b-0fae-42ce-995e-582610c4da5d",
            "de": "Easy to see or understand, clear",
            "ty": "adjective",
            "ex": "It's obvious that he doesn't like the plan.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "obvious choice",
                " obvious reason",
                " obvious mistake"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7b56455b-0fae-42ce-995e-582610c4da5d.webp",
            "Tips": [
                {
                    "title": "Non-literal use",
                    "description": "Sometimes 'obvious' is used to emphasize feelings, not just facts.",
                    "example": "It's obvious to everyone that she's the best player.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tXZSUuOMMOCbHoo2cBf5u0DLwxE.webp"
                },
                {
                    "title": "Avoid overuse",
                    "description": "Using 'obvious' too much can sound rude, as if you're talking down to someone.",
                    "example": "She avoided saying it was obvious to not embarrass her friend.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/EerhCA67quDZuybgMvI9h2lIP9M.webp"
                },
                {
                    "title": "Mismatched perception",
                    "description": "What's obvious to you may not be to others, due to different knowledge or experiences.",
                    "example": "While it was obvious to the teacher, the students were confused.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/9YMt7DXiiGQwjXzxxyYqxo9MJWg.webp"
                }
            ]
        },
        {
            "id": "e5f76442-f4e7-4b9b-ad43-f2827ae6d4e7",
            "de": "Easy to recognize or identify, because it's against what is normal or usual",
            "ty": "adjective",
            "ex": "It's obvious that he is a foreigner.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "obvious sign",
                " obvious difference",
                " obvious outlier"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e5f76442-f4e7-4b9b-ad43-f2827ae6d4e7.webp",
            "Tips": [
                {
                    "title": "Identifies uniqueness",
                    "description": "'Obvious' underscores a characteristic that makes something or someone stand out.",
                    "example": "Her accent made it obvious she wasn't from around here.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Context sensitive",
                    "description": "'Obvious' can depend on context. What's obvious in one situation may not be in another.",
                    "example": "To a mathematician, the solution is obvious; to others, maybe not.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Negative connotation",
                    "description": "Describing someone as 'obviously' something can imply they don't fit in, use carefully.",
                    "example": "He was obviously the new guy, unsure of where to sit.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "8e8cdf74-b8b6-4151-aec8-3a69931af07e",
            "de": "Predictable, lacking in subtlety or originality",
            "ty": "adjective",
            "ex": "The ending of the movie was too obvious.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "obvious ending",
                " obvious solution",
                " obvious conclusion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8e8cdf74-b8b6-4151-aec8-3a69931af07e.webp",
            "Tips": [
                {
                    "title": "Predictability",
                    "description": "When events unfold as expected, 'obvious' describes the lack of surprise.",
                    "example": "The thief took the obvious escape route, straight into the police's hands.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Creative criticism",
                    "description": "In creative fields, 'obvious' might be used negatively to describe lack of originality.",
                    "example": "The artist's work was criticized for its obvious lack of creativity.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional tone",
                    "description": "Use 'obvious' to convey frustration or sarcasm over something predictable.",
                    "example": "He said with a sigh, it was obvious they would be late again.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Apparent": {
            "wordRoot": "Apparent",
            "wordDefinition": "Apparent means that something may seem to be true, but it is not necessarily true. It is based on what is visible or known at the time, but there may be more information that could change the situation.\n\nFor example, it may be apparent that a student did not study for their test, but they may have other things going on in their life that affected their ability to prepare.\n\nApparent describes something that may seem to be true based on what we currently know or see, but there may be more information that could change the situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/83fc8576-7c01-435c-a0d0-22a4a6c004f3.webp"
        },
        "Clear": {
            "wordRoot": "Clear",
            "wordDefinition": "Clear means something that is easy to understand or see. It could mean that the information provided is concise and straightforward, making it easy to comprehend.\n\nFor example, \"The instructions were clear and easy to follow.\"\n\nOverall, both words refer to something that is easy to understand or see, but clear pertains to the presentation or explanation of information while obvious refers to the inherent nature of something that doesn't need to be explained.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3b806c66-f176-45f6-b8f8-1c8d6c8288d0.webp"
        },
        "Evident": {
            "wordRoot": "Evident",
            "wordDefinition": "The words evident and obvious both mean that something is easy to see or understand.\n\nEvident implies that something is clear, but it may require some explanation or analysis to fully understand.\n\nFor example, it may be evident that climate change is occurring when looking at data on increasing global temperatures and extreme weather events, but it may require further research and understanding of the causes and effects to fully comprehend.\n\nObvious is applicable when something can be easily seen or understood without any further explanation, while evident is applicable when something is clear, but may require further analysis or explanation to fully comprehend.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d89c1a52-fe37-485d-aa4f-1f913323df39.webp"
        },
        "Manifest": {
            "wordRoot": "Manifest",
            "wordDefinition": "Manifest means something that is clear or evident, usually because it is easily observed or understood. It is something that is readily apparent to everyone.\n\nA good example would be the sun, which is manifest to everyone who goes outside during the day.\n\nManifest describes something that is very clear and almost impossible to miss, while obvious describes something that is easy to notice but may require some level of attention or thought to recognize.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d8498191-605d-4c22-9a1e-cca7d330fb69.webp"
        },
        "Palpable": {
            "wordRoot": "Palpable",
            "wordDefinition": "Obvious means something that is easily seen or understood, while the word palpable means something that can be felt or perceived physically.\n\nFor example, if someone is wearing a bright red shirt, it is obvious to the eye. If someone has a fever, it is palpable because you can physically feel their hot skin.\n\nObvious describes things that are clear or easily noticed, while palpable describes things that are tangible or perceptible through touch or other physical senses.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/62e6ea85-ff18-4b39-8ddc-9689840fbd59.webp"
        },
        "Patent": {
            "wordRoot": "Patent",
            "wordDefinition": "Patent refers to something that is officially recognized as being an original invention or design and is protected by law.\n\nFor example, if someone invents a new type of phone case that has never been seen before, they can apply for a patent to protect their design and ensure that no one else can copy it without permission.\n\nObvious refers to something that is easily noticed or understood, while patent refers to something that is officially recognized as original and protected by law.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/be43ede2-611d-4fd0-b51f-748fbfb118e5.webp"
        },
        "Plain": {
            "wordRoot": "Plain",
            "wordDefinition": "Plain refers to something that is simple or ordinary.\n\nIt is used for things that are not complicated or fancy. For example, a plain T-shirt doesn't have any decorations or patterns.\n\nObvious describes something that is clearly visible or understandable, while plain describes something that is simple or ordinary.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/40e6dde8-7d07-4c98-a111-a8ea722a9ea3.webp"
        },
        "Transparent": {
            "wordRoot": "Transparent",
            "wordDefinition": "Transparent means something that is easily seen through or understood. It usually refers to something that is clear, open or honest, such as a person or a process.\n\nFor example, it is obvious that the sun rises in the east and sets in the west, but a transparent government would make sure that its citizens know the reasons behind its decisions and policies.\n\nObvious refers to something that is easy to see or understand without much effort, while transparent refers to something that is openly visible or honest.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/89710aad-27ef-49fc-9c99-3f9f143c7ec8.webp"
        },
        "Unmistakable": {
            "wordRoot": "Unmistakable",
            "wordDefinition": "Unmistakable means something that is impossible to confuse or misunderstand. It implies that the thing or concept is clear and unambiguous.\n\nHowever, a stop sign is unmistakable because it is impossible to confuse it with anything else.\n\nObvious is applicable when something is easy to understand or see, while unmistakable is applicable when something is impossible to misinterpret or mistake for something else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2d69894a-5f77-42ed-b6a8-2b714c0ffc38.webp"
        }
    },
    "videos": [
        {
            "Text": " peacefully but crocs will take every opportunity to prey on a weak animal or scavenge a dead one we've seen one or two of these hippos doing these big yawning displays which is really a threat to the crocodiles they're trying to drive the crocodiles off with this big yawn and you know sharp teeth and everything but the crocs obviously are not intimidated",
            "Title": "Greatest Fights In The...",
            "VideoId": "sf7LVPIZMR8",
            "Controls": "start=183"
        },
        {
            "Text": " What's obvious to you may not be to the next person. And the opposite of the dumbest idea might just turn out to be the smartest. What about all that dumb stuff that happens in real life? Have you ever noticed how much comedy revolves around things that irritate, frustrate, and humiliate us?",
            "Title": "How to make your writing...",
            "VideoId": "zNTxSBgDNp4",
            "Controls": "start=185"
        },
        {
            "Text": " For animals that are similar to us, like mammals, it's often obvious when they're hurting. But there's a lot that isn't obvious, like whether pain relievers that work on us also help them. And the more different an animal is from us, the harder it is to understand their experience.",
            "Title": "How do animals...",
            "VideoId": "5j9Syov0AAw",
            "Controls": "start=42"
        },
        {
            "Text": " magazines this is surprising especially since they're loose there's going to be a good bust this is obviously thousands of rounds we're gonna be here awhile trying to sort it all out but just to give you an idea this tab is around I would say at least three inches deep",
            "Title": "Truckload of Ammo PIPE...",
            "VideoId": "nIGe1EtB3Tk",
            "Controls": "start=172"
        },
        {
            "Text": " strengthens those brain functions, allowing us to apply that strength to other activities. The most obvious difference between listening to music and playing it is that the latter requires fine motor skills, which are controlled in both hemispheres of the brain.",
            "Title": "How playing an...",
            "VideoId": "R0JKCYZ8hng",
            "Controls": "start=125"
        },
        {
            "Text": " that have actually been happening to, for example, boost police training. How hard a process is that? Well, one of the glorious things that's starting to happen now is that the collapse of these systems and the consequences are becoming obvious.",
            "Title": "Gary Haugen: The hidden...",
            "VideoId": "ofsncCF9O_U",
            "Controls": "start=1169"
        },
        {
            "Text": " in particular relies on the cassowary to germinate it goes through cassery's gut and once it's done that it is obviously food out and it is able to grow in its own little pile of casserole fertilizer australia's wildlife is found nowhere",
            "Title": "Filming The World's...",
            "VideoId": "SuVjOqtcHxE",
            "Controls": "start=332"
        },
        {
            "Text": " without paying royalties. Despite changes in character names and minor plot points, the parallels were obvious, and the studio was sued into bankruptcy. To prevent more plagiarism attempts, Stoker's widow decided to establish copyright",
            "Title": "How did Dracula become...",
            "VideoId": "7uiyz3139tE",
            "Controls": "start=235"
        },
        {
            "Text": " wanted to go in to that room but it was forbidden for me as my parents told me you can enter once you learn how to play chess so obviously I was very motivated to learn the game in the beginning it was only a game for me but it became",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=71"
        },
        {
            "Text": " Now that we're integrating them into the compound, one of the most important aspects is obviously being on display here, where the public can see them.",
            "Title": "Tiger Cubs Swimming For...",
            "VideoId": "RPekEt1Kjg8",
            "Controls": "start=0"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-barkley.webp",
            "Text": "Kids are born into the situation they're born into, and obviously, they have no control over that. And we, as adults, it's up to us to take care of kids - that's part of your moral responsibility. I always tell people, 'There's two groups we should take care of - old people and young people.",
            "Title": "American Baseball Player",
            "Name": "Charles Barkley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dakota-fanning.webp",
            "Text": "I think that role model is kind of a weird thing because obviously you are, but I try to make good choices and good decisions for myself for me to have a good life. If that inspires someone else, that is great, but I think you should do good for yourself and your own happiness.",
            "Title": "American Actress",
            "Name": "Dakota Fanning"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/t-s-eliot.webp",
            "Text": "It is obvious that we can no more explain a passion to a person who has never experienced it than we can explain light to the blind.",
            "Title": "American Poet",
            "Name": "T. S. Eliot"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-miller.webp",
            "Text": "Life has to be given a meaning because of the obvious fact that it has no meaning.",
            "Title": "American Author",
            "Name": "Henry Miller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ninja.webp",
            "Text": "Obviously I love Sony; I love PlayStation. I've been playing them my entire life.",
            "Title": "American Celebrity",
            "Name": "Ninja"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/fabio-cannavaro.webp",
            "Text": "Obviously I want to win something important, this game is important to me.",
            "Title": "Italian Athlete",
            "Name": "Fabio Cannavaro"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/k-l-rahul.webp",
            "Text": "I obviously respect the opportunity I have got to play for the country.",
            "Title": "Indian Athlete",
            "Name": "K. L. Rahul"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zinedine-zidane.webp",
            "Text": "Obviously fashion is a completely different world from football.",
            "Title": "French Athlete",
            "Name": "Zinedine Zidane"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jenna-johnson.webp",
            "Text": "I think my personality, obviously is very loud and out there.",
            "Title": "American Athlete",
            "Name": "Jenna Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/justin-lin.webp",
            "Text": "Obviously, 'Fast' has been a big part of my life.",
            "Title": "American Director",
            "Name": "Justin Lin"
        }
    ]
}