{
    "currentWord": {
        "wordRoot": "outstanding",
        "id": 26176,
        "phonemic": "aʊtˈstændɪŋ|aʊtˈstændɪŋ\r",
        "bigId": "bc0ad8e4-485d-45cb-b142-3255c5c86167",
        "wordForms": [
            "outstanding"
        ]
    },
    "senses": [
        {
            "id": "bc0ad8e4-485d-45cb-b142-3255c5c86167",
            "de": "Very good or impressive",
            "ty": "adjective",
            "ex": "She gave an outstanding performance in the school play.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "outstanding performance",
                " outstanding achievement",
                " outstanding contribution"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bc0ad8e4-485d-45cb-b142-3255c5c86167.webp",
            "Tips": [
                {
                    "title": "Exceptional Praise",
                    "description": "Use 'outstanding' when you want to praise something as better than average; it shows high appreciation.",
                    "example": "Your dedication is truly outstanding.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/myPuXevFgZLYPyhgbRDruM1yXz8.webp"
                },
                {
                    "title": "High Recognition",
                    "description": "'Outstanding' often describes something recognized by others as excellent, not just personal opinion.",
                    "example": "He received an award for his outstanding work.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/VehJYqs5uQwnGHX721xqBUKqgg.webp"
                },
                {
                    "title": "Not Ordinary",
                    "description": "The word implies something is far from ordinary; it stands out significantly among others.",
                    "example": "The scientist made an outstanding discovery.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/wPVe8ZhZfMeF9HfmrtBzOTzXrMY.webp"
                }
            ]
        },
        {
            "id": "ceec4ecb-40d7-4f64-87ad-f13e2969e454",
            "de": "Not yet paid, resolved, or dealt with",
            "ty": "adjective",
            "ex": "I still have some outstanding bills to pay.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "outstanding bills",
                " outstanding issues",
                " outstanding debts"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ceec4ecb-40d7-4f64-87ad-f13e2969e454.webp",
            "Tips": [
                {
                    "title": "Requires Attention",
                    "description": "In contexts of tasks or duties, 'outstanding' suggests urgency or importance to resolve or address it.",
                    "example": "We discussed the outstanding issues before the deadline.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Pending Status",
                    "description": "Indicates something is pending and highlights the need for completion or action.",
                    "example": "You have outstanding paperwork to submit.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Financial Obligations",
                    "description": "Often relates to money, suggesting that a payment or settlement is still to be made.",
                    "example": "She has several outstanding loans.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "687dcf96-4ac9-460b-89d6-4344f61fb866",
            "de": "Clearly noticeable; conspicuous",
            "ty": "adjective",
            "ex": "His outstanding feature is his sharp nose.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "outstanding feature",
                " outstanding characteristic",
                " outstanding trait"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/687dcf96-4ac9-460b-89d6-4344f61fb866.webp",
            "Tips": [
                {
                    "title": "Easily Noticed",
                    "description": "'Outstanding' means it captures attention easily due to being very noticeable or different.",
                    "example": "The building's architecture is outstanding.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Memorable Quality",
                    "description": "Describes a feature or trait that is memorable and leaves a strong impression on others.",
                    "example": "Her voice is her most outstanding quality.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Excellent": {
            "wordRoot": "Excellent",
            "wordDefinition": "Excellent and outstanding are both words used to describe something as exceptional or beyond average.\n\nHowever, outstanding is usually reserved for something that is even better than excellent. For example, if you get an A+ on a test, you might be described as having done an excellent job.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/413360c9-1c70-48fe-b520-83fa6978e325.webp"
        },
        "Exceptional": {
            "wordRoot": "Exceptional",
            "wordDefinition": "Exceptional means something that is above average or remarkable, while outstanding means something that is excellent or distinguished.\n\nFor example, you could say that someone's academic performance was exceptional if they got straight A's on all their exams.\n\nBoth words can describe something that is very good, but each one is more suited to different contexts. Exceptional is typically used to describe something that is better than usual, while outstanding describes something that stands out from the rest of the crowd.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f2542277-2c41-485b-ad13-b6cc153f7eb0.webp"
        },
        "Extraordinary": {
            "wordRoot": "Extraordinary",
            "wordDefinition": "Extraordinary means something that is beyond what is usual or ordinary, while outstanding implies excellence or exceptional quality.\n\nFor example, if someone did something that is beyond the scope of ordinary experience, then it can be considered extraordinary.\n\nExtraordinary describes something that is unique or exceptional, while outstanding describes something that is excellent or superior.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d72e46d7-5aac-401d-a06d-c34b73e7aa15.webp"
        },
        "Magnificent": {
            "wordRoot": "Magnificent",
            "wordDefinition": "Both words, magnificent and outstanding, mean something that is very impressive or excellent.\n\nHowever, magnificent is used more to describe something grand, beautiful, or majestic, like a palace or a sunset. While outstanding is used more to describe something remarkable, excellent in quality or performance, like a student's grades or an athlete's performance in a game.\n\nYou can use magnificent when you want to talk about something grand and beautiful, and outstanding when you want to describe something excellent in quality and performance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1e0e8c98-729c-44c2-9c08-76a81325f94b.webp"
        },
        "Remarkable": {
            "wordRoot": "Remarkable",
            "wordDefinition": "Remarkable means worthy of attention or being unusual or extraordinary.\n\nFor example, if someone has a rare talent or a unique skill, that person can be described as remarkable.\n\nIn summary, while both words indicate something extraordinary, outstanding emphasizes quality or achievement, while remarkable emphasizes uniqueness or noteworthiness.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/32853288-13d2-49c3-bed6-3a38b1aa4fb9.webp"
        },
        "Splendid": {
            "wordRoot": "Splendid",
            "wordDefinition": "Splendid on the other hand, is often used to describe something that is visually impressive or beautiful.\n\nWe might describe a sunset, a view, or an outfit as splendid.\n\nOutstanding is more commonly used to describe achievements or performance, while splendid describes appearance or visual aspects.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8ac8f118-62c8-4a86-b8b2-f383c8289116.webp"
        },
        "Superb": {
            "wordRoot": "Superb",
            "wordDefinition": "Both outstanding and superb are adjectives that denote high quality and excellence.\n\nSuperb means extremely good in a way that surpasses expectations.\n\nIt is generally used to describe something that is flawless or perfect. For example: \"The service at the restaurant was superb, the food was cooked to perfection.\".\n\nOutstanding is used to highlight something as exceptional, while superb emphasizes something as being of the highest quality.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e9a86c99-dc32-4fb7-a226-8086ecf8f122.webp"
        },
        "Superior": {
            "wordRoot": "Superior",
            "wordDefinition": "Superior refers to something that is better than something else or of higher quality.\n\nIt can also mean being in a higher rank or position. For example, a superior product or a superior officer.\n\nBoth words are used to describe excellence, but outstanding is more focused on uniqueness and distinction while superior is more focused on being better in terms of quality or rank.\n\nOutstanding describes something exceptional and impressive, while superior describes something of higher quality or better in comparison to others.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a81e25aa-987e-452c-a4fe-6a0423adcd48.webp"
        }
    },
    "videos": [
        {
            "Text": " and window bottles out of garbage. Now I don't expect every kid to be a farmer, but I expect you to read about it, write about it, blog about it, offer outstanding customer service. I expect them to be engaged, and man, are they! So that's my incredible classroom, that's the food. Where does it go? Zero miles to plate, right down into the cafeteria. Or more importantly, to local shelters,",
            "Title": "Stephen Ritz: A teacher...",
            "VideoId": "RF6qTlgtHU0",
            "Controls": "start=586"
        },
        {
            "Text": " garbage the unexpected kid to be a farmer they expect read about it write about a blog about it offer outstanding customer service I expect me engage man are they so that's my incredible classroom that's the food where does it go zero miles to plate right down into the cafeteria or more importantly to local shelters where",
            "Title": "A teacher growing green...",
            "VideoId": "mZC-kzM_E4o",
            "Controls": "start=587"
        },
        {
            "Text": " healthy and the hong kong and shanghai bank changed to eight that changed to hsbc to help the bank expand globally real words like uber and slack are ripped right out of a dictionary and suggest attributes or benefits uber literally means an outstanding",
            "Title": "How to create a great...",
            "VideoId": "rzbXht7MJVM",
            "Controls": "start=77"
        },
        {
            "Text": " conservation the wildlife is coming back we've traveled to the karika Game Reserve and over the next four episodes accompanied by our guide Joe we will look at some outstanding biology witness some extraordinary behavior and get an",
            "Title": "Africa's Deadliest...",
            "VideoId": "ZIGywWDfwzc",
            "Controls": "start=43"
        },
        {
            "Text": " who take outstanding care of their animal patients. But occasionally, they do reach into the human medical community, particularly for some speciality consultation, and I was one of the lucky physicians who was invited in to help.",
            "Title": "Barbara Natterson-Horowit...",
            "VideoId": "2tBuvxXxlS4",
            "Controls": "start=55"
        },
        {
            "Text": " are only as strong as the health of their women. And that's important to keep in mind. Part of that health includes an outstanding education. The difference between a struggling family and a healthy one",
            "Title": "Michelle Obama's plea...",
            "VideoId": "F73O3_im0Wo",
            "Controls": "start=425"
        },
        {
            "Text": " How many of you had to fill out a web form where you've been asked to read a distorted sequence of characters like this? How many of you found it really annoying? OK, outstanding. So I invented that.",
            "Title": "Massive-scale online...",
            "VideoId": "-Ht4qiDRZE8",
            "Controls": "start=13"
        },
        {
            "Text": " And it's a tremendous problem for us. The outstanding -- the salient problem about this for us is that these are places that are not worth caring about. We're going to talk about that some more.",
            "Title": "James Kunstler: How bad...",
            "VideoId": "Q1ZeXnmDZMQ",
            "Controls": "start=85"
        },
        {
            "Text": " you very much for all that you will continue to do as advocates of the ocean and cultural heritage management I think it was a great year did some outstanding work with that said we're gonna",
            "Title": "These Divers Search For...",
            "VideoId": "u2l_EugvRw8",
            "Controls": "start=739"
        },
        {
            "Text": " is that men who are influenceable also tended to be \"outstanding fathers.\" So How influenceable is your man? you're with her because you respect her.",
            "Title": "3 ways to build a happy...",
            "VideoId": "aRcD31sA2a0",
            "Controls": "start=462"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dan-obrien.webp",
            "Text": "I didn't get a ton of interest from colleges in baseball and football, but I was outstanding in track and had the sense that this would be my meal ticket... Track was a sport where I saw immediate improvement, and I had a lot of good support behind me... and the coaches had a lot of experience and pushed me in that direction for sure.",
            "Title": "American Athlete",
            "Name": "Dan O'Brien"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-spurrier.webp",
            "Text": "I think I've got an outstanding defensive assistant staff that's really going to help us have consistent, strong defenses. And offensively, we have an excellent staff. We've got some younger guys on offense, but that's what I coach and have my entire coaching career.",
            "Title": "American Coach",
            "Name": "Steve Spurrier"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/r-lee-ermey.webp",
            "Text": "Even though I disagree with many of the changes, when I see the privates graduate at the end of the day, when they walk off that drill field at the end of the ceremony, they are still fine privates; outstanding, well motivated privates.",
            "Title": "American Soldier",
            "Name": "R. Lee Ermey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joe-namath.webp",
            "Text": "I think I could have become an outstanding professional baseball player, but I don't think I could have reached the heights that I have in football - being one of the very top players in the game, being a world champion.",
            "Title": "American Athlete",
            "Name": "Joe Namath"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-case.webp",
            "Text": "I was not an outstanding student. I did a reasonable amount of work. I got generally good - pretty good grades, but I was not that passionate about getting straight A's.",
            "Title": "American Businessman",
            "Name": "Steve Case"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/najib-razak.webp",
            "Text": "You should allow professors to become really outstanding academicians, recognised worldwide, and you should reward them.",
            "Title": "Malaysian Politician",
            "Name": "Najib Razak"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/betty-field.webp",
            "Text": "I'm not an outstanding personality, and I'm certainly no beauty. Acting ability is all I've got to trade on.",
            "Title": "American Actress",
            "Name": "Betty Field"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-jay-gould.webp",
            "Text": "What you see is that the most outstanding feature of life's history is a constant domination by bacteria.",
            "Title": "American Scientist",
            "Name": "Stephen Jay Gould"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nicky-morgan.webp",
            "Text": "We have outstanding schools, world-class teaching and inspirational leadership across the country.",
            "Title": "British Politician",
            "Name": "Nicky Morgan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-davies.webp",
            "Text": "The origin of life is one of the great outstanding mysteries of science.",
            "Title": "British Writer",
            "Name": "Paul Davies"
        }
    ]
}