{
    "currentWord": {
        "wordRoot": "petition",
        "id": 18819,
        "phonemic": "pəˈtɪʃn|pəˈtɪʃn\r",
        "bigId": "945d5675-3a1d-48be-8ea4-a5811899fec0",
        "wordForms": [
            "petitions",
            "petitioning",
            "petitioned",
            "petitioner",
            "petition"
        ]
    },
    "senses": [
        {
            "id": "945d5675-3a1d-48be-8ea4-a5811899fec0",
            "de": "A formal written request, often signed by many people, asking for something from a government or other authority",
            "ty": "noun",
            "ex": "They started a petition to stop the new building project.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "sign a petition",
                " start a petition",
                " submit a petition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/945d5675-3a1d-48be-8ea4-a5811899fec0.webp",
            "Tips": [
                {
                    "title": "Social Influence",
                    "description": "Petitions often reflect public opinion and seek to persuade authorities by showing widespread support.",
                    "example": "The petition garnered thousands of signatures, indicating strong community support.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/8YU2bab4WENvDLz9oGDjPMkT4.webp"
                },
                {
                    "title": "Formal Request",
                    "description": "Petitions are formal; they follow specific formats and sometimes require a minimum number of signatures.",
                    "example": "Their petition followed protocol, including a clear statement of purpose and supporting signatures.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/6UyHKQF3pCA1LoKGnhERqnrb9Qw.webp"
                },
                {
                    "title": "Action Motivation",
                    "description": "Petitions aim to provoke change or action from authorities, not just to express an opinion.",
                    "example": "The petition called for immediate legislative reform.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/VXgsnbZiqviYTdrttmmGPa4kao.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "3a296df9-beb1-4a51-8fdf-dee9ad5b9b6e",
            "de": "To make a formal written request to a government or other authority",
            "ty": "verb",
            "ex": "The group petitioned the government to protect the rights of animals.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "petition for",
                " petition against",
                " petition to"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3a296df9-beb1-4a51-8fdf-dee9ad5b9b6e.webp",
            "Tips": [
                {
                    "title": "Seeking Intervention",
                    "description": "When petitioning, one usually seeks intervention or action on matters where they lack direct control.",
                    "example": "Residents petitioned the city council to improve road safety.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Formal Appeal",
                    "description": "The act of petitioning is a respectful and formal appeal, unlike casual requests or demands.",
                    "example": "They petitioned the company for clearer communication regarding employee benefits.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "57cf5ffc-d56d-401c-9431-9614dcb9907a",
            "de": "A request made to God in a religious service",
            "do": "Religious",
            "ty": "noun",
            "ex": "The priest read the petition before the congregation in the church.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "prayer petition",
                " write a petition",
                " church petition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/57cf5ffc-d56d-401c-9431-9614dcb9907a.webp",
            "Tips": [
                {
                    "title": "Spiritual Request",
                    "description": "In religious contexts, a petition is a sincere request reflecting faith, communicated in prayer.",
                    "example": "The congregation presented their petitions for peace to the divine in solemn prayer.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Communal Aspect",
                    "description": "Religious petitions can be community-centered, shared by many individuals with a common spiritual goal.",
                    "example": "During the service, we joined in a communal petition for the sick members of our church.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Appeal": {
            "wordRoot": "Appeal",
            "wordDefinition": "Appeal is a legal term that means to request a higher court to review and possibly change a decision by a lower court.\n\nThis is used to challenge a court decision that a person or organization disagrees with. For example, if someone is found guilty in a trial, they can appeal to a higher court to review and possibly overturn the verdict.\n\nAppeal is used in legal situations to challenge a decision, while petition is used to ask for action or change from an authority figure or government.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/955e6ba3-1d10-4b21-aa6c-9760ad9e37d7.webp"
        },
        "Application": {
            "wordRoot": "Application",
            "wordDefinition": "An application is a formal request made by someone in order to receive permission, be accepted for a certain position or program, or to get something they need.\n\nFor example, if you are applying for a job or a college program, you fill out an application form.\n\nSo, while both words involve making a request, applications are used to ask for something you want, while petitions are used to ask for change.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ef73b777-afc5-4c4b-99e7-f82691c362d3.webp"
        },
        "Entreaty": {
            "wordRoot": "Entreaty",
            "wordDefinition": "Entreaty means to earnestly ask or beg for something. It's usually a personal appeal, that is full of emotion and often addressed to someone in authority.\n\nA good example of this may be a child making an entreaty to his or her parents to allow them to go to a party.\n\nSo, in brief, entreaty is for a personal and emotional appeal, while petition is for a formal request for a collective need.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6850a2f5-2284-496d-bc93-1e3e300afdb1.webp"
        },
        "Plea": {
            "wordRoot": "Plea",
            "wordDefinition": "A plea is a request made by an individual for mercy or leniency in a legal case or personal matter. For example, a plea of guilty or not guilty in a court hearing or a plea for forgiveness in a personal conflict.\n\nA petition is used for issues of public concern, while a plea is used for personal matters or legal cases.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/116691f0-081b-4bdf-914b-4ac80ae0bc0b.webp"
        },
        "Prayer": {
            "wordRoot": "Prayer",
            "wordDefinition": "Prayer refers to a spiritual practice of communicating with a deity or higher power.\n\nIt is often used in religious contexts as an expression of gratitude or a request for guidance or blessings. For example, a person may offer a prayer before a meal or in times of personal turmoil.\n\nPetition is used to request a specific action from an authority or leader, while prayer is a spiritual practice used to communicate with a higher power.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4834529c-b63b-4846-addf-22a320ced836.webp"
        },
        "Request": {
            "wordRoot": "Request",
            "wordDefinition": "Request is used when a person wants to ask or suggest something to someone else. It could be a casual or formal ask for information, a favor or an action.\n\nBut if an individual wants to ask their teacher for extra help after school, they could make a request.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4473aba0-12db-42df-8a94-7cfaac7e02a2.webp"
        },
        "Solicit": {
            "wordRoot": "Solicit",
            "wordDefinition": "Solicit means to ask someone for something, usually something like money or support. It's often used by charities or fundraisers who are seeking donations.\n\nFor example, a non-profit organization might solicit donations from the public to support their cause.\n\nThe main difference between these words is that petition is a formal request for action or change, while solicit is a request for support or donations.\n\nPetition is more often used for change on a societal level, while solicit is more often used for fundraising or asking for support for a specific cause or organization.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5437b01f-de7a-4c1c-a1be-42859f16bfb5.webp"
        },
        "Suit": {
            "wordRoot": "Suit",
            "wordDefinition": "A suit is a legal action brought to court to settle a dispute between two parties. The suit can be filed for various reasons such as to seek damages, to terminate a contract, or to challenge a decision made by a government agency.\n\nA petition is a request for a change, while a suit is a legal action taken to resolve a dispute. Petitions are usually non-legal and don't involve a court process, while suits are legal and involve the court system.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2702a922-ebb2-4579-97d3-a3f92ee7db48.webp"
        },
        "Supplication": {
            "wordRoot": "Supplication",
            "wordDefinition": "A supplication is a humble request or plea, usually made in a religious or spiritual context. It is a form of prayer that seeks help, guidance or forgiveness from a higher power.\n\nA petition is applicable in situations where a group of people are seeking action or change from a particular authority or organization, while a supplication is more personal and often made in a spiritual or religious setting.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/094d6bd0-cd7c-4c4e-8abe-3d032f06b6ef.webp"
        }
    },
    "videos": [
        {
            "Text": " And together with them, we started a multi-layered approach, based on an on- and off-line signature petition, educational and inspirational presentations at schools and we raise general awareness at markets, festivals, beach clean-ups. And last but not least, we distribute alternative bags, bags like net bags, recycled newspaper bags",
            "Title": "Our campaign to ban...",
            "VideoId": "P8GCjrDWWUM",
            "Controls": "start=190"
        },
        {
            "Text": " and what authority each branch of government has over its citizens. Besides voting, chances are that some time in your life you'll be called upon to participate in your government, whether it is to serve on a jury, testify in court, or petition your Congress person to pass or defeat an idea for a law. By knowning the branches,",
            "Title": "How is power divided in...",
            "VideoId": "HuFR5XBYLfU",
            "Controls": "start=188"
        },
        {
            "Text": " ironic petition on behalf of the Sharks of Africa basically saying please keep up the slave trade because otherwise we're gonna run out of food to eat and so you know in all these ways sharks were seen as you know these negative creatures that we're preying on you know whether with slaves or sailors people",
            "Title": "Juliet Eilperin: Demon...",
            "VideoId": "2oxhdcQWzbA",
            "Controls": "start=529"
        },
        {
            "Text": " petition with two million signatures being delivered to the European Parliament calling for action the cause has been taken up by the conservation world's leading figures eating chimpanzees and gorillas make no moral ethical or conservation sense we are largely they they are largely us I think",
            "Title": "Eating Gorillas PIPE Ape...",
            "VideoId": "ESWuWpO8DR8",
            "Controls": "start=91"
        },
        {
            "Text": " \"No, I'm leaving today.\" Outside the jail, the whole country went into a frenzy, some attacking me badly, and others supportive and even collecting signatures in a petition to be sent to the king to release me. I was released after nine days.",
            "Title": "A Saudi woman who dared...",
            "VideoId": "vNpmq6Ok-QQ",
            "Controls": "start=327"
        },
        {
            "Text": " their own started a petition to ask their local phone companies to provide Wikipedia for free and I'm going to show you a video of these kids which i think is pretty amazing every time they show this at the office somebody has to leave",
            "Title": "Making data free for...",
            "VideoId": "BbLlo8rXcI4",
            "Controls": "start=217"
        },
        {
            "Text": " than collective production. A few brave painters, who for many centuries, had been paid by the square foot, successfully petitioned their patrons to pay them on the basis of merit instead. Within a single generation,",
            "Title": "Is there a difference...",
            "VideoId": "tVdw60eCnJI",
            "Controls": "start=146"
        },
        {
            "Text": " really changing Chinese mindsets and Chinese life. For example, they give the voiceless people a channel to make your voice heard. We had a petition system. It's a remedy outside the judicial system,",
            "Title": "Michael Anti: Behind the...",
            "VideoId": "yrcaHGqTqHk",
            "Controls": "start=603"
        },
        {
            "Text": " We leveraged a network of doctors on social media to raise awareness and started a petition targeted at the WHO. For two weeks, our members spread the word digitally and on the streets,",
            "Title": "A global movement to...",
            "VideoId": "v6mknkg7MEc",
            "Controls": "start=430"
        },
        {
            "Text": " the honest appraisers got together a formal petition begging the federal government to act, and the industry to act, to stop this epidemic of appraisal fraud.",
            "Title": "How to rob a bank (from...",
            "VideoId": "ClfBxWPkBKU",
            "Controls": "start=281"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elijah-kelley.webp",
            "Text": "Party Up' is like 'Ferris Bueller's Day Off' crossed with 'House Party.' It's basically about this kid, my character, who's this smooth, intelligent kid who's petitioning to throw this big end-of-the-year-bash house party, and so he goes and manipulating different people and ruining lives. He somewhat has a selfish heart, but he's a nice guy.",
            "Title": "American Actor",
            "Name": "Elijah Kelley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ellen-g-white.webp",
            "Text": "Ministers should not pray so loud, and long, as to exhaust the strength. It is not necessary to weary the throat and lungs in prayer. God's ear is ever open to hear the heart-felt petitions of his humble servants, and he does not require them to wear out the organs of speech in addressing him.",
            "Title": "American Writer",
            "Name": "Ellen G. White"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-otis.webp",
            "Text": "I have accordingly considered it, and now appear not only in obedience to your order, but likewise in behalf of the inhabitants of this town, who have presented another petition, and out of regard to the liberties of the subject.",
            "Title": "American Lawyer",
            "Name": "James Otis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/woodrow-wilson.webp",
            "Text": "Business underlies everything in our national life, including our spiritual life. Witness the fact that in the Lord's Prayer, the first petition is for daily bread. No one can worship God or love his neighbor on an empty stomach.",
            "Title": "American President",
            "Name": "Woodrow Wilson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/blase-j-cupich.webp",
            "Text": "The open and generous nature of the American people has the capacity to astonish and push boundaries. We crowdfund, sign petitions, dump buckets of ice on ourselves, and embrace new ways of relating to our environment.",
            "Title": "American Clergyman",
            "Name": "Blase J. Cupich"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hernan-cortes.webp",
            "Text": "Thus they have an idol that they petition for victory in war; another for success in their labors; and so for everything in which they seek or desire prosperity, they have their idols, which they honor and serve.",
            "Title": "Spanish Leader",
            "Name": "Hernan Cortes"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rodney-frelinghuysen.webp",
            "Text": "I have been pleased to receive petitions from groups that seek a range of new gun control measures and groups and individuals who believe additional laws are unnecessary or unwise.",
            "Title": "American Politician",
            "Name": "Rodney Frelinghuysen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/howard-rheingold.webp",
            "Text": "I think e-mail petitions are an illusion. It gives people the illusion that they're participating in some meaningful political action.",
            "Title": "American Critic",
            "Name": "Howard Rheingold"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vincent-mcnabb.webp",
            "Text": "St. Thomas is right. The essential prayer is the prayer of petition.",
            "Title": "Irish Clergyman",
            "Name": "Vincent McNabb"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shane-macgowan.webp",
            "Text": "Petitions are ridiculous.",
            "Title": "Irish Musician",
            "Name": "Shane MacGowan"
        }
    ]
}