{
    "currentWord": {
        "wordRoot": "physical",
        "id": 15222,
        "phonemic": "ˈfɪzɪkl|ˈfɪzɪkl\r",
        "bigId": "ad4db66d-9dfe-402f-91b6-bb225f0e8387",
        "wordForms": [
            "physicals",
            "physically",
            "physical"
        ]
    },
    "senses": [
        {
            "id": "ad4db66d-9dfe-402f-91b6-bb225f0e8387",
            "de": "Related to the body, as opposed to the mind or spirit",
            "ty": "adjective",
            "ex": "She is in good physical health after going to gym regularly",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "physical health",
                " physical activity",
                " physical fitness"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/ad4db66d-9dfe-402f-91b6-bb225f0e8387.webp",
            "Tips": [
                {
                    "title": "Body and Health",
                    "description": "Emphasizes the condition or aspects of the human body, not emotion or intellect.",
                    "example": "Regular exercise improves your physical state.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/mGLOUZ1huRX83SVw0iDjMLC8bZs.webp"
                },
                {
                    "title": "Not Mental",
                    "description": "'Physical' contrasts with mental activities; it's about the corporeal world.",
                    "example": "Chess is mental, while swimming is physical.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/zfkv62gPEDM0jEtDczSMz95F6M.webp"
                }
            ]
        },
        {
            "id": "3fb1141a-bd7a-48ad-b225-ca3c44540c29",
            "de": "Involving contact or impact",
            "ty": "adjective",
            "ex": "Football is a very physical sport",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "physical contact",
                " physical violence",
                " physical sport"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3fb1141a-bd7a-48ad-b225-ca3c44540c29.webp",
            "Tips": [
                {
                    "title": "Touch and Impact",
                    "description": "Often implies the sense of touch or actual collision or contact.",
                    "example": "The play had several physical confrontations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Violent",
                    "description": "Physical interaction can be gentle, like a handshake, not just aggressive.",
                    "example": "Their physical greeting was a warm hug.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "42abc730-3230-4068-9941-a3de59684544",
            "de": "Related to material things or natural sciences",
            "do": "Science",
            "ty": "adjective",
            "ex": "The physical properties of a gas",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "physical properties",
                " physical sciences",
                " physical laws"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/42abc730-3230-4068-9941-a3de59684544.webp",
            "Tips": [
                {
                    "title": "Observable Qualities",
                    "description": "Refers to qualities that can be seen, felt, or measured, not abstract.",
                    "example": "Ice's physical state changes when it melts.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Theoretical",
                    "description": "Physical science deals with concrete natural phenomena, unlike theoretical science.",
                    "example": "Studying the physical structure of DNA requires observation.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Real-world Application",
                    "description": "Emphasizes practical experiments and evidence in the physical world.",
                    "example": "Engineers test the physical durability of materials.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "bc81dabd-f796-4878-9fa8-c37949a3761f",
            "de": "Sexual activity",
            "ty": "adjective",
            "ex": "They were involved in a physical relationship",
            "use": "",
            "co": "Colloquial",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "physical relationship",
                " physical intimacy"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bc81dabd-f796-4878-9fa8-c37949a3761f.webp",
            "Tips": [
                {
                    "title": "Physical Connection",
                    "description": "The term may imply a romantic or sexual aspect, involving bodily closeness.",
                    "example": "Their dance routine was very physical.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "39eb8bef-8eba-4d72-b4f8-722d75074ff8",
            "de": "A medical examination",
            "do": "Medical",
            "ty": "noun",
            "ex": "I am going for my annual physical later today",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "annual physical",
                " routine physical"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/39eb8bef-8eba-4d72-b4f8-722d75074ff8.webp",
            "Tips": [
                {
                    "title": "Medical Check",
                    "description": "A 'physical' in medical terms means a thorough health examination by a doctor.",
                    "example": "He passed his physical with flying colors.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Routine Assessment",
                    "description": "A physical is a regular check-up; it doesn't imply illness or medical issue.",
                    "example": "The job requires an annual physical.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Preventive Healthcare",
                    "description": "Getting a physical is part of staying healthy, not just diagnosing problems.",
                    "example": "She schedules a physical every year as a precaution.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Bodily": {
            "wordRoot": "Bodily",
            "wordDefinition": "Bodily relates to the body, or physical being of a person, while physical relates to the overall physical world.\n\nFor example, if someone says they have bodily pain, it means there is pain in the physical sensations of their body.\n\nBodily is more specific to the physical body of an individual while physical can encompass a broader range of objects or phenomena in the physical world.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7f039c3d-ede8-4aad-9f90-9887fe8ccbf3.webp"
        },
        "Concrete": {
            "wordRoot": "Concrete",
            "wordDefinition": "Concrete refers to something that is tangible and can be perceived through the senses such as touch, sight, or hearing.\n\nFor example, a concrete object would be something like a book or a table that you can physically touch and see. Physical refers to anything related to the body or material world.\n\nConcrete refers to tangible, material things, while physical refers to anything related to the body or material world – both tangible and intangible.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3a670c88-55db-49d5-ae45-7224f169e905.webp"
        },
        "Corporeal": {
            "wordRoot": "Corporeal",
            "wordDefinition": "Corporeal refers to something related to the physical body, whereas physical refers to something related to the material world.\n\nFor example, when we say a person is corporeal, we are referring to their physical body, whereas when we say something is physical, we can be referring to anything tangible or material, such as objects or substances.\n\nCorporeal is often used in medical or scientific contexts to describe bodily functions, whereas physical is more commonly used in everyday speech to describe things we can see, touch, or feel.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6a9ed581-e590-4376-8f1b-f931dd7b7c33.webp"
        },
        "Material": {
            "wordRoot": "Material",
            "wordDefinition": "Material refers to objects that are made of matter, such as wood, metal, plastic, and fabric.\n\nIt can also refer to things that are important or relevant, like \"material evidence\" in a court case.\n\nMaterial refers to the substance or composition of an object, while physical refers to its observable properties or characteristics.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf40d611-a733-45e4-89b6-7d03cd83581b.webp"
        },
        "Palpable": {
            "wordRoot": "Palpable",
            "wordDefinition": "Palpable and physical are two words that have some similarities but also differences.\n\nPalpable means something that can be felt or touched, often metaphorically. For example, tension in a room can be palpable or emotions can be palpable.\n\nPalpable usually describes something that is not easily seen but can be sensed through touch or feeling.\n\nThe main difference between the two words is that palpable describes something that is sensed through touch or feeling, while physical describes something that is seen or touched physically.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/62e6ea85-ff18-4b39-8ddc-9689840fbd59.webp"
        },
        "Solid": {
            "wordRoot": "Solid",
            "wordDefinition": "Solid refers to an object that has a definite shape and volume, and it is one of the three states of matter (the other two are liquid and gas).\n\nSolids hold their shape and cannot be compressed easily. For example, a rock is a solid because it has a fixed size and shape.\n\nPhysical can be used broadly for anything related to the body or energy, whereas solid is specifically for a state of matter with a definite shape and volume.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/02ddc596-e79e-4eb4-8a08-dbcf94486565.webp"
        },
        "Substantial": {
            "wordRoot": "Substantial",
            "wordDefinition": "Substantial refers to something that is significant, important, or considerable. It is related to the idea of quality, mass, or impact, rather than to its materiality.\n\nHowever, in order to be substantial, it has to meet certain requirements, such as being functional, safe, attractive, and useful.\n\nHowever, in order to be substantial, it has to reflect their well-being, vitality, and quality of life, which may depend on other factors, such as their diet, exercise, sleep, or mental state.\n\nIn summary, physicality refers to the material aspect of things, while substantiality refers to their meaningfulness, value, or impact.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/95444393-dfd0-4242-b0cf-a79e5ab7c0d4.webp"
        },
        "Tangible": {
            "wordRoot": "Tangible",
            "wordDefinition": "Tangible refers to things that can be touched or felt but doesn't necessarily have a physical form.\n\nIt can apply to abstract concepts or ideas that can be experienced or understood by the senses. For example, an idea can be tangible because you can understand and visualize it, even if you can't touch it.\n\nThe word physical refers to concrete objects or phenomena that occupy physical space, while the word tangible refers to things that can be sensed or experienced, regardless of their physical form.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/96e62900-f289-4a90-bd3c-a6cd7b039a3d.webp"
        }
    },
    "videos": [
        {
            "Text": " It's the shift between thinking of yourself as a thing which has all the experiences of life, and thinking of yourself as simply that collection of all experiences in life. You are the sum of your parts. Now those parts are also physical parts, of course, brains, bodies and legs and things,",
            "Title": "Julian Baggini: Is there...",
            "VideoId": "Q80MfH7xPPE",
            "Controls": "start=256"
        },
        {
            "Text": " is intimately connected to those distant, invisible galaxies. We can think of them as part of our universe. They make up a single, giant edifice obeying the same physical laws and all made from the same types of atoms, electrons, protons, quarks, neutrinos, that make up you and me.",
            "Title": "Questions No One Knows...",
            "VideoId": "7SWvDHvWXok",
            "Controls": "start=204"
        },
        {
            "Text": " freeing up working memory. And if you have the chance, physical activity, like a brisk walk, deepens breathing and helps relieve muscle tension, preventing anxiety from building. You can also use your knowledge about the brain to change your mindset. The brain is flexible,",
            "Title": "Why do people get so...",
            "VideoId": "7snnRaC4t5c",
            "Controls": "start=164"
        },
        {
            "Text": " forcing out your urine too fast, or urinating without proper physical support may over time weaken or overwork that muscular sling. That can lead to an overactive pelvic floor, bladder pain, urgency, or urinary incontinence. So in the interest of long-term health,",
            "Title": "Is it bad to hold your...",
            "VideoId": "Ze4Qmpq48AQ",
            "Controls": "start=193"
        },
        {
            "Text": " Using your muscles will keep them strong enough to support you effectively, on top of all the other benefits to your joints, bones, brain and heart. And if you're really worried, check with a physical therapist, because yes, you really should stand up straight.",
            "Title": "The benefits of good...",
            "VideoId": "OyK0oE5rwFY",
            "Controls": "start=232"
        },
        {
            "Text": " Mastering any physical skill, be it performing a pirouette, playing an instrument, or throwing a baseball, takes practice. Practice is the repetition of an action with the goal of improvement, and it helps us perform with more ease, speed, and confidence.",
            "Title": "How to practice...",
            "VideoId": "f2O6mQkFiiw",
            "Controls": "start=5"
        },
        {
            "Text": " It is considered the edge of the solar system since that is where the gravitational and physical influences of the sun end. Our solar system's particular configuration of planets and other celestial objects, all revolving around a life-giving star,",
            "Title": "Solar System 101 PIPE...",
            "VideoId": "libKVRa01L8",
            "Controls": "start=211"
        },
        {
            "Text": " we love in order to quench our physical and psychological desires. Humans are designed to procreate, but without the ecstasy of passionate love, sex is unsatisfying. Our fear of the cold, cruel world tempts us to build hard shells",
            "Title": "Why do we love? A...",
            "VideoId": "yJSiUm6jvI0",
            "Controls": "start=138"
        },
        {
            "Text": " myself in the way that my peers told me not to because see my journey began wrapping t-shirts on my head because I couldn't afford expensive wigs and because that was my truth I was really cute and physically attacked by the guys",
            "Title": "Walking in your truth as...",
            "VideoId": "EDaR9zAiKbc",
            "Controls": "start=172"
        },
        {
            "Text": " to protect the turtles a brave thing to do we were met with tremendous resistance people would pelt us at night i have had persons um insult me and my heart person cursed me or that person physically",
            "Title": "Saving Leatherback...",
            "VideoId": "xqKQ0NlA4T0",
            "Controls": "start=141"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wayne-dyer.webp",
            "Text": "A mind at peace, a mind centered and not focused on harming others, is stronger than any physical force in the universe.",
            "Title": "American Psychologist",
            "Name": "Wayne Dyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-hawking.webp",
            "Text": "I believe there are no questions that science can't answer about a physical universe.",
            "Title": "English Physicist",
            "Name": "Stephen Hawking"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-harrison.webp",
            "Text": "If we were all perfected beings, we wouldn't be here in the physical world.",
            "Title": "British Musician",
            "Name": "George Harrison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shweta-tripathi.webp",
            "Text": "I am always physically and emotionally invested in the characters I play.",
            "Title": "Indian Actress",
            "Name": "Shweta Tripathi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/twyla-tharp.webp",
            "Text": "It's very important to work myself physically as hard as I can.",
            "Title": "American Dancer",
            "Name": "Twyla Tharp"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tim-obrien.webp",
            "Text": "I learned that moral courage is harder than physical courage.",
            "Title": "American Author",
            "Name": "Tim O'Brien"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/katey-sagal.webp",
            "Text": "I've certainly experienced physical pain in my life.",
            "Title": "American Athlete",
            "Name": "Katey Sagal"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/payal-kadakia.webp",
            "Text": "Working out is so mentally and physically important.",
            "Title": "American Businesswoman",
            "Name": "Payal Kadakia"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ziggy-marley.webp",
            "Text": "There's more to life than physical and material.",
            "Title": "Jamaican Musician",
            "Name": "Ziggy Marley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/scott-glenn.webp",
            "Text": "My life is stupidly physical.",
            "Title": "American Actor",
            "Name": "Scott Glenn"
        }
    ]
}