{
    "currentWord": {
        "wordRoot": "plan",
        "id": 20628,
        "phonemic": "plæn|plæn\r",
        "bigId": "9400d7b7-c746-474a-9b35-7ea1c6436540",
        "wordForms": [
            "plans",
            "planning",
            "planned",
            "plan"
        ]
    },
    "senses": [
        {
            "id": "9400d7b7-c746-474a-9b35-7ea1c6436540",
            "de": "A detailed proposal for doing something",
            "ty": "noun",
            "ex": "We need a good plan to succeed in our project",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "make a plan",
                " follow the plan",
                " stick to the plan"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9400d7b7-c746-474a-9b35-7ea1c6436540.webp",
            "Tips": [
                {
                    "title": "Requires Detail",
                    "description": "Plans are detailed; avoid using 'plan' for vague ideas.",
                    "example": "They outlined a plan with specific steps to improve sales.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ye4sUd6wsRCssNYofVGfsZEjkaI.webp"
                },
                {
                    "title": "Action-Oriented",
                    "description": "'Plan' is often used for actionable ideas rather than just thoughts.",
                    "example": "Their business plan included marketing and distribution strategies.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/U1r7fWK6igixI8mji1eCSxa6QR8.webp"
                },
                {
                    "title": "Implementation Focus",
                    "description": "Plans imply a roadmap to follow, not just to create.",
                    "example": "The renovation plan was ready for implementation.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/toZXMACaMW4OuHDkUP1DIcjXwQ.webp"
                }
            ]
        },
        {
            "id": "aed3af54-fdb6-4bb8-8fa4-2e84f64d92dc",
            "de": "An intention or decision about what one is going to do",
            "ty": "noun",
            "ex": "I have a plan to travel the world once I finish school",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "have a plan",
                " tell the plan",
                " revise the plan"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/aed3af54-fdb6-4bb8-8fa4-2e84f64d92dc.webp",
            "Tips": [
                {
                    "title": "Future Intentions",
                    "description": "Use 'plan' to describe future intentions with conviction.",
                    "example": "He has a plan to start his own company in five years.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Personal or Shared",
                    "description": "Plans may be personal goals or shared with others.",
                    "example": "We formulated a plan to hike together every weekend.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0d9abf8e-5148-4f70-afbd-67779eff7b78",
            "de": "To decide and arrange in detail how something is going to be done",
            "ty": "verb",
            "ex": "She plans to go to France next year",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "plan ahead",
                " plan carefully",
                " plan properly"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0d9abf8e-5148-4f70-afbd-67779eff7b78.webp",
            "Tips": [
                {
                    "title": "Preparation Involved",
                    "description": "Planning involves preparation and forethought.",
                    "example": "She plans her meals for the week to save time.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Time Frame",
                    "description": "Planning often includes setting a specific time for actions.",
                    "example": "They plan to open the new store by June.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "54bc124c-4bb5-41fe-92eb-7b194cde9e24",
            "de": "A graphic representation of a structure",
            "do": "Architecture",
            "ty": "noun",
            "ex": "The architect showed us the plan of the new building",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "draw up a plan",
                " consider the plan",
                " revise the plan"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/54bc124c-4bb5-41fe-92eb-7b194cde9e24.webp",
            "Tips": [
                {
                    "title": "Visual Representation",
                    "description": "In architecture, a plan is a detailed drawing, not just an idea.",
                    "example": "The building plan showed the location of all the exits.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Technical Context",
                    "description": "The term 'plan' can be technical, requiring specific knowledge to understand.",
                    "example": "Review the electrical plan to locate the power outlets.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "30da4c7f-a8da-4fd7-9b52-b5e1437aed17",
            "de": "To design or arrange something in your mind",
            "ty": "verb",
            "ex": "He planned the entire trip before we even left",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "plan in detail",
                " plan meticulously",
                " carefully plan"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/30da4c7f-a8da-4fd7-9b52-b5e1437aed17.webp",
            "Tips": [
                {
                    "title": "Imaginary Stages",
                    "description": "Planning in mind involves imagining and arranging the steps before acting.",
                    "example": "He had planned the garden layout long before spring.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Agenda": {
            "wordRoot": "Agenda",
            "wordDefinition": "An agenda is a list of things to be discussed or accomplished in a meeting or event. It's like a schedule, where each item has a specific time frame for when it will be addressed.\n\nYou might create an agenda for a team meeting, a conference, or a political gathering.\n\nSo, agendas are typically used for organizing meetings or events, while plans are used for organizing projects or achieving goals.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/45169f1a-fbcb-488e-b05d-04b752cf348c.webp"
        },
        "Blueprint": {
            "wordRoot": "Blueprint",
            "wordDefinition": "Blueprint refers to a technical and detailed drawing or design of a building or machine, showing its exact measurements and specifications.\n\nBlueprint is a specific and technical representation of a physical object, while plan is a general outline of tasks and activities towards achieving a goal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5c2db314-982c-4df5-80fa-b08ee51abf19.webp"
        },
        "Design": {
            "wordRoot": "Design",
            "wordDefinition": "Design refers to the process of creating something, typically for aesthetic or functional purposes. It involves coming up with a concept and then figuring out how to turn it into a finished product or solution.\n\nFor example, if you want to design a new piece of furniture, you would start by sketching out some ideas and then refining them until you have a plan that you can use to build the actual piece.\n\nDesign is more focused on creativity and innovation, while planning is more about organizing and executing a process or project.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5af82093-71d4-4dd9-88b8-a38181fc118f.webp"
        },
        "Programme": {
            "wordRoot": "Programme",
            "wordDefinition": "A programme is a more structured and formal set of actions or events that are designed to achieve a specific objective.\n\nBoth plans and programmes can be applicable in different situations. For example, a company may have a strategic plan for how to grow its business and a specific programme for launching a new product.\n\nA school may have a plan for improving student performance and a programme for implementing new teaching methods.\n\nA plan is a general strategy or outline while a programme is a more structured and detailed set of actions designed to achieve a specific objective.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/919d9ae3-dc1f-410e-bd00-e4fe082d4b0e.webp"
        },
        "Project": {
            "wordRoot": "Project",
            "wordDefinition": "A project is a temporary and unique endeavor designed to achieve a specific objective or goal. It consists of a set of activities that need to be coordinated to achieve the desired outcome.\n\nProjects come in various sizes and complexity, from creating a school project to building a large-scale infrastructure project like a bridge or a dam.\n\nProjects are often time-bound and require detailed planning and execution.\n\nIn summary, plans are general strategies or ideas, while projects are specific tasks or undertakings. Plans are applicable in situations where there is a need to set objectives or goals, while projects are applicable in situations where there is a need to carry out a specific set of tasks or activities to achieve those objectives or goals.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cd322bf1-b0e9-455c-82a7-69c901321344.webp"
        },
        "Proposal": {
            "wordRoot": "Proposal",
            "wordDefinition": "A proposal is a formal written document that outlines a plan and presents it for consideration.\n\nA proposal is usually presented to a manager, client, or investor.\n\nA plan is a general idea of how to accomplish something, while a proposal is a formal document that presents a plan and asks for approval or investment.\n\nPlans are more applicable for personal or team projects, while proposals are more applicable for business or organizational purposes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ce2cecf1-c04e-45fe-b430-b6bcddfab04e.webp"
        },
        "Schedule": {
            "wordRoot": "Schedule",
            "wordDefinition": "A schedule is a more detailed plan that includes specific dates, times, and tasks that need to be completed. It's like a timetable that outlines the steps you need to take to achieve your goal.\n\nYou can schedule your study time or schedule a meeting.\n\nA plan is the overall strategy, and a schedule is the specific timeline for executing that strategy.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d83185bc-c648-42d4-9464-9bdc1e310654.webp"
        },
        "Scheme": {
            "wordRoot": "Scheme",
            "wordDefinition": "A scheme is a plan or idea that is usually intended to deceive or trick someone. It often involves dishonest or underhanded actions, such as committing fraud or embezzlement.\n\nSo, while both words refer to a plan of action, a scheme is often associated with something deceptive or illicit, while a plan is typically genuine and honest.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9a92fdea-8c91-4a85-90f2-b61d2ba82dff.webp"
        },
        "Strategy": {
            "wordRoot": "Strategy",
            "wordDefinition": "A plan is a set of steps that you take to reach a specific goal, whereas a strategy is a broader plan that outlines a long-term approach to achieving success.\n\nA plan is typically more short-term and focused, while a strategy considers the bigger picture and incorporates multiple plans.\n\nYour strategy might involve setting a goal to maintain a certain GPA throughout high school, and following a plan that incorporates studying, attending extra help sessions, and seeking out tutoring if needed.\n\nIn general, plans are applicable for short-term goals or specific tasks, while strategies are useful for achieving long-term objectives or navigating a complex situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3d77d040-d0b5-4d95-98db-6f0658ec2c99.webp"
        }
    },
    "videos": [
        {
            "Text": " all seem to be beneficial. A good diet and exercise plan can also keep your weight in a healthy range, which will lower your heart attack risk as well. And of course, medications can also help prevent heart attacks. Doctors often prescribe low-dose aspirin, for example, particularly for patients who've already had a heart attack",
            "Title": "What happens during a...",
            "VideoId": "3_PYnWVoUzM",
            "Controls": "start=227"
        },
        {
            "Text": " and when we implement it, it has some surreptitious side effect that the A.I. had planned. The point here is that we should not be confident in our ability to keep a superintelligent genie locked up in its bottle forever. Sooner or later, it will out. I believe that the answer here is to figure out",
            "Title": "What happens when our...",
            "VideoId": "MnT1xgZgkpk",
            "Controls": "start=788"
        },
        {
            "Text": " was a mistake. The middle way between luxury and poverty seemed wisest. And while meditating under a bodhi tree, the rest of the answer came to him. All of life abounds with suffering. It's caused by selfish craving for one's own fulfillment at the expense of others. Following an eight-step plan",
            "Title": "The five major world...",
            "VideoId": "m6dCxo7t_aE",
            "Controls": "start=314"
        },
        {
            "Text": " Is there really a plan for my life? Is the future yet to be written, or is it already written and we just can't see it? But then, do I have free will? I mean, who am I anyway? Am I just a biological machine? But then, why am I conscious? What is consciousness?",
            "Title": "Questions No One Knows...",
            "VideoId": "7SWvDHvWXok",
            "Controls": "start=55"
        },
        {
            "Text": " to increase the chances of his plan being accepted. But it turns out he can do much better than that. Why? Like we said, the pirates all know each other to be top-notch logicians. So when each votes, they won't just be thinking about the current proposal,",
            "Title": "Can you solve the pirate...",
            "VideoId": "Mc6VA7Q1vXQ",
            "Controls": "start=120"
        },
        {
            "Text": " hey i thought i tried to catch you before you got on the plane but i guess it's too late i know i've said it before but i am really sorry that i couldn't come with i was really excited and i know that we spent a lot of time planning it but",
            "Title": "The Unexpected Beauty of...",
            "VideoId": "fDMu9BXMR-U",
            "Controls": "start=12"
        },
        {
            "Text": " they're cautious they're calm is why you take something like prozac or paxil to drive up the serotonin system to make you calm er they follow the rules they respect authority they like plans and rules and schedules they like to be",
            "Title": "Love and hormones PIPE...",
            "VideoId": "PgoN0k0_0bg",
            "Controls": "start=195"
        },
        {
            "Text": " Research has implicated three regions of the brain variously involved in social behavior and complex cognitive planning, voluntary movement, and emotional and motivational responses. The other piece of the puzzle",
            "Title": "Debunking the myths of...",
            "VideoId": "DhlRgwdDc-E",
            "Controls": "start=188"
        },
        {
            "Text": " She can map her world in three dimensions and formulate a plan of attack. She can have an idea.",
            "Title": "Spider With Three Super...",
            "VideoId": "UDtlvZGmHYk",
            "Controls": "start=94"
        },
        {
            "Text": " she can map her world in three dimensions and formulate a plan of attack she can have an idea",
            "Title": "Best Spider Moments PIPE...",
            "VideoId": "uHyYtcMZYGs",
            "Controls": "start=99"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/billie-eilish.webp",
            "Text": "I had a period in my life where I decided that I would never be bored again and that, if I had any free time at all, I would make plans, and I would always be doing things. It actually was great for a year or so, but then I lost all of my friends.",
            "Title": "American Singer",
            "Name": "Billie Eilish"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-rohn.webp",
            "Text": "If you don't design your own life plan, chances are you'll fall into someone else's plan. And guess what they have planned for you? Not much.",
            "Title": "American Businessman",
            "Name": "Jim Rohn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jennifer-lopez.webp",
            "Text": "When you have children, you realise you can't plan anything. There's no Plan A, no Plan B. Life will happen and you will go with it.",
            "Title": "American Musician",
            "Name": "Jennifer Lopez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joseph-campbell.webp",
            "Text": "We must let go of the life we have planned, so as to accept the one that is waiting for us.",
            "Title": "American Author",
            "Name": "Joseph Campbell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-lennon.webp",
            "Text": "Life is what happens while you are busy making other plans.",
            "Title": "English Musician",
            "Name": "John Lennon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/judith-viorst.webp",
            "Text": "You could never plan your life in a million years.",
            "Title": "American Author",
            "Name": "Judith Viorst"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gerard-pique.webp",
            "Text": "Barcelona is my life, and I do not plan to leave.",
            "Title": "Spanish Athlete",
            "Name": "Gerard Pique"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yasmine-al-masri.webp",
            "Text": "I never had planned for my life and my career.",
            "Title": "Palestinian Actress",
            "Name": "Yasmine Al Masri"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/pranitha-subhash.webp",
            "Text": "I never planned anything in my life.",
            "Title": "Indian Actress",
            "Name": "Pranitha Subhash"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/namrata-shirodkar.webp",
            "Text": "I don't plan my life.",
            "Title": "Indian Actress",
            "Name": "Namrata Shirodkar"
        }
    ]
}