{
    "currentWord": {
        "wordRoot": "portfolio",
        "id": 18765,
        "phonemic": "pɔːtˈfəʊliəʊ|pɔːrtˈfəʊliəʊ\r",
        "bigId": "2025dcf7-2ebd-4dc2-b8a8-ab2436dec2a3",
        "wordForms": [
            "portfolios",
            "portfolio"
        ]
    },
    "senses": [
        {
            "id": "2025dcf7-2ebd-4dc2-b8a8-ab2436dec2a3",
            "de": "A set of pieces of creative work collected to be shown to potential employers or clients.",
            "ty": "noun",
            "ex": "He presented a portfolio of his artwork to the gallery.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "professional portfolio",
                " investment portfolio",
                " project portfolio"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/2025dcf7-2ebd-4dc2-b8a8-ab2436dec2a3.webp",
            "Tips": [
                {
                    "title": "Showcase Abilities",
                    "description": "Use 'portfolio' to present your skills and accomplishments in arts, design, or other creative fields.",
                    "example": "I update my portfolio regularly with my latest graphic designs.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/VlRq6xIf0HIONLWC3XrYsnVSuU.webp"
                },
                {
                    "title": "Not Always Physical",
                    "description": "A portfolio can be digital, like a website, not just a physical binder or folder of work.",
                    "example": "Check out my online portfolio to see all my photography work.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3U9u1UJrcVdqZpRFhTc0t3UnNw.webp"
                },
                {
                    "title": "Beyond Art",
                    "description": "Although common in creative fields, 'portfolio' can refer to any collection of work samples.",
                    "example": "My coding portfolio includes samples of apps I've developed.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/pyd6UAYkdrfQ1LtHle7T287sAV8.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "c2d9fb0c-99f8-4969-8c60-24b5c695a537",
            "de": "The total amount of investments held by an individual or institution.",
            "do": "Finance",
            "ty": "noun",
            "ex": "She manages an investment portfolio of around $1 million.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "investment portfolio",
                " diversified portfolio",
                " financial portfolio"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c2d9fb0c-99f8-4969-8c60-24b5c695a537.webp",
            "Tips": [
                {
                    "title": "Investment Variety",
                    "description": "In finance, a 'portfolio' usually includes a mix of stocks, bonds, and other assets to spread risk.",
                    "example": "Her portfolio has a good balance of tech and healthcare stocks.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Just Stocks",
                    "description": "'Portfolio' can include non-traditional investments like real estate or art, not only financial securities.",
                    "example": "He added several rare coins to his investment portfolio.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Risk Perspective",
                    "description": "Investors often talk about 'portfolio' when discussing risk management and investment strategies.",
                    "example": "We need to diversify the portfolio to reduce our exposure to market volatility.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "0c925e1f-7013-4c73-9af5-1d7a674d3406",
            "de": "The role or duty of a Cabinet Minister or Secretary of State.",
            "do": "Politics",
            "ty": "noun",
            "ex": "He was given the portfolio of Minister of Environment.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "ministerial portfolio",
                " government portfolio",
                " public portfolio"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0c925e1f-7013-4c73-9af5-1d7a674d3406.webp",
            "Tips": [
                {
                    "title": "Government Roles",
                    "description": "Use 'portfolio' to refer to the specific responsibilities or areas a government official manages.",
                    "example": "She held the portfolio for foreign affairs.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not a Document",
                    "description": "In politics, 'portfolio' doesn't mean a physical folder but a range of duties or responsibilities.",
                    "example": "After the election, he was assigned a new portfolio in the cabinet.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Anthology": {
            "wordRoot": "Anthology",
            "wordDefinition": "An anthology is a collection of literary works, such as poems or short stories, by different authors.\n\nIt is usually compiled by an editor and published in a book form. An anthology can be used to showcase the works of several writers on a particular theme or genre.\n\nAn anthology is a collection of works by different authors, while a portfolio is a collection of an individual's best work.\n\nAnthologies are commonly used in literature, while portfolios are commonly used in visual arts and design.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0349c8ce-36b7-4cca-baef-7f6fb00ab843.webp"
        },
        "Catalogue": {
            "wordRoot": "Catalogue",
            "wordDefinition": "A catalogue is a list or collection of items, goods or products usually presented in a systematic order.\n\nA catalogue is used by businesses to showcase their products while a portfolio is used by individuals to showcase their work or accomplishments.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/941a39ec-5b31-4254-987a-eb9b3c6a2311.webp"
        },
        "Collection": {
            "wordRoot": "Collection",
            "wordDefinition": "A collection refers to a group of items that are gathered together based on some criteria, such as items of the same type or objects with a similar theme.\n\nThis could refer to anything from a collection of stamps to a collection of vintage cars.\n\nA portfolio typically refers to a collection of work samples or projects that showcase a person's skills or accomplishments.\n\nA collection is a group of objects, while a portfolio is a collection of work samples. Each term is applicable in different contexts, such as collecting items as a hobby or putting together a portfolio for a job or school application.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b7dffe9b-3c07-4208-897e-6b759ff39c4b.webp"
        },
        "Compilation": {
            "wordRoot": "Compilation",
            "wordDefinition": "A compilation is a collection of things, like songs or videos, that have been gathered together in one place.\n\nA compilation is a collection of various works that is put together by someone else, while a portfolio is a selection of an individual's best work that they created themselves.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/04fb02a4-cb4c-4f9d-8efe-749b81ed6ad6.webp"
        },
        "File": {
            "wordRoot": "File",
            "wordDefinition": "A file is a collection of documents or data that are related to each other and stored together. For example, a file can contain a series of documents related to a single project or a single topic.\n\nFiles are applicable in situations where a collection of related documents or data need to be organized and stored together.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4b333a4e-d8ec-4bda-8ac6-3cbd6d6b19d4.webp"
        },
        "Folio": {
            "wordRoot": "Folio",
            "wordDefinition": "A folio is typically a collection of papers or documents.\n\nA portfolio usually refers to a collection of works or projects that showcase a person’s skills or talents.\n\nFor example, an artist may have a portfolio of their best paintings, drawings, and sculptures to show a potential employer.\n\nA writer may have a folio of their research and notes for a book they are working on.\n\nA folio is more general and can refer to any type of collection of papers or documents, while a portfolio is specifically a collection of works or projects to showcase one’s abilities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6d6cd65c-d8c2-4343-a959-2c6905b233d8.webp"
        },
        "Inventory": {
            "wordRoot": "Inventory",
            "wordDefinition": "Inventory refers to a list of goods or items that a company has in stock or is available for sale. It is commonly used in the context of retail or manufacturing businesses.\n\nIn simpler terms, inventory relates to physical goods, while portfolio relates to financial assets. Inventory is applicable to businesses that sell tangible products, while portfolio is applicable to individuals or investors who manage their finances.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e6f7da11-a586-4fb8-9c5e-5f9eeac60dd1.webp"
        },
        "Register": {
            "wordRoot": "Register",
            "wordDefinition": "A register is a list or record of items or events.\n\nIt may be used to keep track of inventory, attendance, or financial transactions. For example, a teacher may keep a register of student attendance or a business may keep a register of sales.\n\nA portfolio is used to showcase one's skills and achievements, while a register is used to keep track of items or events.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c3d315ee-352d-4337-a592-7a5c9a8f9a0f.webp"
        }
    },
    "videos": [
        {
            "Text": " and you end up being nothing for nobody. Then, use the kind of language that appeals to your target customer. Create the kind of marketing materials or the kind of portfolio that attracts them. Then be in the real-life and virtual places they are. For example, if you're a videographer and you want to work with mission-driven companies that bring clean water to places where it's scarce,",
            "Title": "The secret to being a...",
            "VideoId": "-UV3xm9pZ0g",
            "Controls": "start=115"
        },
        {
            "Text": " in the real estate sector, the energy sector, is much more important for the total capital stock and capital share. The other important issue is that there are scale effects in portfolio management, together with financial complexity, financial deregulation, that make it easier to get higher rates of return for a large portfolio,",
            "Title": "Thomas Piketty: New...",
            "VideoId": "JKsHhXwqDqM",
            "Controls": "start=818"
        },
        {
            "Text": " skills but then building portfolios things like our computer science platform writing so that your transcript isn't just your scores but it's also what you've made well you're doing as much as anyone in the world to realize that future all power to you my friend I can't kid",
            "Title": "The Khan Academy PIPE...",
            "VideoId": "rDF84DMMx7w",
            "Controls": "start=543"
        },
        {
            "Text": " survey takers so so imagine that you're a retired household in Belgium someone comes to your front door excuse me would you mind if I peruse your stock portfolio do you happen to know how much your house is worth you mind telling me would you happen to have a hallway",
            "Title": "Could your language...",
            "VideoId": "iUJuYDPXjus",
            "Controls": "start=456"
        },
        {
            "Text": " and protecting the ecosystems that we currently have. Restoration is not a silver bullet. There is no silver bullet. It is just one of a huge portfolio of solutions that we so desperately need. And this view of trees as an easy way out is such a tempting perspective,",
            "Title": "The global movement to...",
            "VideoId": "yJX1Te0jey0",
            "Controls": "start=293"
        },
        {
            "Text": " is something that the entire world wants and needs, and humility to understand that as a designer, it's not about you or your portfolio, it's about the people that you're designing for, and how your work just might help them live better lives.",
            "Title": "Margaret Gould Stewart:...",
            "VideoId": "quJdL9ggETI",
            "Controls": "start=107"
        },
        {
            "Text": " forever New York combined show me your portfolio so I bought a plane ticket I went out to New York the very next week I showed him what I was working on in shooting and he said this is this is great do you want to go shoot an",
            "Title": "Alison Wright: Portraits...",
            "VideoId": "XAzhV6tvA3c",
            "Controls": "start=226"
        },
        {
            "Text": " Our portfolio is not only sizable but also one of the most globally diversified portfolios. So that means, the world is on that path. I'm tired of hearing the same comment repeatedly",
            "Title": "How we can turn the tide...",
            "VideoId": "NUFEBioLPf8",
            "Controls": "start=979"
        },
        {
            "Text": " And the top investment banks in the world now use resell data to analyze the retail footwear industry. And here's the best sneakerheads have sneaker portfolios.",
            "Title": "The secret sneaker...",
            "VideoId": "q49LtMyXK7Q",
            "Controls": "start=244"
        },
        {
            "Text": " all right fellas they spoil you yeah i'll leave us be wee man we're just having a quiet chat cause i've been waiting to expand my property portfolio",
            "Title": "A Scottish Fly Moves In...",
            "VideoId": "-F-94UODk_0",
            "Controls": "start=0"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/neil-degrasse-tyson.webp",
            "Text": "I have a personal philosophy in life: If somebody else can do something that I'm doing, they should do it. And what I want to do is find things that would represent a unique contribution to the world - the contribution that only I, and my portfolio of talents, can make happen. Those are my priorities in life.",
            "Title": "American Scientist",
            "Name": "Neil deGrasse Tyson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ray-dalio.webp",
            "Text": "What I'm trying to say is that for the average investor, what I would encourage them to do is to understand that there's inflation and growth. It can go higher and lower and to have four different portfolios essentially that make up your entire portfolio that gets you balanced.",
            "Title": "American Businessman",
            "Name": "Ray Dalio"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-de-leon.webp",
            "Text": "Cap and trade is an important tool in California's climate policy portfolio. It sends a price signal to industries to reduce their carbon pollution while generating billions of dollars in revenue for investments in clean transportation and direct pollution reduction.",
            "Title": "American Politician",
            "Name": "Kevin de Leon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-chatzky.webp",
            "Text": "It doesn't help to follow every rise and fall of your portfolio. It's better to tune out the day-to-day shifts, in fact. But getting a handle on the larger picture will make you feel more secure, and that goes a long way in calming your fear.",
            "Title": "American Journalist",
            "Name": "Jean Chatzky"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-loehr.webp",
            "Text": "The most important asset you need to protect in order to manage the demands of a job or an investment portfolio is your production of energy. And, just like with money, if you do a great job managing your energy, you'll get a great return.",
            "Title": "American Psychologist",
            "Name": "Jim Loehr"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/george-lois.webp",
            "Text": "I had a fistfight with every kid on my block. I got about fifteen broken noses to prove it. Part of it was also because I was always drawing, and I always had an artist portfolio with me. But I was a tough kid. I won their respect.",
            "Title": "American Artist",
            "Name": "George Lois"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robin-marantz-henig.webp",
            "Text": "Some people, no matter how robust their stock portfolios or how healthy their children, are always mentally preparing for doom. They are just born worriers, their brains forever anticipating the dropping of some dreaded other shoe.",
            "Title": "Writer",
            "Name": "Robin Marantz Henig"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-j-shiller.webp",
            "Text": "One should have a wide variety of assets in one's portfolio. And oil, by the way, is a particularly important asset to have in one's portfolio because we need it, and the economy thrives on it.",
            "Title": "American Economist",
            "Name": "Robert J. Shiller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joe-lonsdale.webp",
            "Text": "In an increasingly competitive technology world, VCs must work more and more closely with portfolio companies to develop superior technology, talent, and operations.",
            "Title": "American Businessman",
            "Name": "Joe Lonsdale"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kayleigh-mcenany.webp",
            "Text": "Prison reform, peace, and a presidential pardon - just a portion of Kushner's portfolio.",
            "Title": "American Public Servant",
            "Name": "Kayleigh McEnany"
        }
    ]
}