{
    "currentWord": {
        "wordRoot": "prerequisite",
        "id": 11879,
        "phonemic": "ˌpriːˈrekwəzɪt|ˌpriːˈrekwəzɪt\r",
        "bigId": "1cf70f11-8c5b-43e2-840e-e8596e0177ff",
        "wordForms": [
            "prerequisites",
            "prerequisite"
        ]
    },
    "senses": [
        {
            "id": "1cf70f11-8c5b-43e2-840e-e8596e0177ff",
            "de": "something that is needed or required before you can do or achieve something else",
            "ty": "noun",
            "ex": "Having a degree is a prerequisite for many jobs.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "necessary prerequisite",
                " important prerequisite",
                " basic prerequisite"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1cf70f11-8c5b-43e2-840e-e8596e0177ff.webp",
            "Tips": [
                {
                    "title": "Entry Requirement",
                    "description": "Prerequisite often refers to a must-have qualification or skill to start something.",
                    "example": "Passing an English test is a prerequisite for this university program.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sWlUIjYDPsOmXRIWAwA3dtG3SBo.webp"
                },
                {
                    "title": "Beyond Basic Needs",
                    "description": "It's not just about basic needs; it's often about specific conditions or standards that must be met.",
                    "example": "A specific GPA may be a prerequisite for scholarship eligibility.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/1YbADLGlPVDlqm2CWQzYhXAjys.webp"
                },
                {
                    "title": "Figurative Use",
                    "description": "Sometimes used metaphorically to express something very important, not only mandatory.",
                    "example": "Patience is a prerequisite for mastering a new language.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sPLGCAM69zueXVRuCqGNuS64yfU.webp"
                }
            ]
        },
        {
            "id": "4bbae49f-14e5-4455-a5a5-f577390d4ce0",
            "de": "required before something else can happen or exist",
            "ty": "adjective",
            "ex": "The course had several prerequisite assignments before the final research paper.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "prerequisite skills",
                " prerequisite knowledge",
                " prerequisite courses"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4bbae49f-14e5-4455-a5a5-f577390d4ce0.webp",
            "Tips": [
                {
                    "title": "Mandatory Preparation",
                    "description": "As an adjective, it describes tasks or steps that are compulsory before progressing.",
                    "example": "Prerequisite reading must be done before the seminar.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Underlying Assumption",
                    "description": "Implies an assumption that the learner has certain knowledge or skills already.",
                    "example": "Programming experience is a prerequisite for this software development course.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Initial Barrier",
                    "description": "It can act as an initial barrier to entry, screening out those who are unqualified.",
                    "example": "A portfolio is a prerequisite for admission to the art school.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Condition": {
            "wordRoot": "Condition",
            "wordDefinition": "A condition is something that must be present or fulfilled in order for a certain outcome to happen. For example, the condition for playing soccer is having a soccer ball and enough players to form two teams.\n\nIn summary, conditions are necessary for an event or situation to happen, while prerequisites are necessary for an individual to embark on or qualify for a task or opportunity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/394e1d28-972a-4291-a254-307cdb54d02f.webp"
        },
        "Criterion": {
            "wordRoot": "Criterion",
            "wordDefinition": "Criterion means a standard or rule by which something is judged or measured.\n\nIt is used to determine whether something meets a certain level of quality or performance. For example, the criterion for admission to a prestigious university might be a high GPA and impressive extracurricular activities.\n\nCriterion is used to judge something, while prerequisite is something that must be done or achieved before progressing further.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/764a0b20-1faf-4f08-8fb5-ac53908a824b.webp"
        },
        "Essential": {
            "wordRoot": "Essential",
            "wordDefinition": "Essential means something that is absolutely necessary and cannot be ignored or avoided. For example, water is essential for human survival.\n\nIn simpler terms, essential means something that is crucial and cannot be done without, while prerequisite means something that is required as a necessary step to achieve a particular goal.\n\nEssential describes things that are absolutely necessary, while prerequisite describes things that are conditional or necessary for something else to happen.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8cc1da05-187c-4a8f-b15c-589129dd2b91.webp"
        },
        "Necessity": {
            "wordRoot": "Necessity",
            "wordDefinition": "Necessity means something that is absolutely needed or required, without which something cannot happen or be done. For example, water is a necessity for human survival, without it, a person cannot live.\n\nIn simpler terms, necessity refers to something that is a must-have or essential, while prerequisite refers to something that is a requirement or condition for something else to occur.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ac9915bb-0323-478d-a151-ec67c3b292b5.webp"
        },
        "Need": {
            "wordRoot": "Need",
            "wordDefinition": "Need refers to something that is required or essential for a person or thing to function properly. For example, you need food, water, and shelter to live.\n\nPrerequisite refers to something that is required before something else can happen. For example, before you can take an advanced math course, you may need to complete a prerequisite course in algebra.\n\nNeed refers to something that is necessary for survival or function, while prerequisite refers to something that is necessary for achieving a goal or completing a task.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/718e1e33-2799-4f30-ab5f-cc99be670b87.webp"
        },
        "Qualification": {
            "wordRoot": "Qualification",
            "wordDefinition": "A qualification is a specific skill or attribute that makes someone suitable for a particular job or position. For example, having a certain level of education or experience might be a qualification for a job.\n\nIn general, prerequisites are more about meeting basic requirements, while qualifications are about having specific skills or qualities that make you a good fit for something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aa4d8a27-d82d-4b15-8779-cfcc1553ace4.webp"
        },
        "Requirement": {
            "wordRoot": "Requirement",
            "wordDefinition": "A requirement is something that must be met in order to comply with rules or expectations. For example, if you want to graduate high school, you might have a requirement to complete a certain number of community service hours.\n\nSo in short, a prerequisite is a specific action or accomplishment that's necessary to move forward with something, whereas a requirement is a general expectation or rule that must be met in order to fulfill a larger goal or purpose.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/28a1d45d-53f4-428a-9091-9ab26d010255.webp"
        },
        "Requisite": {
            "wordRoot": "Requisite",
            "wordDefinition": "However, prerequisite usually refers to something that is required before you can start or do something, while requisite generally refers to something that is required for the completion or achievement of something.\n\nFor example, if you want to take a calculus course, you might need to have completed a prerequisite course in algebra first.\n\nA driver's license is a requisite for driving a car legally.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/81592294-1113-45fa-b6a6-0c6855821aac.webp"
        }
    },
    "videos": [
        {
            "Text": " you like the lamp first or the candle first of the fireplace first and they were given some arbitrary answer like how about the fireplace or how about the candle like they would have just like said whatever they think should be lit first without realizing that the match is kind of a prerequisite to lighting anything so the match is obviously",
            "Title": "Mind Blown - Hangout to...",
            "VideoId": "xjVKJgDwhrY",
            "Controls": "start=1917"
        },
        {
            "Text": " display area that we call a court so in a patch of forest they find the right spot they remove all the leaf litter they may move away all the small growth and there's something important that all of them have is this horizontal perch that spans the cleared area there that's the prerequisite for making a",
            "Title": "Tim Laman & Ed Scholes:...",
            "VideoId": "OcCP4_R8QBw",
            "Controls": "start=870"
        },
        {
            "Text": " predictable this is the very precondition for a system like this to operate this is in fact that the Holocene is the prerequisite for our world economy to operate the scientific message today is as dramatic as it's simple the Holocene is the only stability state of the planet we know",
            "Title": "Resilient people,...",
            "VideoId": "ByP7p_cmOaA",
            "Controls": "start=142"
        },
        {
            "Text": " from hearing some great ideas. And I think that’s a prerequisite when it comes to listening to people, too. You have to go into it open-minded and curious and ready to learn something new. Also, the instinct to multitask is so hard to turn off, but it's so important that you do it.",
            "Title": "Hrishikesh Hirway: What...",
            "VideoId": "PlPena9gobI",
            "Controls": "start=285"
        },
        {
            "Text": " so that by the time we're three, four years old, most children, not all, have acquired the ability to understand the intentions of others, another prerequisite for empathy. The fact that this developmental progression is universal, irrespective of where you live in the world",
            "Title": "The neuroscience of...",
            "VideoId": "tzJYY2p0QIc",
            "Controls": "start=339"
        },
        {
            "Text": " really taking seriously the social and economic aspirational goals within the life-support systems on earth? Now, citizens across the world have started to recognize that we're facing global rising environmental risks; in fact, that a stable planet is a prerequisite",
            "Title": "5 transformational...",
            "VideoId": "Rv-tDrv__mc",
            "Controls": "start=119"
        },
        {
            "Text": " Our location is saturated with evidence and also with matter and energy. Out in intergalactic space, those three prerequisites for the open-ended creation of knowledge are at their lowest possible supply -- as I said, it's empty, it's cold and it's dark out there.",
            "Title": "David Deutsch: Chemical...",
            "VideoId": "gQliI_WGaGk",
            "Controls": "start=647"
        },
        {
            "Text": " of management of the commons on a local scale, is that there are certain prerequisites that you can put into place that enable you to manage and access open space for the good of one and all. And these include a sense of shared responsibility,",
            "Title": "Kristina Gjerde: Making...",
            "VideoId": "EhM56Fk2aFk",
            "Controls": "start=194"
        },
        {
            "Text": " We didn't wait any prerequisite amount of time for our courtship; we told each other the vulnerable truths up I am a transgender man, which means the F on my birth certificate should have stood for \"False,\" instead of \"Female.\"",
            "Title": "A queer vision of love...",
            "VideoId": "lwcvhh4pLjE",
            "Controls": "start=24"
        },
        {
            "Text": " in the democratic stance. In particular, there is growing doubt among people in the emerging markets, when people now believe that democracy is no longer to be viewed as a prerequisite for economic growth.",
            "Title": "Dambisa Moyo: Is China...",
            "VideoId": "4Q2aznfmcYU",
            "Controls": "start=507"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shilpa-shetty.webp",
            "Text": "I want a happy marriage and whatever it takes to achieve that. But I think the main prerequisite would have to be respect. He would have to respect me and vice-versa. And, that would be more important than being in love. I think respect really goes a long way. And he would have to keep me happy. And he'd have to be very, very, secure.",
            "Title": "Indian Actress",
            "Name": "Shilpa Shetty"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sza.webp",
            "Text": "I don't think I'm inherently feminist. I think the universe wants me to be feminist, and I think I resonate with that. I think it just chose me to be this female energy... thing. And I'm very drawn to female energy, but I don't really have any prerequisites in feminism. I just roll with it.",
            "Title": "American Musician",
            "Name": "SZA"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-polkinghorne.webp",
            "Text": "After all, the universe required ten billion years of evolution before life was even possible; the evolution of the stars and the evolving of new chemical elements in the nuclear furnaces of the stars were indispensable prerequisites for the generation of life.",
            "Title": "British Physicist",
            "Name": "John Polkinghorne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lou-brock.webp",
            "Text": "Stealing bases was put to me almost as a prerequisite for staying in the game. They didn't give me a handbook on how to do it; they said do it. Under those conditions you go out and develop your own handbook.",
            "Title": "American Athlete",
            "Name": "Lou Brock"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zephyr-teachout.webp",
            "Text": "The core of my platform is to change the role of money in politics, support public education and break up monopoly power. All of these are fundamental prerequisites to a responsive democracy.",
            "Title": "American Lawyer",
            "Name": "Zephyr Teachout"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/olympia-dukakis.webp",
            "Text": "I think we have to be careful about what we label as a prerequisite for spirituality. I don't think you have to know a lot to have a spiritual life, but knowing gives life richness.",
            "Title": "American Actress",
            "Name": "Olympia Dukakis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stephen-curry.webp",
            "Text": "Sometimes people make it seem like you have to have certain prerequisites or a crazy life story in order to be successful in this world. But the truth is you really don't.",
            "Title": "American Athlete",
            "Name": "Stephen Curry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-klee.webp",
            "Text": "The art of mastering life is the prerequisite for all further forms of expression, whether they are paintings, sculptures, tragedies, or musical compositions.",
            "Title": "Swiss Artist",
            "Name": "Paul Klee"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-cailliau.webp",
            "Text": "When we have all data online it will be great for humanity. It is a prerequisite to solving many problems that humankind faces.",
            "Title": "Belgian Scientist",
            "Name": "Robert Cailliau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-ortberg.webp",
            "Text": "Death is the prerequisite to resurrection, the new life God intends.",
            "Title": "American Clergyman",
            "Name": "John Ortberg"
        }
    ]
}