{
    "currentWord": {
        "wordRoot": "prospective",
        "id": 22221,
        "phonemic": "prəˈspektɪv|prəˈspektɪv\r",
        "bigId": "e365fd39-72b2-4582-9dbe-dc85609944f8",
        "wordForms": [
            "prospective"
        ]
    },
    "senses": [
        {
            "id": "e365fd39-72b2-4582-9dbe-dc85609944f8",
            "de": "Expected to do something in the future",
            "ty": "adjective",
            "ex": "She's a prospective student trying to get into the best university.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "prospective student",
                " prospective buyer",
                " prospective employer"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e365fd39-72b2-4582-9dbe-dc85609944f8.webp",
            "Tips": [
                {
                    "title": "Future Intentions",
                    "description": "Use 'prospective' to talk about someone's plans or intentions for the coming time.",
                    "example": "She visited the campus as a prospective student, hoping to enroll next term.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/S7Vqx2ewsC53oXtJCLfAEEZddA.webp"
                },
                {
                    "title": "Engagement Stage",
                    "description": "Indicates someone's position when considering or negotiating an action but hasn't committed yet.",
                    "example": "The prospective employer had a long interview with him.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/77JnfjtPPN7QfKUXJhaBmvGM6I.webp"
                },
                {
                    "title": "Anticipating Participation",
                    "description": "'Prospective' often implies someone is taking steps to achieve a future goal.",
                    "example": "She already attended the pre-orientation meetup for prospective members.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sPzuYsEVH6FlhduR7KmAXFauIDk.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "2dcd41a4-dfa6-432b-aa46-a76d0c5f8f95",
            "de": "Likely to happen soon",
            "ty": "adjective",
            "ex": "These new technologies show prospective benefits for all of us.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "prospective benefits",
                " prospective improvements",
                " prospective changes"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/2dcd41a4-dfa6-432b-aa46-a76d0c5f8f95.webp",
            "Tips": [
                {
                    "title": "Near-term Likelihood",
                    "description": "Employ 'prospective' for events that are likely to occur soon.",
                    "example": "The prospective law changes could affect many businesses.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Expecting Outcomes",
                    "description": "Describes outcomes that are looked forward to or expected in the near future.",
                    "example": "We discussed the prospective advantages of the new system.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Upcoming Possibilities",
                    "description": "Refers to future scenarios that are possible and often being prepared for.",
                    "example": "They invested in new equipment for the prospective increase in demand.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "8b15f2e9-f5bb-48c1-8e99-dbd307546f7b",
            "de": "Relating to or effective in the future",
            "ty": "adjective",
            "ex": "The pros and cons of the prospective situation must be analyzed.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "prospective situation",
                " prospective adjustment",
                " prospective development"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8b15f2e9-f5bb-48c1-8e99-dbd307546f7b.webp",
            "Tips": [
                {
                    "title": "Future Impact",
                    "description": "Refers to how something will affect matters in the future, not immediately.",
                    "example": "The CEO spoke about the prospective impact of the merger.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Vision of the Future",
                    "description": "Used when describing a vision or a plan that someone has mind for the future.",
                    "example": "The architect shared his prospective design for the new park.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Forward Thinking",
                    "description": "Shows an orientation towards the future, especially in planning and decision-making.",
                    "example": "Our team's prospective strategy aims to reduce expenses over the next five years.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Anticipate": {
            "wordRoot": "Anticipate",
            "wordDefinition": "Anticipate means to be prepared for something or to expect it to happen in the future, based on knowledge or experience.\n\nIt is applicable when you have a good idea of what might happen and you are getting ready for it. For example, you might anticipate that it will rain tomorrow and bring an umbrella.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/87dd4e90-d368-4d69-878d-45bb40f2d405.webp"
        },
        "Future": {
            "wordRoot": "Future",
            "wordDefinition": "Future refers to the time that is yet to come. It is a general term used when we are talking about what will happen next in the course of events.\n\nFor example, \"In the future, we will have flying cars\".\n\nFuture refers to the time ahead while prospective refers to the potential outcome of a situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5c29b53e-8a24-48a1-9a5b-9137ab9bb137.webp"
        },
        "Imminent": {
            "wordRoot": "Imminent",
            "wordDefinition": "Imminent refers to something that is about to happen or occur very soon, often with a sense of urgency or impending danger.\n\nFor example, a storm that is approaching can be described as imminent.\n\nProspective refers to something that is likely or expected to happen in the future. It does not necessarily have the same urgency or immediacy as something imminent.\n\nImminent describes something that is about to happen soon, while prospective describes something that is likely or expected to happen in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ce85000f-c33b-4dbf-9d21-0388b7726de7.webp"
        },
        "Impending": {
            "wordRoot": "Impending",
            "wordDefinition": "Impending means that something is about to happen very soon. For example, an impending storm means that a storm is very likely to arrive in the near future.\n\nImpending refers to something that is almost certain to happen very soon while prospective refers to something that is possible or likely to happen in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/08316d8f-692b-413d-9fd2-96c57c65d595.webp"
        },
        "Likely": {
            "wordRoot": "Likely",
            "wordDefinition": "Likely means that something is probable or expected to happen.\n\nFor example: It is likely to rain tomorrow.\n\nProspective means something is possible or likely to happen in the future. It refers to a situation that one is considering as a potential course of action.\n\nLikely refers to something that is probable or expected to happen, while prospective refers to something that has the potential to happen in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ccfff788-c70a-4874-a6d9-839ab182f7d6.webp"
        },
        "Possible": {
            "wordRoot": "Possible",
            "wordDefinition": "Possible means that something could happen, but it is not certain. It describes something that could be done or achieved if the right conditions are met, but it may not necessarily happen.\n\nFor example, it is possible for someone to win the lottery, but it is not guaranteed or prospective. Winning the lottery would only become prospective if that person had a winning ticket or if they had a very high chance of winning based on some statistical analysis.\n\nPossible describes something that could happen, while prospective describes something that is expected or likely to happen in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/735bfe82-90d4-43f3-af07-961cb543b989.webp"
        },
        "Potential": {
            "wordRoot": "Potential",
            "wordDefinition": "Potential means the possibility of something happening or becoming actual in the future. For example, a student has the potential to become a successful doctor.\n\nPotential refers to the possibility of something happening, while prospective refers to something that is likely to happen or become a specific thing in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f8b3cef8-79a6-4643-954f-8a38a8e5ef42.webp"
        },
        "Probably": {
            "wordRoot": "Probably",
            "wordDefinition": "Probably means that something is likely or expected to happen, but it is not certain. For example, if you say \"It will probably rain tomorrow,\" you mean it is likely to rain, but you are not completely sure.\n\nProbably is used to express a likely but uncertain outcome, while prospective describes something that is being considered as a possibility in the future.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5c13ea5f-6e2f-4330-9d99-36483e2b6a3c.webp"
        }
    },
    "videos": [
        {
            "Text": " you just mix up some pollen sugar and water and whatever active ingredient you want to put in and you just give it right to the bees no chemicals involved just immune boosters humans think about our own health in a prospective way we exercise we eat healthy we take vitamins why don't we think about honeybees in that same type of way bring them to",
            "Title": "Every city needs healthy...",
            "VideoId": "DwGoZA8ZpHo",
            "Controls": "start=517"
        },
        {
            "Text": " You just mix up some pollen, sugar and water, and whatever active ingredient you want to put in, and you just give it right to the bees. No chemicals involved, just immune boosters. Humans think about our own health in a prospective way. We exercise, we eat healthy, we take vitamins. Why don't we think about honeybees in that same type of way?",
            "Title": "Noah Wilson-Rich: Every...",
            "VideoId": "R2kOgSVF2Uk",
            "Controls": "start=514"
        },
        {
            "Text": " Buying stocks makes those investors partial owners in the business. Their investment helps the company to grow, and as it becomes more successful, more buyers may see potential and start buying stocks. As demand for those stocks increases, so does their price, increasing the cost for prospective buyers,",
            "Title": "How does the stock...",
            "VideoId": "p7HKvqRI_Bo",
            "Controls": "start=97"
        },
        {
            "Text": " an automatic three month's paternity leave, but they lose it if they decide not to take it, a high government official told me that companies are starting to look at prospective male employees and raise an eyebrow if they didn't in fact",
            "Title": "Anne-Marie Slaughter:...",
            "VideoId": "tH5iEf9oxaI",
            "Controls": "start=864"
        },
        {
            "Text": " dozens of job applications in response to ads by prospective employers all of the applications had fictitious names of women and all the applications were identical except that half of the applications said that the woman's age",
            "Title": "Jared Diamond: Lessons...",
            "VideoId": "5n7yTEALxNc",
            "Controls": "start=753"
        },
        {
            "Text": " with peace and satisfaction, \"I was just like everybody else.\" And this would be my message, too. So one night, I made one final call to my prospective campaign manager. We'd do the things it'd take to win, but first he had one",
            "Title": "Embrace your raw,...",
            "VideoId": "NI915VTjCHE",
            "Controls": "start=409"
        },
        {
            "Text": " effect on the civilized world the cupola provided the thinking and the bulwark for next generation artists and thinkers and it started to forge the high Renaissance because 16 years after the rediscovery of prospective drawing",
            "Title": "The building of...",
            "VideoId": "ITfG2vospO8",
            "Controls": "start=566"
        },
        {
            "Text": " an added attractive factor to lure in prospective prey in most species an elongated lid covers the pitcher's opening sheltering it from heavy rain and protecting the digestive juices at the",
            "Title": "This Plant Traps its...",
            "VideoId": "JLc7ZRxJPZU",
            "Controls": "start=60"
        },
        {
            "Text": " No life is free of issue. All coins have two sides. On the one side, I have been humiliated in doctors' offices. I have stood in front of prospective partners and felt afraid",
            "Title": "What it means to be...",
            "VideoId": "MB7nbvD8rQk",
            "Controls": "start=679"
        },
        {
            "Text": " Because unfortunately, some of the prospective solutions to the climate crisis also can destroy nature. Protecting and respecting nature",
            "Title": "Love, sorrow and the...",
            "VideoId": "0Pl44w0iYc4",
            "Controls": "start=310"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lisa-madigan.webp",
            "Text": "Unlike public universities and private, not-for-profit colleges, for-profit schools are owned by revenue-seeking businesses often more intent on boosting their bottom line than educating their students. They use hard-sell tactics to recruit prospective students, and veterans have become particular targets.",
            "Title": "American Public Servant",
            "Name": "Lisa Madigan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lauren-conrad.webp",
            "Text": "Blogging is a great way to show your talents and interests to prospective employers, while adding an edge to your resume. If you blog consistently it shows your dedication, passions and creativity - all of which are key attributes employers look for in job candidates.",
            "Title": "American Designer",
            "Name": "Lauren Conrad"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/donald-rumsfeld.webp",
            "Text": "If a prospective Presidential approach can't be explained clearly enough to be understood well, it probably hasn't been thought through well enough. If not well understood by the American people, it probably won't 'sail' anyway. Send it back for further thought.",
            "Title": "American Politician",
            "Name": "Donald Rumsfeld"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/david-ogilvy.webp",
            "Text": "The relationship between a manufacturer and his advertising agency is almost as intimate as the relationship between a patient and his doctor. Make sure that you can life happily with your prospective client before you accept his account.",
            "Title": "English Businessman",
            "Name": "David Ogilvy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jon-porter.webp",
            "Text": "By providing our school districts with direct access to criminal information records, we can help ensure timely and complete information on prospective school employees.",
            "Title": "American Politician",
            "Name": "Jon Porter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dabney-coleman.webp",
            "Text": "I have a theory about that, if you have to say something, if you have encourage for one second a prospective acting student - he should not go in to acting.",
            "Title": "American Actor",
            "Name": "Dabney Coleman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mariella-frostrup.webp",
            "Text": "What an unappealing responsibility that is to lumber any prospective lover with: the need to be a saviour, not simply an equal partner.",
            "Title": "British Journalist",
            "Name": "Mariella Frostrup"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-dell.webp",
            "Text": "We tell prospective hires, 'If you want an environment that is never going to change, don't come here. This is not the place for you.",
            "Title": "American Businessman",
            "Name": "Michael Dell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elbert-hubbard.webp",
            "Text": "Never get married in college; it's hard to get a start if a prospective employer finds you've already made one mistake.",
            "Title": "American Writer",
            "Name": "Elbert Hubbard"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eduardo-saverin.webp",
            "Text": "For charity purposes, how do I help? A lot of prospective levers and tools have come into my life.",
            "Title": "Brazilian Businessman",
            "Name": "Eduardo Saverin"
        }
    ]
}