{
    "currentWord": {
        "wordRoot": "provision",
        "id": 19505,
        "phonemic": "prəˈvɪʒn|prəˈvɪʒn\r",
        "bigId": "14a156dd-5317-4a4c-b0df-08994435d6c9",
        "wordForms": [
            "provisions",
            "provisioning",
            "provisioned",
            "provision"
        ]
    },
    "senses": [
        {
            "id": "14a156dd-5317-4a4c-b0df-08994435d6c9",
            "de": "The act or process of supplying something.",
            "ty": "noun",
            "ex": "The school is accountable for the provision of an appropriate education to all students.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "provision of services",
                " provision of goods",
                " provision of resources"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/14a156dd-5317-4a4c-b0df-08994435d6c9.webp",
            "Tips": [
                {
                    "title": "Contextual Use",
                    "description": "Often found in business or service-related discussions, implying obligation.",
                    "example": "The hotel's provision of free Wi-Fi was much appreciated.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/x7GEDQ1hEFJy12CkwgHqTf4Icc.webp"
                },
                {
                    "title": "Implying Responsibility",
                    "description": "'Provision' can suggest an entity is responsible for providing something.",
                    "example": "The government's provision of healthcare is under debate.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/h81ccUplDTpbGH81ljOf3PuRIlo.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "41243698-fd1b-4a84-abf9-19b0697b01fe",
            "de": "A condition or requirement in a legal document.",
            "do": "Legal",
            "ty": "noun",
            "ex": "They failed to comply with the provisions of the contract.",
            "use": "",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "provisions of a contract",
                " statutory provisions",
                " legal provisions"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/41243698-fd1b-4a84-abf9-19b0697b01fe.webp",
            "Tips": [
                {
                    "title": "Legal Importance",
                    "description": "In legal texts, 'provision' is serious and binding, not to be overlooked.",
                    "example": "The provisions of the will were strictly enforced.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Scripted Boundaries",
                    "description": "Provisions set precise boundaries or rules within contracts.",
                    "example": "The rental agreement includes a provision against pets.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "6939384f-43fe-406b-a100-8085e3441c1a",
            "de": "Food, drink or equipment needed for a journey or activity.",
            "ty": "noun",
            "ex": "They made provisions for the long trip.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "make provisions",
                " sufficient provisions",
                " stock up on provisions"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6939384f-43fe-406b-a100-8085e3441c1a.webp",
            "Tips": [
                {
                    "title": "Practical Preparation",
                    "description": "Relates to tangible items packed or taken for trips or events.",
                    "example": "We packed extra provisions in case we get stranded.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Sufficiency",
                    "description": "Reflects the need for adequate supplies for a specific duration.",
                    "example": "He calculated the provisions needed for a week at sea.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "7bedd192-383b-441a-8414-ac2dd96038ef",
            "de": "A store or supply of something, especially of food or clothing.",
            "ty": "noun",
            "ex": "The refugee camps have enough provision to feed the people for a week.",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                "food provisions",
                " emergency provisions",
                " make provisions"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7bedd192-383b-441a-8414-ac2dd96038ef.webp",
            "Tips": [
                {
                    "title": "Resource Availability",
                    "description": "Highlights the existence of a supply that can be used when needed.",
                    "example": "The shelter's provision of blankets was crucial during the winter.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "aabe99d8-4f62-46fe-8d95-7fb9a88d3015",
            "de": "The action of preparing or planning in advance for something.",
            "ty": "noun",
            "ex": "They made provision for their children's futures by setting up trust funds.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "make provision for",
                " provision for the future",
                " provision for one's family"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/aabe99d8-4f62-46fe-8d95-7fb9a88d3015.webp",
            "Tips": [
                {
                    "title": "Future Oriented",
                    "description": "Focus on actions taken now to benefit or safeguard the future.",
                    "example": "Good parents make provision for their children's education.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Care and Foresight",
                    "description": "Indicates careful planning for unpredictable circumstances.",
                    "example": "The family made ample provision for potential emergencies.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Arrangement": {
            "wordRoot": "Arrangement",
            "wordDefinition": "Arrangement usually refers to the way things are organized or put together. For example, you may arrange the furniture in your room or make arrangements for a meeting.\n\nBoth words are used to describe the act of preparing or setting something up, but arrangement puts more emphasis on the organization of something while provision focuses on the act of making something available.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/78870e5d-20d1-4ccb-bf38-de06b3312745.webp"
        },
        "Cater": {
            "wordRoot": "Cater",
            "wordDefinition": "Cater means to prepare and provide food and drinks for an event or group of people.\n\nThe main difference between cater and provision is that catering focuses specifically on food and drink for an event, while provision can refer to a wider range of necessities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f4e99078-3fc2-42ae-b5fb-f37f2568a49e.webp"
        },
        "Equipment": {
            "wordRoot": "Equipment",
            "wordDefinition": "Equipment refers to tools, machinery, or other physical objects used to perform a task or activity. For example, a construction worker would use equipment such as a drill or a crane.\n\nEquipment is the physical objects used to perform a task, while provision is the act of providing something that is needed.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/98d9050d-a882-4a81-b3ea-9a45220c4b9b.webp"
        },
        "Preparation": {
            "wordRoot": "Preparation",
            "wordDefinition": "Preparation refers to the act of getting ready or making something ready in advance. It involves planning, organizing and making arrangements for the future.\n\nBoth preparation and provision are important in different situations. Preparation is applicable when planning for something that is yet to happen, while provision is applicable when dealing with a current or immediate need.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/43ac62d7-5b40-4d51-b5f1-66ec1e880349.webp"
        },
        "Stipulate": {
            "wordRoot": "Stipulate",
            "wordDefinition": "Both provision and stipulate refer to an agreement or a condition set forth in a contract or agreement.\n\nStipulate is similar, but it specifically refers to a condition that is explicitly stated in the agreement.\n\nIn other words, the parties have agreed upon a specific condition and have included it in the contract. For example, a contract may stipulate that a project must be completed by a certain date.\n\nIn general, provisions tend to be broader in scope than stipulations, and may include multiple conditions or requirements.\n\nStipulations are typically more specific and may only apply to a particular aspect of the agreement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a38fca9a-ddf2-48ba-b689-f7eebdb25fd2.webp"
        },
        "Stock": {
            "wordRoot": "Stock",
            "wordDefinition": "Stock refers to a supply of something that is kept on hand for future use or sale.\n\nIt can be applicable in situations like a retail store keeping a supply of clothing, a factory having a stock of raw materials or finished products, or an investor having a stock portfolio.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2cd09697-f848-4bc1-b212-2f38f4ebd4d8.webp"
        },
        "Subsistence": {
            "wordRoot": "Subsistence",
            "wordDefinition": "Subsistence, on the other hand, refers to the basic necessities of life that are needed to survive, such as food, water, and shelter.\n\nFor example, a family that has enough food to eat every day would be said to have provisions, while a family that is barely able to scrape together enough food to survive would be said to be living in subsistence.\n\nThe term \"subsistence farming\" is often used to describe a type of agriculture in which people grow only enough food to feed themselves and their families.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fa42f87e-a346-4f7c-87e8-6e5c40563fc5.webp"
        },
        "Supply": {
            "wordRoot": "Supply",
            "wordDefinition": "Supply refers to the act of providing something that is needed, usually in the present moment. For example, a store may supply products to customers who need them right now.\n\nProvision is about planning ahead while supply is about meeting immediate needs.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f7e92a9c-75e5-4df6-94ba-00758c5a54d9.webp"
        }
    },
    "videos": [
        {
            "Text": " and the provision of the solution to food waste, which is simply to sit down and eat food, rather than throwing it away. That became, as it were, a way of confronting large businesses in the business of wasting food, and exposing, most importantly, to the public, that when we're talking about food being thrown away, we're not talking about rotten stuff, we're not talking about",
            "Title": "Tristram Stuart: The...",
            "VideoId": "cWC_zDdF74s",
            "Controls": "start=107"
        },
        {
            "Text": " investment in human capital, provision of citizenship rights, provision of infrastructure, management of the tangible and intangible assets of the state through regulation, creation of the market, international agreements, including public borrowing, and then, most importantly, rule of law.",
            "Title": "Ashraf Ghani: How to fix...",
            "VideoId": "A6GLw12jywo",
            "Controls": "start=361"
        },
        {
            "Text": " now the cells must be provisioned a potter wasp doesn't feed her larvae on chewed bodies nor does she supply honey she gives it living food a caterpillar paralyzed by her sting the lippert built so carefully around the entrance helps to guide it in",
            "Title": "Wasp Builds Unique Nest...",
            "VideoId": "fY6m89lLyrs",
            "Controls": "start=112"
        },
        {
            "Text": " and moved inside the walls surrounding their city and port, now provisioned by a superior fleet and extensive maritime empire. The cramped conditions have taken a toll and a recent plague wiped out a third of the population. But city life goes on.",
            "Title": "A day in the life of an...",
            "VideoId": "ar8S6virCwM",
            "Controls": "start=28"
        },
        {
            "Text": " in an overpopulated world so he has developed his very own alarm system to warn them of dangerous marauders in search of provisions out here in the rural areas people are going to be spilling out to to take what farmers have i'm not going",
            "Title": "Living Off the Land PIPE...",
            "VideoId": "jInq4cNerFA",
            "Controls": "start=7"
        },
        {
            "Text": " now the cells must be provisioned a potter wasp doesn't feed her larvae on chewed bodies nor does she supply honey she gives it living food a caterpillar paralyzed by her sting the lip built so carefully around the entrance helps to",
            "Title": "The Trials Of Life...",
            "VideoId": "nCHUffn2J1U",
            "Controls": "start=116"
        },
        {
            "Text": " our tricity provision though the entire country that work I would say and submit this evidence of our ambition to act as a good global citizen and it shows just one of the many ways in which Scotland can perhaps help tackle the",
            "Title": "The big impact of small...",
            "VideoId": "jb-cD9gUorU",
            "Controls": "start=267"
        },
        {
            "Text": " to understand the process of how a child learns language -- that child being my son. And so with many privacy provisions put in place to protect everyone who was recorded in the data, we made elements of the data available",
            "Title": "Deb Roy: The birth of a...",
            "VideoId": "RE4ce4mexrU",
            "Controls": "start=157"
        },
        {
            "Text": " could complicate the entire process. More importantly, Madison felt that people's rights were already guaranteed through the democratic process, while adding extra provisions risked misinterpretation.",
            "Title": "Why wasn’t the Bill of...",
            "VideoId": "aMCDikASE4o",
            "Controls": "start=171"
        },
        {
            "Text": " offerings, including pots of food at the graves of the deceased. The ritual ensured the dead had provisions for eternity. These pots mean a tomb should be very close.",
            "Title": "Ancient Egypt's...",
            "VideoId": "vb0gJi_QOrA",
            "Controls": "start=35"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benjamin-franklin.webp",
            "Text": "In my youth, I traveled much, and I observed in different countries, that the more public provisions were made for the poor, the less they provided for themselves, and of course became poorer. And, on the contrary, the less was done for them, the more they did for themselves, and became richer.",
            "Title": "American Politician",
            "Name": "Benjamin Franklin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-arrington.webp",
            "Text": "Our independence from AOL was so important to me that I negotiated an extremely odd provision in our purchase agreement that allowed me to disclose confidential information about AOL. It was their job never to give me that information. It was not my job to protect it in any way.",
            "Title": "American Businessman",
            "Name": "Michael Arrington"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anna-lindh.webp",
            "Text": "One of the gaps in our international development efforts is the provision of global public goods - that is, goods or conditions we need that no individual or country can secure on their own, such as halting global warming, financial stability and peace and security.",
            "Title": "Swedish Politician",
            "Name": "Anna Lindh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-romer.webp",
            "Text": "If we collectively set our minds to improving technology of a particular type we can do that, and it takes some collective action, some support for research, or some provision of patent protection, or a mixture of the two, and some focussed energy.",
            "Title": "American Economist",
            "Name": "Paul Romer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/linda-mccartney.webp",
            "Text": "I had daydreams and fantasies when I was growing up. I always wanted to live in a log cabin at the foot of a mountain. I would ride my horse to town and pick up provisions. Then return to the cabin, with a big open fire, a record player and peace.",
            "Title": "American Photographer",
            "Name": "Linda McCartney"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/voltaire.webp",
            "Text": "This self-love is the instrument of our preservation; it resembles the provision for the perpetuity of mankind: it is necessary, it is dear to us, it gives us pleasure, and we must conceal it.",
            "Title": "French Writer",
            "Name": "Voltaire"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/angus-deaton.webp",
            "Text": "Economic growth is very important, but it is not the only thing, and it must be accompanied by sharing with those who are left behind, through effective social services and provision.",
            "Title": "British Economist",
            "Name": "Angus Deaton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerry-costello.webp",
            "Text": "In addition to the clean coal provisions, the energy conference agreement contains provisions instrumental in helping increase conservation and lowering consumption.",
            "Title": "American Politician",
            "Name": "Jerry Costello"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-madison.webp",
            "Text": "It is a universal truth that the loss of liberty at home is to be charged to the provisions against danger, real or pretended, from abroad.",
            "Title": "American President",
            "Name": "James Madison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luciana-berger.webp",
            "Text": "It is overwhelmingly women who will plug the gaps in care provision, sacrificing paid employment to look after family members.",
            "Title": "British Politician",
            "Name": "Luciana Berger"
        }
    ]
}