{
    "currentWord": {
        "wordRoot": "qualification",
        "id": 22541,
        "phonemic": "ˌkwɒlɪfɪˈkeɪʃn|ˌkwɑːlɪfɪˈkeɪʃn\r",
        "bigId": "aa4d8a27-d82d-4b15-8779-cfcc1553ace4",
        "wordForms": [
            "qualifications",
            "qualification"
        ]
    },
    "senses": [
        {
            "id": "aa4d8a27-d82d-4b15-8779-cfcc1553ace4",
            "de": "Something that prepares or makes you suitable for a particular job, activity, or task",
            "ty": "noun",
            "ex": "A degree or any other qualification is required for this job.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "job qualification",
                " professional qualification",
                " educational qualification"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/aa4d8a27-d82d-4b15-8779-cfcc1553ace4.webp",
            "Tips": [
                {
                    "title": "Beyond Academia",
                    "description": "Qualifications include work experience and skills, not just degrees.",
                    "example": "Her extensive volunteer work was a valuable qualification for the role.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/p785QoVyAOFVbaW1Fbj5TvqcjM.webp"
                },
                {
                    "title": "Varying Relevance",
                    "description": "Different jobs require different qualifications; tailor your application accordingly.",
                    "example": "While applying for the marketing job, he highlighted his qualification in digital advertising.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/uQWEH6tn0Au4yVKzqXwzJDx8w.webp"
                },
                {
                    "title": "Cultural Differences",
                    "description": "Qualifications may be named or recognized differently in other countries.",
                    "example": "In the UK, an MBA is a prestigious qualification, much like in the US.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/td8LgkpxFGKIZupWpSBzX7bCyec.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "78b2c53a-a6fd-4d3d-bd87-24276bf2e984",
            "de": "A condition or requirement that must be met",
            "ty": "noun",
            "ex": "You need to meet certain qualifications to apply for this program.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "meet a qualification",
                " application qualification",
                " program qualification"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/78b2c53a-a6fd-4d3d-bd87-24276bf2e984.webp",
            "Tips": [
                {
                    "title": "Baseline Standards",
                    "description": "Qualifications can be minimum standards you must meet for consideration.",
                    "example": "Basic computer proficiency is a qualification for the office assistant position.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Varied Forms",
                    "description": "Qualifications can include tests, licenses, or certificates, not just experiences.",
                    "example": "A driver's license is a key qualification for a delivery driver.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6ee24edc-8979-45f9-9913-0b5076e2800f",
            "de": "A restriction or limitation on a statement",
            "ty": "noun",
            "ex": "He made his argument with several qualifications to limit its scope.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "statement qualification",
                " argument qualification",
                " thesis qualification"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6ee24edc-8979-45f9-9913-0b5076e2800f.webp",
            "Tips": [
                {
                    "title": "Clarifying Statements",
                    "description": "Use qualification to make your statements more precise and avoid generalization.",
                    "example": "He supported his claims with the qualification that the study was preliminary.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Academic Writing",
                    "description": "In essays, use qualifications to acknowledge counterarguments or limitations.",
                    "example": "The theory, with the qualification of lacking empirical evidence, remains contested.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "53eb4cc6-ebef-4956-b000-f7742ded04a1",
            "de": "The act of qualifying for something",
            "ty": "noun",
            "ex": "Her qualification for the Olympics was a dream come true.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "olympic qualification",
                " championship qualification",
                " tournament qualification"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/53eb4cc6-ebef-4956-b000-f7742ded04a1.webp",
            "Tips": [
                {
                    "title": "Accomplishment Highlight",
                    "description": "Qualification for an event signifies an accomplishment or a level of skill.",
                    "example": "Her qualification for the national debate team showcased her speaking abilities.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Process Emphasis",
                    "description": "Highlight the process it takes to achieve qualification for an event or position.",
                    "example": "Years of training led to his qualification for the world championships.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Accreditation": {
            "wordRoot": "Accreditation",
            "wordDefinition": "Accreditation is the process of recognizing and approving an institution or program as meeting certain standards. It is applicable to universities, colleges, and other education providers, as well as professional associations and organizations.\n\nAccreditation ensures that the institution or program meets specific quality criteria and that graduates of these programs possess specified skills and knowledge.\n\nAccreditation is a process that recognizes institutions and programs that meet certain standards, while qualification is a measure of an individual's skills and knowledge in a particular area.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/94e39bc5-b734-4bf7-be70-b4fa3fd78ff5.webp"
        },
        "Approval": {
            "wordRoot": "Approval",
            "wordDefinition": "Approval refers to giving permission or agreement to something. For example, a parent approves of their child's request to go to a party.\n\nApproval is often given by someone in a position of authority or someone who has the power to grant permission.\n\nApproval is when someone gives permission or agreement to something, while qualification is when someone has the necessary skills or requirements for something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/91260363-e40f-4c23-a519-8bfabd2f9bbe.webp"
        },
        "Certificate": {
            "wordRoot": "Certificate",
            "wordDefinition": "A certificate is a document that confirms you have completed a course or training program. It shows that you have gained specific knowledge or skills in a particular area.\n\nCertificates are often given for short-term courses or workshops that focus on a particular skill or subject.\n\nA qualification refers to a level of achievement like a degree, diploma, or professional certification. It means that the holder has completed a full program of study and has achieved a certain level of expertise in a particular field.\n\nTo summarise, certificates are awarded for short courses and workshops, while qualifications are awarded for completing a full program of study, and they demonstrate a higher level of skill and knowledge.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c3a551cf-6c69-45c4-8d84-ceae8bb9aceb.webp"
        },
        "Credential": {
            "wordRoot": "Credential",
            "wordDefinition": "A credential is a document that proves a person's identity or qualifications, such as a passport, driver's license or diploma.\n\nA credential is a document that proves who you are or who you say you are, while a qualification refers to the skills and knowledge you have that make you suitable for a particular job or task.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3f6ffb43-5796-4182-91bf-7f256738528d.webp"
        },
        "Degree": {
            "wordRoot": "Degree",
            "wordDefinition": "A degree is a type of qualification that you can earn by completing a program of study at a university or college. It usually takes several years of full-time study to earn a degree, and when you graduate, you'll have a certificate or diploma that shows you've completed the program.\n\nA degree is a specific type of qualification that you earn through higher education, while a qualification is a more general term that can refer to any type of recognition of skills or knowledge.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c151d367-5c77-46a8-8738-7f023b6c8df8.webp"
        },
        "Diploma": {
            "wordRoot": "Diploma",
            "wordDefinition": "A diploma is a certificate that you receive after completing a specific course of study, such as a high school diploma or a diploma in nursing.\n\nA diploma is applicable to specific courses of study, whereas a qualification can apply to a broader range of skills and education levels.\n\nFor example, a high school diploma is a specific type of diploma that is awarded after completing high school, while a nursing qualification may include several different levels of certification and training.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dd75e744-ec56-4a06-a877-7b519fa6307f.webp"
        },
        "Endorse": {
            "wordRoot": "Endorse",
            "wordDefinition": "Endorse means to publicly declare support or approval of someone or something. This may be applicable in the context of endorsing a political candidate or endorsing a certain product or brand.\n\nEndorse is about giving support or approval, while qualification is about meeting necessary requirements to fulfill a certain role or task.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d6371da8-9f69-4d21-bebb-f06a8cfd4a80.webp"
        },
        "License": {
            "wordRoot": "License",
            "wordDefinition": "License is a legal document that gives one the permission to perform a certain activity or carry out a certain profession.\n\nFor example, a driver's license gives you the right to drive a car legally.\n\nA license is issued by a government authority, and it is mandatory to have one if you want to pursue a specific line of work or perform an activity in some capacity.\n\nTo summarize, a license is required by law, while a qualification is not.\n\nA license gives permission to engage in a specific activity, while a qualification demonstrates expertise in a particular area.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/837e9a2a-fcd5-4b8f-80bb-47925e826183.webp"
        }
    },
    "videos": [
        {
            "Text": " helping us build that and the kids are on the board and because the community was really keen on working with the high school the high school is now teaching agriculture and because it's teaching agriculture we started to think how can we then get those kids that never had a qualification before in their lives but they're really excited about growing how",
            "Title": "How we can eat our...",
            "VideoId": "4KmKoj4RSZw",
            "Controls": "start=412"
        },
        {
            "Text": " in an orchard with bees, and the kids are helping us build that, and the kids are on the board, and because the community was really keen on working with the high school, the high school is now teaching agriculture, and because it's teaching agriculture, we started to think, how could we then get those kids that never had a qualification",
            "Title": "Pam Warhurst: How we can...",
            "VideoId": "qErZ2AQDMB4",
            "Controls": "start=405"
        },
        {
            "Text": " meaning that only people who fall below a certain income level are eligible for benefits. This policy is designed to ensure aid goes to those who need it most. But it also means people lose access as soon as they earn more than the qualification threshold, regardless of whether or not they're financially stable enough to stay there.",
            "Title": "Why is it so hard to...",
            "VideoId": "D9N7QaIOkG8",
            "Controls": "start=97"
        },
        {
            "Text": " I said, \"No, I want to actually start a college only for the poor. What the poor thought was important would be reflected in the college.\" So the elders gave me some very sound and profound advice. They said, \"Please, don't bring anyone with a degree and qualification",
            "Title": "Bunker Roy: Learning...",
            "VideoId": "6qqqVwM6bMM",
            "Controls": "start=203"
        },
        {
            "Text": " gonna talk about should be a reason that you don't get a job for which you have experience and qualifications to do and lastly it's a really great chance to show the respect and the interest and the appreciation you have for the opportunity to interview so there's six",
            "Title": "Put those smartphones...",
            "VideoId": "NKBlWanXzGE",
            "Controls": "start=58"
        },
        {
            "Text": " equipped with three- to five-day training -- this is the qualification -- who work on nothing less than the world's rescue. National sovereignties have been outsourced to private companies, and they pass on their responsibilities to third parties.",
            "Title": "The price of a \"clean\"...",
            "VideoId": "E4FrxvHJlKw",
            "Controls": "start=807"
        },
        {
            "Text": " and this means huge challenges in terms of education, qualification, upskilling for governments and companies. Now, the next thing we looked into was robots, automation, technology. Will technology change this picture and boost productivity?",
            "Title": "Rainer Strack: The...",
            "VideoId": "ux1GxExRUUY",
            "Controls": "start=313"
        },
        {
            "Text": " commend signal authorities but dogs don't necessarily have to be the strong and sturdy types to be workers when it comes to helping special needs people with pet therapy the main qualification is unconditional love these special dogs",
            "Title": "Working Dogs PIPE National...",
            "VideoId": "6j9X3Fnswmo",
            "Controls": "start=156"
        },
        {
            "Text": " Caltech couldn't find anybody that met the kinds of qualifications he was looking for but one day he was in an online discussion forum and he struck up a conversation with somebody he had never met before and long story short he",
            "Title": "Inviting serendipity to...",
            "VideoId": "4x6bXOETp_M",
            "Controls": "start=29"
        },
        {
            "Text": " But think of it. These men, who hadn't had the educational opportunities I'd had, helped me gain post-graduate qualifications in law by their dedicated help. Well, I went back and became an academic",
            "Title": "Ron McCallum: How...",
            "VideoId": "QoTSdOkjEVs",
            "Controls": "start=246"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sean-lock.webp",
            "Text": "My major regret in life is not going to university, though not for the qualification I would have gained. People I know who went there have a working method where they sit down and get something done; they know how to start and get on with things. I will do anything to avoid getting on with stuff.",
            "Title": "English Comedian",
            "Name": "Sean Lock"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sasha-jackson.webp",
            "Text": "It's one of the main things that I love about my job. You are never playing yourself, so I really love that I get to be someone else, play a different character and take on that persona, but I also have to take on their qualifications.",
            "Title": "British Actress",
            "Name": "Sasha Jackson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/terry-wogan.webp",
            "Text": "There's more to life than passing exams, and paper qualifications can only take you so far. A lot depends on luck, and on being in the right place at the right time, which was certainly true in my case.",
            "Title": "Irish Entertainer",
            "Name": "Terry Wogan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/whitney-wolfe-herd.webp",
            "Text": "Always know your merit and how special you are, and don't let someone else's qualifications make you feel small. If you stick to this, you will always deserve their respect.",
            "Title": "American Businesswoman",
            "Name": "Whitney Wolfe Herd"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/harriet-martineau.webp",
            "Text": "What office is there which involves more responsibility, which requires more qualifications, and which ought, therefore, to be more honorable, than that of teaching?",
            "Title": "English Writer",
            "Name": "Harriet Martineau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-amery.webp",
            "Text": "All men will commence in their present rank and promotion will be open to all men alike, without any distinctions or qualifications, political or otherwise.",
            "Title": "British Politician",
            "Name": "John Amery"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zaha-hadid.webp",
            "Text": "Good education is so important. We do need to look at the way people are taught. It not just about qualifications to get a job. It's about being educated.",
            "Title": "British Architect",
            "Name": "Zaha Hadid"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hedda-hopper.webp",
            "Text": "At one time I thought he wanted to be an actor. He had certain qualifications, including no money and a total lack of responsibility.",
            "Title": "American Actress",
            "Name": "Hedda Hopper"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-kiyosaki.webp",
            "Text": "Academic qualifications are important and so is financial education. They're both important and schools are forgetting one of them.",
            "Title": "American Author",
            "Name": "Robert Kiyosaki"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/samuel-richardson.webp",
            "Text": "The companion of an evening, and the companion for life, require very different qualifications.",
            "Title": "English Novelist",
            "Name": "Samuel Richardson"
        }
    ]
}