{
    "currentWord": {
        "wordRoot": "quote",
        "id": 12251,
        "phonemic": "kwəʊt|kwəʊt\r",
        "bigId": "79095899-da97-4e1b-995a-b8252b2ae852",
        "wordForms": [
            "quotes",
            "quoting",
            "quoted",
            "unquote",
            "quote"
        ]
    },
    "senses": [
        {
            "id": "79095899-da97-4e1b-995a-b8252b2ae852",
            "de": "To repeat the exact words that someone else has said or written.",
            "ty": "verb",
            "ex": "He quoted a line from her favorite book.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "quote a line",
                " quote a passage",
                " quote a source"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/79095899-da97-4e1b-995a-b8252b2ae852.webp",
            "Tips": [
                {
                    "title": "Exact Repetition",
                    "description": "Use 'quote' to show you are using somebody's exact words, not paraphrasing.",
                    "example": "In his speech, he quoted the president verbatim.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/P0uoAV1R8VPobegnS62adgKU3U8.webp"
                },
                {
                    "title": "Attribution Necessary",
                    "description": "When quoting, always give credit to the original speaker or writer.",
                    "example": "She quoted Shakespeare, saying 'To be, or not to be...'",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/5eW6jpWIcGx42o4hWOswyFrJoqo.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "977bf1eb-abd9-4ec1-997f-ac2addb7efbc",
            "de": "To give someone an estimated cost for a job or service.",
            "ty": "verb",
            "ex": "He quoted me $500 for the repair work.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "quote a price",
                " get a quote",
                " quote for a job"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/977bf1eb-abd9-4ec1-997f-ac2addb7efbc.webp",
            "Tips": [
                {
                    "title": "Preliminary Cost",
                    "description": "Quote as a verb in business means giving an initial estimate, not the final price.",
                    "example": "They quoted me an initial fee for the event planning.\r",
                    "imageUrl": ""
                },
                {
                    "title": "No Commitment",
                    "description": "A price quote is usually no obligation, meaning it's not a binding contract.",
                    "example": "I asked for a quote but haven't decided to purchase yet.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Changeable Rates",
                    "description": "The quoted price can change based on final details or requirements.",
                    "example": "The initial quote was low, but the price increased with extra features.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "f2c9050b-c740-4581-973f-94dd57bbe4a3",
            "de": "A phrase or passage from a book, speech, etc. that someone repeats, usually because it is interesting or useful.",
            "ty": "noun",
            "ex": "He is known for his funny quotes.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "famous quote",
                " inspirational quote",
                " quote of the day"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f2c9050b-c740-4581-973f-94dd57bbe4a3.webp",
            "Tips": [
                {
                    "title": "Memorable Wisdom",
                    "description": "Quotes are often memorable sayings that offer advice or wisdom.",
                    "example": "His grandfather's quote became his life mantra.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Cultural Impact",
                    "description": "Quotes from influential figures often reflect cultural values or history.",
                    "example": "The quote from Dr. King resonated with many.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Context Matters",
                    "description": "Understand the context to fully appreciate the meaning of a quote.",
                    "example": "Her favorite quote was more impactful when she learned its history.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "9b6c154a-69ea-408d-9ee0-17d35a2b6032",
            "de": "A price that a person or company says they will do a piece of work for.",
            "ty": "noun",
            "ex": "Could you send me a quote for the necessary repairs?",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "request a quote",
                " accepted quote",
                " price quote"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9b6c154a-69ea-408d-9ee0-17d35a2b6032.webp",
            "Tips": [
                {
                    "title": "Service Comparison",
                    "description": "Use quotes to compare costs between different service providers.",
                    "example": "I gathered several quotes before choosing a contractor.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Budget Planning",
                    "description": "Quotes help you plan expenses for a project or purchase.",
                    "example": "Getting a quote helped me budget for the home renovation.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Cite": {
            "wordRoot": "Cite",
            "wordDefinition": "Both cite and quote are used to refer to referencing a source, but they have different meanings.\n\nCite means to refer to or mention a source, such as a book or a website, in order to provide evidence or further support for an argument.\n\nFor example, if you were writing an essay on climate change, you might cite a report by the Intergovernmental Panel on Climate Change to support your argument.\n\nCite refers to referencing a source, while quote refers specifically to repeating someone else's words exactly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4c008413-01b8-4381-b8b6-fee31be545c6.webp"
        },
        "Extract": {
            "wordRoot": "Extract",
            "wordDefinition": "Extract means to take out or remove a portion from a larger whole, while quote means to repeat or use someone else's words verbatim.\n\nFor example, if a person reads a long book and wants to use a small section in a report, they would extract (take out) that section from the book.\n\nBoth words can also be used in different contexts, but generally, extract refers to taking out a part of something while quote refers to using someone else's words exactly as they were said or written.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9051e395-4bbf-4770-928d-9c1ba4a9b79b.webp"
        },
        "Mention": {
            "wordRoot": "Mention",
            "wordDefinition": "Mention means to briefly refer or talk about something without providing any exact words or phrases. It is applicable when you want to give a general idea or reference something in passing.\n\nFor example, \"He mentioned that he was thinking of getting a new car.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f33db7fa-6887-44aa-ad26-f2d4b27e5d8d.webp"
        },
        "Note": {
            "wordRoot": "Note",
            "wordDefinition": "A note is a brief piece of writing that contains information about something.\n\nIt can be a reminder or a short explanation. For example, you might write a note to remind yourself to buy milk.\n\nA note is a short message or reminder while a quote is a word-for-word repetition of someone else's statement in order to support or illustrate a point.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4ab0402d-3807-45a1-8acd-d6999d0bade9.webp"
        },
        "Paraphrase": {
            "wordRoot": "Paraphrase",
            "wordDefinition": "Paraphrasing means rewording someone else's words or ideas in your own words while still conveying the same meaning. It is applicable when you want to explain someone's ideas by using your own language.\n\nA good paraphrase is not identical to the original text but retains its meaning.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bb0867b1-d0f5-4fae-8f22-eb813691eb98.webp"
        },
        "Recite": {
            "wordRoot": "Recite",
            "wordDefinition": "Recite means to repeat something out loud from memory, like reciting a poem or a pledge. For example, \"I can recite the entire Pledge of Allegiance by heart.\".\n\nQuote is used when one repeats exact words written by someone else, while recite is used when one repeats something from memory out loud.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f28ad655-f8dd-4ca4-a4fc-6ba5014c9ead.webp"
        },
        "Refer": {
            "wordRoot": "Refer",
            "wordDefinition": "Refer means to mention a source or give credit to where you found the information. For example, \"According to a recent study by the American Medical Association, regular exercise improves mental health.\".\n\nIn short, we use quote when we want to include someone's exact words, while we use refer when we want to acknowledge the source of information.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/12ed159a-bf8a-4e25-b67a-ddfd14ab0635.webp"
        },
        "Reiterate": {
            "wordRoot": "Reiterate",
            "wordDefinition": "Reiterate means to repeat or emphasize something that has already been said or done. This is usually done to make sure that the person you are speaking to remembers something important, or to emphasize a point.\n\nTo put it simply, quote means repeating someone else's exact words, while reiterate means repeating or emphasizing something that has already been said.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4381d1f8-6545-4c16-b7d6-b310c060df2a.webp"
        },
        "Repeat": {
            "wordRoot": "Repeat",
            "wordDefinition": "Repeat means to say or do something again, usually without any changes or alterations. It is applicable when you want to reiterate or echo something that has already been said or done, or when you want to copy something exactly without necessarily giving credit to the original source.\n\nIn summary, quoting involves copying someone else's exact words and giving credit to the original source, while repeating involves saying or doing something again without necessarily giving credit or acknowledgment to the original source.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bc5dc06b-a091-4e18-ac48-729c4a97e8a6.webp"
        }
    },
    "videos": [
        {
            "Text": " screaming and cheering because nighttime turn it a day and so here we are at the Eclipse yeah daytime turned into night and people were screaming and cheering and getting goosebumps it it's a weird parallel but it was really set like the off yeah and right time of turned to day and quotes because it wasn't from the Sun it was from the",
            "Title": "Watch the Total Solar...",
            "VideoId": "oLBwibYSzEk",
            "Controls": "start=3764"
        },
        {
            "Text": " Yet he ended the speech by affirming the possibility of building a better world, to quote, “where no one will be able to decide for others how they die, where love will prove true and happiness be possible, and where the races condemned to one hundred years of solitude",
            "Title": "Why should you read \"One...",
            "VideoId": "B2zhLYz4pYo",
            "Controls": "start=286"
        },
        {
            "Text": " I was using stimulants to get going. I was using depressants to wind down and go to sleep. It was a disaster. I felt completely trapped. I bought a book on simplicity to try to find answers. And I did find a quote that made a big difference in my life,",
            "Title": "Why you should define...",
            "VideoId": "5J6jAC6XxAI",
            "Controls": "start=296"
        },
        {
            "Text": " Very heavy hetero guy. But he wrote in this book, \"Ideal Marriage\" -- he said that he could differentiate between the semen of a young man, which he said had a fresh, exhilarating smell, and the semen of mature men, whose semen smelled, quote,",
            "Title": "Mary Roach: 10 things...",
            "VideoId": "7jx0dTYUO5E",
            "Controls": "start=360"
        },
        {
            "Text": " we will quote a crew of film crews and we will film exactly what happened and we don't know what it'll be a triumph we don't know whether it'll be a tragedy but we'll show you the truth I only saw it when the film's will find the edited",
            "Title": "David Attenborough On...",
            "VideoId": "OgcDGUkAz2U",
            "Controls": "start=22"
        },
        {
            "Text": " quotes yeah am i uncomfortably close go ahead come over here get in here find your light no you stand up I'm the past day right yeah okay he's afraid of puppets hi hi you have a question or did you forget it cuz I annoyed you yeah I I",
            "Title": "Life lessons from a...",
            "VideoId": "DKgzMjgbUbU",
            "Controls": "start=395"
        },
        {
            "Text": " and I was frustrated by the lagging status of women in our profession and what that meant for our image in the media. We make up half the population of the world, but we're just 24 percent of the news subjects quoted in news stories.",
            "Title": "Megan Kamerick: Women...",
            "VideoId": "rufeS-lZJg8",
            "Controls": "start=34"
        },
        {
            "Text": " he'd been caught plagiarizing and faking quotes, and he was drenched in shame and regret, he told me. And he had the opportunity to publicly apologize at a foundation lunch. This was going to be the most important speech of his life.",
            "Title": "How one tweet can ruin...",
            "VideoId": "wAIP6fI0NAI",
            "Controls": "start=64"
        },
        {
            "Text": " And today, the quote, whoever said it, is truer than ever before. In previous decades, most media with global reach consisted of several major newspapers and networks which had the resources to gather information directly.",
            "Title": "How false news can...",
            "VideoId": "cSKGa_7XJkg",
            "Controls": "start=24"
        },
        {
            "Text": " Each chapter begins with a quote from a future history book, recalling elements of the events that are about to unfold. The book also contains in-universe appendices that further explore the Empire’s history;",
            "Title": "Why should you read...",
            "VideoId": "yhYU4ZbLmmk",
            "Controls": "start=247"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/heavy-d.webp",
            "Text": "There's something about being any kind of entertainer that is acting. You have to put on a show. Things you wouldn't do in your life, you do on stage. You have to let go. And that's extra hard for rappers. We have a tendency to, quote unquote, keep it real. As an actor, you have to be able to humiliate yourself. Do whatever it takes.",
            "Title": "Jamaican Musician",
            "Name": "Heavy D"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/reggie-jackson.webp",
            "Text": "I've always been able to hear and read what I say before I say it. That's why I'm a good quote. Or a good interview. If I say something that's uncomfortable for someone's ears, it's going to be the truth; I just happen to voice it. But it's the truth. It's not my opinion.",
            "Title": "American Athlete",
            "Name": "Reggie Jackson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/peter-morgan.webp",
            "Text": "There are people who are bound journalistically to a code of ethics that means they can't quote something that isn't sourced, whereas what I do is entirely unsourced. I effectively fictionalise history and yet somehow aim at a greater truth.",
            "Title": "British Writer",
            "Name": "Peter Morgan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kami-garcia.webp",
            "Text": "At the beginning of a new project, often before I do any actual writing, I collect photos, quotes, song lyrics, and even objects that relate to the characters or the world I'm creating.",
            "Title": "American Writer",
            "Name": "Kami Garcia"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/g-edward-griffin.webp",
            "Text": "If we took information only from sources with which we agreed on all issues, we would be left with merely quoting ourselves, and we would miss a great deal of truth.",
            "Title": "American Author",
            "Name": "G. Edward Griffin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/philip-gilbert-hamerton.webp",
            "Text": "Have you ever observed that we pay much more attention to a wise passage when it is quoted than when we read it in the original author?",
            "Title": "English Artist",
            "Name": "Philip Gilbert Hamerton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/raghuram-rajan.webp",
            "Text": "One of the difficulties of a job in the, quote, 'real world' is you don't really get time to shut yourself off in a room and think.",
            "Title": "Indian Economist",
            "Name": "Raghuram Rajan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-fisk.webp",
            "Text": "The biggest problem I have in journalism is being quoted or misquoted and then being asked to defend something I haven't said.",
            "Title": "British Journalist",
            "Name": "Robert Fisk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/amos-bronson-alcott.webp",
            "Text": "One must be a wise reader to quote wisely and well.",
            "Title": "American Educator",
            "Name": "Amos Bronson Alcott"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/viv-albertine.webp",
            "Text": "I adore quotes.",
            "Title": "British Musician",
            "Name": "Viv Albertine"
        }
    ]
}