{
    "currentWord": {
        "wordRoot": "raise",
        "id": 21097,
        "phonemic": "reɪz|reɪz\r",
        "bigId": "90784f99-5859-479b-b078-27310f57c843",
        "wordForms": [
            "raises",
            "raising",
            "raised",
            "raise"
        ]
    },
    "senses": [
        {
            "id": "90784f99-5859-479b-b078-27310f57c843",
            "de": "to lift or move something to a higher position",
            "ty": "verb",
            "ex": "Please raise your hand if you know the answer.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "raise your hand",
                " raise your voice",
                " raise the flag"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/90784f99-5859-479b-b078-27310f57c843.webp",
            "Tips": [
                {
                    "title": "Physical Action",
                    "description": "Often used when someone performs a physical action to move something upwards.",
                    "example": "The workers raised the beams to secure the structure.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xmRVbxPMMyikUIxSEp34Gg7bE7Q.webp"
                },
                {
                    "title": "Sign of Respect",
                    "description": "'Raise' is used in contexts of respect or tribute, such as a salute or anthem.",
                    "example": "Everyone raised their glasses to toast the newlyweds.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/1PJHTx7MLHeHAZW8xQyH6oIdxI.webp"
                }
            ]
        },
        {
            "id": "7d288bbf-07bd-4f4a-8e00-c8f7f619290b",
            "de": "to increase the amount, level, or strength of something",
            "ty": "verb",
            "ex": "The company decided to raise prices by 10%.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "raise prices",
                " raise the temperature",
                " raise the level"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7d288bbf-07bd-4f4a-8e00-c8f7f619290b.webp",
            "Tips": [
                {
                    "title": "Gradual Increase",
                    "description": "Refers to a gradual or planned increase in levels or amounts, not a sudden spike.",
                    "example": "The store will raise the prices slowly over the next year.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Controlled Change",
                    "description": "'Raise' implies a deliberate change decided by someone in control or authority.",
                    "example": "Management might raise our targets due to higher demand.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "b5ee65ce-5719-4589-b2e0-a91dd8e34e9d",
            "de": "to collect or get money for a particular purpose",
            "ty": "verb",
            "ex": "They raised over $500 for charity.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "raise money",
                " raise funds",
                " raise capital"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b5ee65ce-5719-4589-b2e0-a91dd8e34e9d.webp",
            "Tips": [
                {
                    "title": "Joint Effort",
                    "description": "To 'raise' funds or resources often involves group effort and collective action.",
                    "example": "The community will raise funds to repair the local school.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0ad1d1e9-bc9a-4861-8ef9-c21912f60344",
            "de": "to care for a child until it is an adult, or to care for an animal or plant until it is fully grown",
            "ty": "verb",
            "ex": "She raised three children on her own.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "raise children",
                " raise animals",
                " raise crops"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0ad1d1e9-bc9a-4861-8ef9-c21912f60344.webp",
            "Tips": [
                {
                    "title": "Long-Term Care",
                    "description": "Using 'raise' in this context suggests ongoing support and development over time.",
                    "example": "Farmers raise livestock with care and attention.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "04bec7ee-d3ee-4cbd-a677-4157efb0265f",
            "de": "to mention something so that it can be discussed",
            "ty": "verb",
            "ex": "I'd like to raise a few points during the meeting.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "raise a point",
                " raise a question",
                " raise an issue"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/04bec7ee-d3ee-4cbd-a677-4157efb0265f.webp",
            "Tips": [
                {
                    "title": "Initiate Discussion",
                    "description": "'Raise' can introduce topics for conversation, implying it's the start of a discussion.",
                    "example": "We should raise the issue of schedule changes with the boss.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Advance": {
            "wordRoot": "Advance",
            "wordDefinition": "Advance means to move forward or progress, like when you advance to the next level in a video game or when you advance in your career.\n\nAdvance is applicable when talking about progress and moving forward, while raise is applicable when talking about increasing or elevating something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dd62f8c2-6bfa-49b4-a865-fc84ae840e0a.webp"
        },
        "Boost": {
            "wordRoot": "Boost",
            "wordDefinition": "Boost and raise can both mean to increase something, but there are some subtle differences in the situations where each is used.\n\nBoost is often used to describe increasing something quickly and dramatically. For example, you might boost your energy level by drinking a cup of coffee.\n\nYou could also say that a company is hoping to boost their profits by launching a new product.\n\nTo summarize: use boost when you want to describe something increasing quickly and dramatically, and use raise when you want to describe a more gradual increase.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6ad872be-a98c-4ee2-b035-a2bafa3c1718.webp"
        },
        "Elevate": {
            "wordRoot": "Elevate",
            "wordDefinition": "The words elevate and raise both mean to lift something up or make it higher, but they are used in slightly different ways.\n\nElevate is more commonly used to refer to lifting something to a higher status or position, such as elevating someone to a leadership position, or elevating one's mood.\n\nIt can also refer to physically raising something to a higher level, such as elevating a building to avoid flooding.\n\nIf you want to talk about lifting something to a higher status or position, use 'elevate.' If you want to talk about physically lifting or increasing something, use 'raise.'",
            "wordImage": "https://word-images.cdn-wordup.com/senses/628dcc5f-84e3-4788-85d3-0a99d2f55f08.webp"
        },
        "Heighten": {
            "wordRoot": "Heighten",
            "wordDefinition": "Heighten means to increase or enhance something, whereas the word raise means to lift something up.\n\nHeighten can describe situations where something is made more intense or amplified, such as heightening emotions or heightening the danger level.\n\nHeighten means to increase something, while raise means to lift something up physically or metaphorically.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1a9584a1-3394-4580-9773-837c6eb589cf.webp"
        },
        "Hoist": {
            "wordRoot": "Hoist",
            "wordDefinition": "Hoist means to lift something heavy upwards using a pulley or other mechanical device. Raise means to lift something upwards using physical force or other means.\n\nFor example, if you wanted to lift a heavy crate to a higher level, you might use a hoist with a rope and pulley system to lift it up.\n\nSo in general, hoist is used when lifting heavy objects with mechanical devices, while raise is used when lifting lighter objects or using physical strength to lift something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/178af284-5bb0-42ff-aa0b-8ad7a7e5bdc7.webp"
        },
        "Increase": {
            "wordRoot": "Increase",
            "wordDefinition": "Both the words increase and raise mean to make something bigger or higher.\n\nIncrease is more often used when talking about quantity or size, such as increasing the number of employees in a company, or increasing the size of a product.\n\nIncrease is used more often for quantity or size, while raise is used more often for value or level.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c06a5283-a561-4bcc-9fcf-126bde18a342.webp"
        },
        "Lift": {
            "wordRoot": "Lift",
            "wordDefinition": "The words lift and raise are similar in meaning, but they have some differences.\n\nLift means to pick something up from a lower position and raise it to a higher position. For example, you lift a box off the ground and place it on a shelf.\n\nRaise means to move something to a higher position or to cause something to be lifted to a higher position. For example, you can raise your hand to answer a question in class.\n\nLift is more about physically moving something while raise is more about bringing something higher, either physically or figuratively.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3d044b6b-d2e7-4120-ad93-d92963d38b84.webp"
        },
        "Promote": {
            "wordRoot": "Promote",
            "wordDefinition": "Promote means to support or publicize something to increase its popularity, awareness and sales. For example, a company may promote its product through advertising, social media or other marketing efforts.\n\nBoth words are applicable in different situations. Promote is applicable in business and marketing, while raise is applicable in personal and financial contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/507dbcb8-9cba-4257-adae-9e3af57bcfcd.webp"
        }
    },
    "videos": [
        {
            "Text": " So you have people who are like caricatures of alphas, really coming into the room, they get right into the middle of the room before class even starts, like they really want to occupy space. When they sit down, they're sort of spread out. They raise their hands like this. You have other people who are virtually collapsing when they come in. As soon they come in, you see it.",
            "Title": "Your body language may...",
            "VideoId": "Ks-_Mh1QhMc",
            "Controls": "start=340"
        },
        {
            "Text": " of prime numbers. So, to accomplish this seemingly impossible task of finding infinite beds for infinite buses of infinite weary travelers, the night manager assigns every current guest to the first prime number, 2, raised to the power of their current room number.",
            "Title": "The Infinite Hotel...",
            "VideoId": "Uj3_KqkI9Zo",
            "Controls": "start=162"
        },
        {
            "Text": " by offering cow petting experiences to tourists. JOHN They raise tiger cubs, so that people can pay money and take selfies, so they have to have this constant supply of these little tiny tiger cubs between one and four months.",
            "Title": "Joe Exotic and the Tiger...",
            "VideoId": "aDfEBgs6h20",
            "Controls": "start=136"
        },
        {
            "Text": " we're that far along there's still one final problem and that's fact-checking we have to fact-check every question makes sense and fact-checking raises so many especial issues all at once I'm gonna handle it using one",
            "Title": "Fact-checking the Bible...",
            "VideoId": "7MnCjpw7iBI",
            "Controls": "start=193"
        },
        {
            "Text": " of a parent who died, and a friend that went too soon, and bad news at the doctor. Death and mortality often live in the shadow of an affair, because they raise these questions. Is this it? Is there more?",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=770"
        },
        {
            "Text": " and success means raising the next generation. To do that here, the wolves must work together. So, the young are raised not only by their parents",
            "Title": "Wolf Pack Hunts A Hare PIPE...",
            "VideoId": "gGludGaPKag",
            "Controls": "start=8"
        },
        {
            "Text": " This raises a few problems. Her lunch is three times her size packed with venom and surrounded by a sticky trap.",
            "Title": "Spider With Three Super...",
            "VideoId": "UDtlvZGmHYk",
            "Controls": "start=63"
        },
        {
            "Text": " a scorching 70 centigrade the ants long legs raise their bodies above the",
            "Title": "BBC Earth 50 Top Natural...",
            "VideoId": "a6roH6RffnA",
            "Controls": "start=288"
        },
        {
            "Text": " this raises a few problems her lunch is three times her size",
            "Title": "Best Scenes From The...",
            "VideoId": "41hj6w_QLZs",
            "Controls": "start=738"
        },
        {
            "Text": " but soon one spotted us and he raised the alarm",
            "Title": "Zoo Quest For A Dragon...",
            "VideoId": "omKm7jOkbcg",
            "Controls": "start=256"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/betty-white.webp",
            "Text": "I had to make a major decision with myself because I just don't think you can do both: try to have a baby career and raise it and have a baby baby and raise it. And to try to do justice to either one. It was a very conscious decision on my part not to have children - which I have never regretted.",
            "Title": "American Actress",
            "Name": "Betty White"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/chuck-palahniuk.webp",
            "Text": "As a lower-class kid, I was raised to think success would be owning stuff. Having that great job, too. Now I find my parents' dream was wrong. You never really own anything. And you're never really finished as a person.",
            "Title": "American Novelist",
            "Name": "Chuck Palahniuk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erma-bombeck.webp",
            "Text": "One thing they never tell you about child raising is that for the rest of your life, at the drop of a hat, you are expected to know your child's name and how old he or she is.",
            "Title": "American Journalist",
            "Name": "Erma Bombeck"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ben-carson.webp",
            "Text": "Well, I say that the most important job you can possibly have is raising a child, and it needs to be treated that way. You have to show them, rather than just talk to them.",
            "Title": "American Scientist",
            "Name": "Ben Carson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "I will cut taxes - cut taxes - for 95 percent of all working families, because, in an economy like this, the last thing we should do is raise taxes on the middle class.",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tyler-perry.webp",
            "Text": "I think it's important to show a husband and a wife together, in a room, raising children, because you don't see that anymore.",
            "Title": "American Actor",
            "Name": "Tyler Perry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/toni-morrison.webp",
            "Text": "You need a whole community to raise a child. I have raised two children, alone.",
            "Title": "American Novelist",
            "Name": "Toni Morrison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/p-j-orourke.webp",
            "Text": "Everybody knows how to raise children, except the people who have them.",
            "Title": "American Comedian",
            "Name": "P. J. O'Rourke"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steven-wright.webp",
            "Text": "All those who believe in psychokinesis - raise my hand.",
            "Title": "American Comedian",
            "Name": "Steven Wright"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/floyd-mayweather-jr.webp",
            "Text": "I basically raised myself.",
            "Title": "American Boxer",
            "Name": "Floyd Mayweather, Jr."
        }
    ]
}