{
    "currentWord": {
        "wordRoot": "recognition",
        "id": 22780,
        "phonemic": "ˌrekəɡˈnɪʃn|ˌrekəɡˈnɪʃn\r",
        "bigId": "2ab4e926-f69a-402b-82f0-9d5eeb9750ca",
        "wordForms": [
            "recognitions",
            "recognition"
        ]
    },
    "senses": [
        {
            "id": "2ab4e926-f69a-402b-82f0-9d5eeb9750ca",
            "de": "The act of identifying or acknowledging someone or something",
            "ty": "noun",
            "ex": "My forgetfulness often prevents me from achieving quick recognition of old friends.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "recognition of rights",
                " recognition of an individual",
                " recognition of achievements"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/2ab4e926-f69a-402b-82f0-9d5eeb9750ca.webp",
            "Tips": [
                {
                    "title": "Social Context",
                    "description": "Use when you suddenly realize who someone is or remember something.",
                    "example": "It took me a moment, but then I had a flash of recognition.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/S0x7n4I6qD0mUqzkNlqotx8ukhU.webp"
                },
                {
                    "title": "Not Just Visual",
                    "description": "Recognition can be through any senses, like recognizing a voice on the phone.",
                    "example": "I heard laughter and, with instant recognition, knew it was my brother.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/gCRcw0hX8URFuTR0j45aSXsiRE0.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "10beb989-a575-434a-b047-f740da981320",
            "de": "The appreciation or acknowledgement of the good quality or value of someone or something",
            "ty": "noun",
            "ex": "He received an award in recognition of his bravery.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "in recognition of",
                " recognition for contributions",
                " award for recognition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/10beb989-a575-434a-b047-f740da981320.webp",
            "Tips": [
                {
                    "title": "Positive Connotation",
                    "description": "Often used when someone's efforts are formally acknowledged and valued.",
                    "example": "Her work with the homeless did not go without recognition from the community.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Motivational",
                    "description": "Being given recognition can motivate people to keep up good work.",
                    "example": "The students were given recognition for their academic performance.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "a727e6fa-1f2e-4842-8c09-9d392ab9471a",
            "de": "The formal acknowledgement that a country or government exists and is valid",
            "do": "Diplomacy",
            "ty": "noun",
            "ex": "The US gave formal recognition to the new government.",
            "use": "",
            "co": "Technical",
            "re": "",
            "tp": "",
            "cl": [
                "diplomatic recognition",
                " formal recognition",
                " international recognition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a727e6fa-1f2e-4842-8c09-9d392ab9471a.webp",
            "Tips": [
                {
                    "title": "Political Importance",
                    "description": "Recognition confirms legitimacy and can affect international relations.",
                    "example": "The recognition of the new country was an important milestone in its history.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Positive",
                    "description": "Recognition doesn't mean approval, but simply acknowledgment of existence.",
                    "example": "The government's recognition of the rebel group as a belligerent party changed the dynamics.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "cb2dba2e-4e6a-49aa-93c9-f9c29505caf9",
            "de": "The ability of a machine or computer program to identify and respond to images, sounds, or patterns",
            "do": "Computing",
            "ty": "noun",
            "ex": "Voice recognition software can transcribe spoken words into written text.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "voice recognition",
                " facial recognition",
                " pattern recognition"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cb2dba2e-4e6a-49aa-93c9-f9c29505caf9.webp",
            "Tips": [
                {
                    "title": "Technology Advancement",
                    "description": "Indicates an advanced level of technology with human-like understanding abilities.",
                    "example": "Facial recognition systems are becoming increasingly adept at identifying individuals.\r",
                    "imageUrl": ""
                },
                {
                    "title": "User Interface",
                    "description": "Used for user-friendly technology that interacts in intuitive ways.",
                    "example": "Smart homes that use voice recognition can adjust the lighting and temperature just by speaking.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Appreciate": {
            "wordRoot": "Appreciate",
            "wordDefinition": "Appreciate means to value and admire something or someone. It is applicable in situations where we want to express our gratitude or acknowledge the worth of something or someone.\n\nAppreciate is used when we want to express our admiration or gratitude while recognition is used when we want to acknowledge someone for their hard work or achievements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f4aba09c-a6e1-4456-bb59-9cf9236d3bef.webp"
        },
        "Approval": {
            "wordRoot": "Approval",
            "wordDefinition": "Approval and recognition are two different words with different meanings.\n\nApproval refers to the act of agreeing or accepting something, usually after careful consideration or evaluation. It means giving permission and support to something or someone.\n\nFor example, a parent may give their approval to their child's decision to attend a particular college.\n\nApproval is applicable when someone needs permission or support for something, while recognition is applicable when someone needs appreciation or acknowledgment for their achievements or contributions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/91260363-e40f-4c23-a519-8bfabd2f9bbe.webp"
        },
        "Commendation": {
            "wordRoot": "Commendation",
            "wordDefinition": "Commendation means to praise or approve someone's actions or behavior.\n\nIt is usually given as a result of doing something exceptional, praiseworthy, or beyond what is expected. For example, a soldier may receive a commendation for bravery during battle.\n\nCommendation is given for exceptional actions or behavior, while recognition is given for noteworthy contributions or achievements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/226e9f66-909b-4665-ae70-31d5a1898d52.webp"
        },
        "Credit": {
            "wordRoot": "Credit",
            "wordDefinition": "Credit refers to acknowledging or giving recognition to someone for their work, effort or contribution. This recognition often takes the form of giving praise, acknowledgement or reward to someone who has done something admirable or noteworthy.\n\nCredit is usually given in a formal or official capacity, such as in an academic or professional setting, such as school or work.\n\nCredit is a more specific term that refers to acknowledging someone's specific accomplishments or contributions, while recognition is a broader term that refers to acknowledging or noticing someone or something in general.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8ebad859-db91-4f7d-8fd5-686c2f5dcabb.webp"
        },
        "Esteem": {
            "wordRoot": "Esteem",
            "wordDefinition": "Esteem refers to the respect and admiration one has for someone or something.\n\nIt is used when talking about the high regard one has for a person's qualities or achievements. For instance, a person might have esteem for their parents, teachers, or friends, based on their individual characteristics.\n\nEsteem is a positive feeling one has toward someone or something, while recognition is the act of acknowledging someone for their effort or accomplishments.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/caec7e06-36eb-4ff0-bf04-af2991b969b0.webp"
        },
        "Honour": {
            "wordRoot": "Honour",
            "wordDefinition": "Honour and recognition are both words used to describe giving someone credit for their achievements or character.\n\nHonour describes respect and admiration given to someone who has demonstrated their worthiness, often by displaying virtues such as bravery, honesty, or loyalty.\n\nHonour can also refer to a sense of personal pride or integrity that somebody displays in their actions.\n\nHonour is more specific and refers to a specific set of qualities or actions, while recognition is a broader term that can encompass a range of achievements and attributes.\n\nBoth honour and recognition are important ways of showing appreciation and acknowledging someone's worth, and can be applied in a variety of contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dfacdcdf-7111-41ce-bfc1-2d66e994f438.webp"
        },
        "Notice": {
            "wordRoot": "Notice",
            "wordDefinition": "Both notice and recognition refer to the act of acknowledging something or someone. Notice usually means realizing the presence or existence of something, while recognition refers to identifying something or someone and acknowledging its/their value or significance.\n\nFor instance, if you see a new poster on your bedroom wall, you might notice it, meaning you become aware that it's there.\n\nSimilarly, you might notice a person you've never met before in the hallway at school, simply because they cross your path.\n\nNotice is used more for objective observations, while recognition includes a subjective element of value or familiarity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8caa6575-1d3f-490d-b765-e78c67448dd4.webp"
        },
        "Tribute": {
            "wordRoot": "Tribute",
            "wordDefinition": "Tribute refers to an expression of respect, admiration, or gratitude towards someone or something.\n\nIt is often applicable in more informal or personal settings, such as memorials, funerals, or personal speeches. For example, a tribute may be made to a loved one who passed away, to a military hero, or to a cultural icon.\n\nRecognition is a formal acknowledgement of achievement or contribution, while tribute is a more personal expression of respect or gratitude.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4079300a-e9c8-43e9-b9cb-a70eda831e60.webp"
        }
    },
    "videos": [
        {
            "Text": " first look at the general face. So you recognize Obama immediately. And then you notice something quite a little bit odd about the eyes and the mouth. Especially when they're upside down, you're engaging that general facial recognition software there. Now I said back in our little thought experiment,",
            "Title": "The pattern behind...",
            "VideoId": "b_6-iVz1R0o",
            "Controls": "start=799"
        },
        {
            "Text": " pronouns we aren't conscious of this stuff but it has a huge influence on how we impact an audience what's exciting and new here is we can use technology like natural language processing phonetic analysis and facial and gesture recognition to make sense of these unconscious signals and give people",
            "Title": "How visionary leaders...",
            "VideoId": "o25c5wRvPnI",
            "Controls": "start=102"
        },
        {
            "Text": " Social media companies are considering using algorithms to help prevent suicides by flagging posts that contain specific words or phrases. And emotion recognition software can help treat mental disorders or even provide people with low-cost automated psychotherapy. Despite the potential benefits,",
            "Title": "Can machines read your...",
            "VideoId": "QFk3e5PcK7s",
            "Controls": "start=185"
        },
        {
            "Text": " to inauguration day. But I want to say to you, I will support the winner of a free and fair election no matter which candidate wins, and I will oppose any so-called winner who prevails by twisting the process beyond recognition.",
            "Title": "What if a US presidential...",
            "VideoId": "WZWRhLW7Y8w",
            "Controls": "start=952"
        },
        {
            "Text": " I'm not against progress. I want the driverless car and the jet pack just like everyone else. But I'm pleading for recognition that with increased wealth and profits has to come greater corporate social responsibility.",
            "Title": "Paul Tudor Jones II: Why...",
            "VideoId": "dvJSK4viVMs",
            "Controls": "start=509"
        },
        {
            "Text": " As a result, the hero claims some treasure, special recognition, or power. Result This can vary between stories. Do the monsters bow down before the hero, or do they chase him as he flees from the special world?",
            "Title": "What makes a hero? -...",
            "VideoId": "Hhk4N9A0oCA",
            "Controls": "start=120"
        },
        {
            "Text": " without engaging with all of the stories of that place and that person. The consequence of the single story is It robs people of dignity. It makes our recognition of our equal humanity difficult.",
            "Title": "Chimamanda Ngozi...",
            "VideoId": "D9Ihs241zeg",
            "Controls": "start=828"
        },
        {
            "Text": " And this is especially new and true for spatial recognition -- so like, how you navigate your way in the city. We are still learning a lot, and neurons are not only important for memory capacity,",
            "Title": "You can grow new brain...",
            "VideoId": "B_tjKYvEziI",
            "Controls": "start=193"
        },
        {
            "Text": " it feels fitting that this is now a UNESCO World Heritage Site. For me, it's a recognition that abandoned places like this matter to wildlife, but also to us.",
            "Title": "Spotting the World's...",
            "VideoId": "2gUJYq_yI5g",
            "Controls": "start=1061"
        },
        {
            "Text": " in recognition of all you've done the people of the world hereby crown you queen also make sure the world only sees the aretha franklin you want them to",
            "Title": "Genius: Aretha Chain of...",
            "VideoId": "ryGpdVuuq_Y",
            "Controls": "start=36"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jodhi-may.webp",
            "Text": "As an actor, I think it's really important to be as anonymous as possible. It's your job to convince people that you are somebody else, and so any recognition I'd get away from the screen - well, it's not something I actively seek. To be honest with you, I'm surprised anybody does.",
            "Title": "English Actress",
            "Name": "Jodhi May"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jim-beaver.webp",
            "Text": "After appearing for eight seasons as a beloved character on 'Supernatural,' it's not surprising that I get most of my recognition on the street from that, and it happens with some frequency. But I'm not a guy who gets recognized often.",
            "Title": "American Actor",
            "Name": "Jim Beaver"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-levine.webp",
            "Text": "Women tend to have recognition and peer group support - recognition from friends and family that this has to be a big issue in their lives. They're more comfortable expressing the need for support and receiving it.",
            "Title": "American Musician",
            "Name": "James Levine"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/goldie.webp",
            "Text": "From where I've come from, I look back at everything, all these people that influenced my life as a kid growing up in a really bad environment, it just makes it all worthwhile in terms of the recognition.",
            "Title": "British Musician",
            "Name": "Goldie"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yance-ford.webp",
            "Text": "What little return documentary filmmakers get often comes in the form of recognition by their peers and the critics who influence doc audiences around the country.",
            "Title": "American Director",
            "Name": "Yance Ford"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nick-woodman.webp",
            "Text": "If I'm a content creator, and I get recognition for my work, that's going to motivate me to spend even more time on my next production and make it even better.",
            "Title": "American Businessman",
            "Name": "Nick Woodman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-mcginn.webp",
            "Text": "It's always nice to be getting personal recognition, but I wouldn't be getting it if it wasn't for the help of my team-mates and the backroom staff.",
            "Title": "Scottish Athlete",
            "Name": "John McGinn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hugh-hefner.webp",
            "Text": "Creating my own world in a comic or selling my first penny newspaper aged nine was a way of gaining recognition and acceptance by my peers.",
            "Title": "American Publisher",
            "Name": "Hugh Hefner"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ileana-dcruz.webp",
            "Text": "I am being selfish here by saying this, but I believe 'Barfi!' helped me the most. It got me recognition and respect.",
            "Title": "Indian Actress",
            "Name": "Ileana D'Cruz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/candace-bushnell.webp",
            "Text": "You need characters who want things. They want love, they want recognition, they want happiness.",
            "Title": "American Writer",
            "Name": "Candace Bushnell"
        }
    ]
}