{
    "currentWord": {
        "wordRoot": "rectify",
        "id": 14826,
        "phonemic": "ˈrektɪfaɪ|ˈrektɪfaɪ\r",
        "bigId": "cbe9d4de-654c-4773-b097-f777f6427e7b",
        "wordForms": [
            "rectifies",
            "rectifying",
            "rectified",
            "rectify"
        ]
    },
    "senses": [
        {
            "id": "cbe9d4de-654c-4773-b097-f777f6427e7b",
            "de": "To fix something that is wrong",
            "ty": "verb",
            "ex": "He had to rectify the errors on his application form.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "rectify a mistake",
                " rectify a problem",
                " rectify an issue"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cbe9d4de-654c-4773-b097-f777f6427e7b.webp",
            "Tips": [
                {
                    "title": "Action Required",
                    "description": "Use 'rectify' when action is needed to correct a situation or error.",
                    "example": "They must rectify the billing issues immediately.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/06wcDZNyld3sWv8XRJsLUjy4E0I.webp"
                },
                {
                    "title": "Taking Responsibility",
                    "description": "Using 'rectify' often implies acknowledging a mistake and taking steps to make it right.",
                    "example": "The company promised to rectify the mistake.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/dYRvmXujiWzLCn3hXr9o6QO8rM.webp"
                },
                {
                    "title": "Positive Outcome",
                    "description": "'Rectify' suggests a resolution that will lead to a positive outcome.",
                    "example": "She rectified the misunderstanding with a thorough explanation.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/f0Dccb6Cda7U7pIy0hColFs1PgY.webp"
                }
            ]
        },
        {
            "id": "7c0140bd-aafc-44b0-9a62-393fc7e86e51",
            "de": "To correct behavior or attitude",
            "ty": "verb",
            "ex": "She must rectify her lazy habits if she wants to succeed.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "rectify behavior",
                " rectify attitude",
                " rectify bad habits"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7c0140bd-aafc-44b0-9a62-393fc7e86e51.webp",
            "Tips": [
                {
                    "title": "Behavioral Change",
                    "description": "'Rectify' indicates a change in one's actions or habits for the better.",
                    "example": "He rectified his work ethic to achieve higher grades.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Self-Improvement",
                    "description": "'Rectify' in personal context hints at self-improvement and personal development.",
                    "example": "I decided to rectify my tardiness by waking up earlier.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6d22280b-1e0b-4588-80e8-3b9b387b1cde",
            "de": "To purify alcohol by distillation",
            "do": "Chemistry",
            "ty": "verb",
            "ex": "The process of distillation is used to rectify the alcohol.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6d22280b-1e0b-4588-80e8-3b9b387b1cde.webp",
            "Tips": [
                {
                    "title": "Technical Context",
                    "description": "In chemistry, 'rectify' is technical jargon for a specific process.",
                    "example": "The laboratory technician will rectify the sample tomorrow.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Precision Required",
                    "description": "Using 'rectify' accurately in chemistry shows precision in language and understanding of the process.",
                    "example": "Careful measurements are essential to rectify the solution properly.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Adjust": {
            "wordRoot": "Adjust",
            "wordDefinition": "Adjust means to make a small change to something to make it fit or work better in a situation. For example, you might adjust the volume on your TV to make it louder or softer.\n\nAdjust applies to making small changes to improve something, while rectify is used for fixing big mistakes or problems.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4fe62a2b-845e-48f3-84fa-15ae0a8b0a2a.webp"
        },
        "Amend": {
            "wordRoot": "Amend",
            "wordDefinition": "Amend means to make changes or corrections to something that is wrong or mistaken, in order to improve it. For example, you might amend a document or a law that has errors or inconsistencies in it.\n\nSo, in simple terms, amend is used when you need to change something that is wrong or incorrect, whereas rectify is used when you need to fix something that has gone wrong or been done incorrectly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c1827fc1-cc32-49ca-93d3-7e861a97945d.webp"
        },
        "Correct": {
            "wordRoot": "Correct",
            "wordDefinition": "Correct means to fix something that is wrong or incorrect. For example, if your math teacher showed you the wrong formula for a problem and you corrected it, you fixed the mistake.\n\nIt's a stronger word than \"correct.\" For example, if someone was unfairly accused of a crime and was imprisoned for years, and later evidence proves they are innocent, then the government should rectify the situation by compensating the individual and making sure it doesn't happen again.\n\nSo, while correct is used to fix small mistakes, rectify is used for bigger issues that involve injustice or wrongful actions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8da0e1dc-72d8-489a-a023-b7e783501afa.webp"
        },
        "Fix": {
            "wordRoot": "Fix",
            "wordDefinition": "Fix means to correct or repair something that is broken or not working properly.\n\nFor example, if your phone screen is cracked, you would say \"I need to fix my phone.\" But if there is an incorrect data entry in a spreadsheet, you would say \"I need to rectify the data in the spreadsheet.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cdfdb58a-e818-4909-be8f-695125973401.webp"
        },
        "Make good": {
            "wordRoot": "Make good",
            "wordDefinition": "The words make good and rectify both mean to fix or correct something that is wrong, but they are used in slightly different situations.\n\nMake good is often used when someone wants to repair or replace something that is broken or damaged. For example, if someone breaks a vase, they might say \"I'll make good and buy you a new one.\".\n\nIt can also be used more figuratively to mean that someone will fulfill a promise or obligation. For example, if someone promises to pay back a loan, they might say \"I'll make good on my promise and pay you back.\".\n\nIt can be used in a broader sense than make good, since it doesn't necessarily imply that something was broken or damaged to begin with.\n\nFor example, if someone makes an error in a report, they might say \"I'll rectify the mistake and resend the report.\"\n\nMake good is usually used to repair or replace something that is damaged, while rectify is used to correct a mistake or problem, regardless of whether something is broken or damaged.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8ae5abf5-4103-42a5-9678-a7cdab575739.webp"
        },
        "Remedy": {
            "wordRoot": "Remedy",
            "wordDefinition": "Rectify and remedy are both verbs that mean to fix or solve a problem, but they have some differences.\n\nRemedy usually means to solve a problem or improve a situation by taking action. For example, if you are feeling sick, you might take medicine to remedy the situation.\n\nSo, while both words refer to fixing a problem, rectify usually refers to fixing something specific that was done wrong, while remedy refers to solving a problem or making a situation better.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f28e1125-daa2-4e1f-bedc-ce7b51d4d840.webp"
        },
        "Repair": {
            "wordRoot": "Repair",
            "wordDefinition": "Repair means to fix something that is broken or damaged. It is applicable when something has been damaged physically and needs to be fixed.\n\nBut, if you drop your phone and the screen breaks, you need to take it to a technician to repair it.\n\nTo sum it up, rectify is used for correcting a mistake or a problem while repair is used for fixing something that is broken.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9881b1cf-04ed-4bcc-a19b-e250867e8f28.webp"
        }
    },
    "videos": [
        {
            "Text": " like we can see what happens on land. But unfortunately, the ocean is opaque, and we can't see what's going on. And therefore we're way behind on protection. But scuba diving, submersibles and all the work that we're setting about to do here will help rectify that.",
            "Title": "Greg Stone: Saving the...",
            "VideoId": "ZuCtZJGcEMU",
            "Controls": "start=180"
        },
        {
            "Text": " not only do we share the pain of others, and believe in something bigger than ourselves but we have a duty to act when we see things that are wrong that need righted, see injuries that need to be corrected, see problems that need to be rectified.",
            "Title": "Wiring a web for global...",
            "VideoId": "y7rrJAC84FA",
            "Controls": "start=146"
        },
        {
            "Text": " an unprecedented wealth gap in the country today between the rich and the poor and it's made our citizenry angry as divided in our country the stock market recently has done a pretty good job of rectifying this by pushing the helm from the top",
            "Title": "America’s most just...",
            "VideoId": "5vucpGk46DU",
            "Controls": "start=40"
        },
        {
            "Text": " Because if architecture is what I believe it to be, which is the built form of our cultural ambitions, what do you do when presented with an opportunity to rectify a situation that represents somebody else's cultural ambitions relative to us?",
            "Title": "Reed Kroloff:...",
            "VideoId": "H682jmofwZs",
            "Controls": "start=115"
        },
        {
            "Text": " between the desire that we have to express ourselves and the number of sympathetic friends who are willing to stand around and listen. This, also, is nothing new. Since the dawn of human history, we've tried to rectify this imbalance",
            "Title": "Jonathan Harris: The...",
            "VideoId": "zAvNlh2Z0GI",
            "Controls": "start=103"
        },
        {
            "Text": " like the Ted speakers donate generously for free their conclusion of the research their passion of life to the rest of the world and I found a way to rectify to amplify their message through translation so I",
            "Title": "Inspiring generosity and...",
            "VideoId": "12Z_qZKzsCk",
            "Controls": "start=115"
        },
        {
            "Text": " and he became a Jesuit priest. He burned all his poetry at the age of 24 and then did not write another poem for at least seven years because he couldn't rectify the life of a poet with the life of a priest.",
            "Title": "Natalie Merchant sings...",
            "VideoId": "vXVCf5VTHrw",
            "Controls": "start=999"
        },
        {
            "Text": " south from where we are I look at that you can see that this cat is still feeding here and thank you very very much to all the viewers who rectified my wrong identification as this is not thing Ghana",
            "Title": "Safari Live - Day 234 PIPE...",
            "VideoId": "f4LocTPWkC4",
            "Controls": "start=680"
        },
        {
            "Text": " least to the Lions if we do not come right with these cheetahs you know what else we didn't use to have signal in this area when I was last here and that was all rectified during our",
            "Title": "Safari Live - Day 253 PIPE...",
            "VideoId": "OGC1eSL08JE",
            "Controls": "start=2032"
        },
        {
            "Text": " Contamination is occurring. I care about conservation Rectifying something that us as humans are contributing towards in",
            "Title": "Illegal Marijuana Farms...",
            "VideoId": "8h4jCrHIY1I",
            "Controls": "start=496"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/letitia-james.webp",
            "Text": "On the local, state and federal level, government is working alongside veteran's organizations and other stakeholders to provide services such as medical assistance, employment resources, and housing support to veterans and their dependents and survivors. But there are still gaps in services that must be rectified.",
            "Title": "American Public Servant",
            "Name": "Letitia James"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ravi-subramanian.webp",
            "Text": "After my first book, many of my readers came back to tell me that the female characters I had created were not strong enough. I have consciously rectified that in my next four books. In any case, it's true that women run the world, and men would do better to listen to them!",
            "Title": "Indian Author",
            "Name": "Ravi Subramanian"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ivanka-trump.webp",
            "Text": "Mis-hiring is a huge mistake. It's a tremendous opportunity cost throwing the position to the wrong person. It's often something that isn't rectified for a long period of time.",
            "Title": "American Businesswoman",
            "Name": "Ivanka Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/simon-pegg.webp",
            "Text": "We work with every one of them to see if their character wouldn't say a certain thing or if something is worded awkwardly - we work with them to rectify that.",
            "Title": "British Comedian",
            "Name": "Simon Pegg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/enda-kenny.webp",
            "Text": "My job is to rectify the public finances and hand the country back to the people so they can really have a future, and that is what I will do.",
            "Title": "Irish Politician",
            "Name": "Enda Kenny"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gulzar.webp",
            "Text": "In films, there is no scope to rectify any mistake... but in theatre, you can rectify it the next day.",
            "Title": "Indian Poet",
            "Name": "Gulzar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jalal-talabani.webp",
            "Text": "The justice of our cause must be reflected in the manner in which we rectify the crimes of the past.",
            "Title": "Iraqi Politician",
            "Name": "Jalal Talabani"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joaquin-phoenix.webp",
            "Text": "The reason I keep making movies is I hate the last thing I did. I'm trying to rectify my wrongs.",
            "Title": "American Actor",
            "Name": "Joaquin Phoenix"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josephus-daniels.webp",
            "Text": "Army: A body of men assembled to rectify the mistakes of the diplomats.",
            "Title": "American Politician",
            "Name": "Josephus Daniels"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sadiq-khan.webp",
            "Text": "Legal aid is central to righting wrongs and rectifying injustice.",
            "Title": "British Politician",
            "Name": "Sadiq Khan"
        }
    ]
}