{
    "currentWord": {
        "wordRoot": "recur",
        "id": 15526,
        "phonemic": "rɪˈkɜː(r)|rɪˈkɜːr\r",
        "bigId": "bc4ba307-b892-4cfe-ae73-29bc22fd1ca7",
        "wordForms": [
            "recurs",
            "recurring",
            "recurred",
            "recur"
        ]
    },
    "senses": [
        {
            "id": "bc4ba307-b892-4cfe-ae73-29bc22fd1ca7",
            "de": "To happen or occur again and again",
            "ty": "verb",
            "ex": "These issues recur frequently in his work.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "recur frequently",
                " recur in someone's work",
                " recur regularly"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/bc4ba307-b892-4cfe-ae73-29bc22fd1ca7.webp",
            "Tips": [
                {
                    "title": "Frequent Events",
                    "description": "Use 'recur' to describe events that happen often over a period of time.",
                    "example": "The meetings recur weekly.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/RZBwFQMSYLlKqDUrPiyAMT9wwCo.webp"
                },
                {
                    "title": "Negative Situations",
                    "description": "Often used to describe undesirable events or problems that keep coming up.",
                    "example": "The software bug recurred despite the fixes.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/z4QJWgXCU1XYiwtnmiBeHLEgXto.webp"
                },
                {
                    "title": "Avoid 'Again'",
                    "description": "'Recur' already implies repetition, so avoid saying 'recur again' as it is redundant.",
                    "example": "The symptoms recurred after treatment.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/C0JMN00ZVdFkzNnBNGTgRLChm5c.webp"
                }
            ]
        },
        {
            "id": "d755aa25-bbc2-45ad-9057-03e98f92f05b",
            "de": "To return to one's mind",
            "ty": "verb",
            "ex": "The thought kept recurring to him.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "recur to mind",
                " recur in thoughts",
                " recur in dreams"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d755aa25-bbc2-45ad-9057-03e98f92f05b.webp",
            "Tips": [
                {
                    "title": "Mental Return",
                    "description": "Use 'recur' when a thought or feeling keeps coming back to your mind.",
                    "example": "The memory of that day kept recurring to her.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Involuntary Nature",
                    "description": "The return of thoughts or memories is often out of one's control, implied by 'recur'.",
                    "example": "Despite trying to forget, the melody recurred in his mind.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Unsettling Feelings",
                    "description": "Can suggest the persistence of unwanted thoughts or dreams that trouble someone.",
                    "example": "The nightmare recurred, leaving her unsettled each morning.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "536ac035-7cbc-4856-b594-cc77be43731d",
            "de": "To return to a previous part or form",
            "ty": "verb",
            "ex": "We recur to the postulation of an ultimate creator.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "recur to basics",
                " recur to original state",
                " recur to previous chapter"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/536ac035-7cbc-4856-b594-cc77be43731d.webp",
            "Tips": [
                {
                    "title": "Historical Reference",
                    "description": "'Recur' can be used when discussing returning to past traditions or practices.",
                    "example": "The community decided to recur to its ancestral customs.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Back to Origins",
                    "description": "Can indicate going back to the original state or to the beginnings of something.",
                    "example": "The debate recurrently recurred to the founding principles.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Appear": {
            "wordRoot": "Appear",
            "wordDefinition": "Appear means to show up or become visible for the first time, while the word recur means to happen or appear again, often repeatedly.\n\nAppear is applicable in situations when something is happening for the first time, and recur is applicable when something is happening repeatedly or happening again.\n\nFor example, if a new student joins a school, they will appear in the classroom for the first time, but if a student gets sick often during the school year, their illness will recur.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8d901efd-cdde-46cf-9dc2-8e775fe43f2c.webp"
        },
        "Come back": {
            "wordRoot": "Come back",
            "wordDefinition": "The words come back mean to return to a place or situation that you were in before. It's used for situations where you physically return to a place or resume an action or behavior that you've previously engaged in.\n\nCome back is used for a physical return to something, while recur is used for something that happens repeatedly, even if it's not a physical object or action.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6f190429-c565-4c0b-8c61-eb4a3455c002.webp"
        },
        "Recurrence": {
            "wordRoot": "Recurrence",
            "wordDefinition": "Recurrence refers to the act of something happening again or the fact of something occurring repeatedly. For example, if there is a recurrence of a disease, it means the disease has come back or happened again.\n\nRecur is the action or the verb while recurrence is the name or noun of what's happening.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d6afdd6d-645f-46e3-9617-3fd402c5abdd.webp"
        },
        "Repeat": {
            "wordRoot": "Repeat",
            "wordDefinition": "Recur means to occur again, repeatedly or periodically. It usually refers to events or situations that happen again and again in a regular pattern.\n\nRepeat means to do or say something again, or to replicate an action, word or event.\n\nThis word refers to a singular action that is done again. For example, washing the dishes after dinner, reciting a sentence to memorize it or playing a song that one has already played before can all be classified as repeating.\n\nRecur refers to things that happen again and again at regular intervals, while repeat refers to doing or saying something once again.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bc5dc06b-a091-4e18-ac48-729c4a97e8a6.webp"
        },
        "Return": {
            "wordRoot": "Return",
            "wordDefinition": "Return means to come back to a place or to give back something that was borrowed or taken.\n\nFor example, \"I will return home after the party.\" \"Please return the book to the library.\"\n\nRecur is used when something keeps happening again and again, while return is used when we come back to a place or give something back to its original owner.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e2a954d7-5bb5-42c7-88bb-921405699b24.webp"
        }
    },
    "videos": [
        {
            "Text": " because I don't really like bugs. I think, does anybody ever feel like this? Like if you have an intense dislike of something and then it seems to recur over and over in your life. Mine's like bugs and snakes and spiders and-- I must have come across five different snakes on the trek. And this was the first one that I almost stepped on",
            "Title": "Climbing Asia’s...",
            "VideoId": "K32MfIcUFd8",
            "Controls": "start=673"
        },
        {
            "Text": " where doctors and surgeons, as they take away a tumor, they actually know what to take out, and they no longer have to guess with their thumb. Now, here's why it's extremely important to take those tiny little leftover tumors. Those leftover tumors, even if it's just a handful of cells, they will grow to recur the tumor,",
            "Title": "We can start winning the...",
            "VideoId": "1S9RVl1d-l4",
            "Controls": "start=640"
        },
        {
            "Text": " Well, it might be because change, even really positive change, involves a surprising amount of loss. Loss of the familiar. Even if the familiar is unpleasant or utterly miserable, at least we know the characters and setting and plot, right down to the recurring dialogue in this story. \"You never do the laundry!\"",
            "Title": "How changing your story...",
            "VideoId": "O_MQr4lHm0c",
            "Controls": "start=426"
        },
        {
            "Text": " I learned that manual labor really sucks. Right, like cutting lawns is brutal. But because I had to cut lawns all summer for all of our neighbors and get paid to do that, I realized that recurring revenue from one client is amazing, that if I land this client once, and every week I get paid by that person,",
            "Title": "Cameron Herold: Let's...",
            "VideoId": "nx3GuO41Jyg",
            "Controls": "start=618"
        },
        {
            "Text": " and I've tried to give just some sense of how they're retold by each generation with just slight variations to fit the fashions of the day. And the fact that they recur in this way, in such a similar form but in such different belief systems, suggests, I think, that we should be skeptical of the truth",
            "Title": "The 4 stories we tell...",
            "VideoId": "PB7xs7UpIfY",
            "Controls": "start=702"
        },
        {
            "Text": " development specialists, architects and civic activists, and a number of recurring principles keep coming out. I just want to pass on six. cities need a plan and a strategy to implement it. I mean, it sounds crazy, but the vast majority of world cities don't actually have a plan",
            "Title": "The biggest risks facing...",
            "VideoId": "Sv5QitqbxJw",
            "Controls": "start=660"
        },
        {
            "Text": " but left instead to the dark depths of our imagination. Lovecraft’s dozens of short stories, novellas, and poems often take place in the same fictional continuity, with recurring characters, locations, and mythologies. At first glance,",
            "Title": "Titan of terror: the...",
            "VideoId": "3M3L4VIZv-U",
            "Controls": "start=105"
        },
        {
            "Text": " really that significant does it have any impact on our life on Earth the moon has influenced human activities in so many ways people have been looking up to the moon and realizing that it has a recurring pattern resister been using",
            "Title": "How The Moon Affects Our...",
            "VideoId": "jXPiQ0dDXkI",
            "Controls": "start=223"
        },
        {
            "Text": " have an idea let's start a moonshot movement now let's students have a moonshot Friday every week once week in every school everywhere a regular recurring makers fair like environment where they can create and do",
            "Title": "Give kids the chance to...",
            "VideoId": "J12qtbuW-xw",
            "Controls": "start=393"
        },
        {
            "Text": " and a different outlook than leadership forged in peace. And so my answer would be the leadership has got to come from below, not from above. I mean, a recurring theme of the conference this week",
            "Title": "The refugee crisis is a...",
            "VideoId": "PgCmT0qkfQM",
            "Controls": "start=1058"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/seth-gabel.webp",
            "Text": "I was always prepared for my 'Fringe' journey to end immediately. I had only signed up for a guest role but they kept bringing me back in the third season as a recurring character. So pretty much every time I went to film a 'Fringe' episode I kind of said goodbye to the show, but then they kept bringing me back.",
            "Title": "American Actor",
            "Name": "Seth Gabel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kate-burton.webp",
            "Text": "I recurred on 'Grey's Anatomy' for three years, and at the same time, I recurred for eight episodes on 'Rescue Me'. And I'd recurred for nine episodes on 'The Practice'. Frankly, the guest star is often the most compelling character.",
            "Title": "Welsh Actress",
            "Name": "Kate Burton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/w-s-merwin.webp",
            "Text": "As a child, I used to have a secret dread - and a recurring nightmare - of the whole world becoming city, being covered with cement and buildings and streets. No more country. No more woods.",
            "Title": "American Poet",
            "Name": "W. S. Merwin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barbie-ferreira.webp",
            "Text": "I used to have a recurring black-and-white dream where I would drive in on a hover car and raid the shoe closets of this huge mansion. I don't know what that means at all, to be honest.",
            "Title": "American Model",
            "Name": "Barbie Ferreira"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sara-zarr.webp",
            "Text": "I tend to describe recurring themes as being part of a writer's DNA - something so deeply embedded in us that even we don't notice it until we've written three or four books.",
            "Title": "American Writer",
            "Name": "Sara Zarr"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/stefano-gabbana.webp",
            "Text": "Fashion takes its inspiration from society and everyday life, which is the same for everyone, and this is perhaps the reason why certain elements recur.",
            "Title": "Italian Designer",
            "Name": "Stefano Gabbana"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kim-petras.webp",
            "Text": "It's a recurring thing: It's that I fall really deeply for bad relationships. It's just always been this way and not changing.",
            "Title": "German Musician",
            "Name": "Kim Petras"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/adam-beach.webp",
            "Text": "It's much easier to come back as a recurring character. Because you already know his traits and who he is and what he's about.",
            "Title": "Canadian Actor",
            "Name": "Adam Beach"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-mccloud.webp",
            "Text": "I have a recurring nightmare that I wake up in a gutter with nothing. I've had it all my life. That's why I work, I think.",
            "Title": "British Designer",
            "Name": "Kevin McCloud"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ron-fournier.webp",
            "Text": "American exceptionalism is the recurring character in the nation's narrative.",
            "Title": "American Journalist",
            "Name": "Ron Fournier"
        }
    ]
}