{
    "currentWord": {
        "wordRoot": "reduce",
        "id": 13157,
        "phonemic": "rɪˈdjuːs|rɪˈduːs\r",
        "bigId": "46be9f28-a68f-4b62-a438-202a8a114804",
        "wordForms": [
            "reduces",
            "reducing",
            "reduced",
            "reduction",
            "reduce"
        ]
    },
    "senses": [
        {
            "id": "46be9f28-a68f-4b62-a438-202a8a114804",
            "de": "Make something or someone smaller in size, amount, or extent",
            "ty": "verb",
            "ex": "She reduced her weekly hours of work from 40 to 25.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "reduce speed",
                " reduce risk",
                " reduce weight"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/46be9f28-a68f-4b62-a438-202a8a114804.webp",
            "Tips": [
                {
                    "title": "Physical reduction",
                    "description": "Used when talking about decreasing the physical size, amount, or number of tangible items.",
                    "example": "To save space, companies reduce packaging sizes.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/NZKrHyDqJCTEQ2bPXBveB7iz20.webp"
                },
                {
                    "title": "Quantity over time",
                    "description": "Emphasizes a gradual decrease in quantity or intensity over a period of time.",
                    "example": "We need to reduce energy consumption gradually.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FqbPuOEmjVMvRbxbda2oCOwwA.webp"
                },
                {
                    "title": "Not elimination",
                    "description": "Reduce means to lessen, not completely eliminate something.",
                    "example": "The doctor recommended reducing sugar, not cutting it out entirely.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/11ObuK2Gh6LIUGlzth5x6f6X2Tc.webp"
                }
            ]
        },
        {
            "id": "d6b9e5b6-296e-4357-bdd0-a72d872d77aa",
            "de": "Simplify a subject or problem",
            "ty": "verb",
            "ex": "The issue was reduced to a few simple questions.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "reduce to essentials",
                " reduce complexity",
                " reduce a problem"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d6b9e5b6-296e-4357-bdd0-a72d872d77aa.webp",
            "Tips": [
                {
                    "title": "Complex to simple",
                    "description": "Refers to taking something complex and making it easier to understand.",
                    "example": "Reduce a complex argument to a simple statement.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Focus on core",
                    "description": "Involves identifying and concentrating on the most important elements of something.",
                    "example": "They reduced the story to its key themes.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "6da747fd-d860-4de8-86f8-2a73dbea41c4",
            "de": "Change food or another substance into a simpler form",
            "ty": "verb",
            "ex": "The body reduces food to nutrients.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "reduce to ashes",
                " reduce to liquid",
                " reduce to pulp"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/6da747fd-d860-4de8-86f8-2a73dbea41c4.webp",
            "Tips": [
                {
                    "title": "Chemical transformation",
                    "description": "Describes the process of changing substances into different or simpler forms.",
                    "example": "Heat can reduce this compound to a more basic form.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Cooking context",
                    "description": "Common in cooking to describe concentrating flavors by cooking down liquid.",
                    "example": "Reduce the sauce for twenty minutes to thicken it.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "1c27a3f4-9c87-48a1-82f0-4abc5e2de56a",
            "de": "Diminish gradually",
            "ty": "verb",
            "ex": "Over time, his influence in the company was reduced.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "reduce influence",
                " reduce impact",
                " reduce power"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1c27a3f4-9c87-48a1-82f0-4abc5e2de56a.webp",
            "Tips": [
                {
                    "title": "Power dynamics",
                    "description": "Often used in business or politics to express loss of power, influence or authority.",
                    "example": "The merger reduced the manager's role in the company.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subtle change",
                    "description": "Suggests a subtle or less obvious diminution, not necessarily immediate or direct.",
                    "example": "New regulations have slowly reduced his control over the project.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "17230011-26a3-4027-8924-d9c4c0ff6d47",
            "de": "Degrade or belittle someone",
            "ty": "verb",
            "ex": "She tried to reduce him by making fun of his achievements.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "reduce dignity",
                " reduce self-esteem",
                " reduce status"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/17230011-26a3-4027-8924-d9c4c0ff6d47.webp",
            "Tips": [
                {
                    "title": "Emotional effect",
                    "description": "Can indicate making someone feel lesser in value or importance, often in a hurtful way.",
                    "example": "His comments about her work reduced her confidence.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Social perception",
                    "description": "Used to express how someone's status or reputation is perceived as lowered by others.",
                    "example": "The scandal reduced him in the eyes of his peers.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Curtail": {
            "wordRoot": "Curtail",
            "wordDefinition": "Curtail means to cut back or shorten something, often to a significant degree. This term is used when there is a need to reduce something quickly and significantly.\n\nFor example, a government may curtail spending on certain programs during an economic crisis.\n\nIn summary, curtailing is a more drastic and immediate reduction, while reducing is a slower and more gradual reduction.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7b486497-a3da-475b-9f46-a29343ffcf2c.webp"
        },
        "Cut back": {
            "wordRoot": "Cut back",
            "wordDefinition": "Cut back means to decrease an amount or quantity of something that was previously used or consumed regularly. It usually implies a significant or drastic reduction.\n\nBut if they want to cut back on their spending, they may drastically reduce their shopping habits and only buy necessities.\n\nCut back is usually used when a more significant decrease is needed, while reduce can be used for both small and large decreases.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f2e99a7f-7625-45f2-8130-ffa3e89c1360.webp"
        },
        "Decrease": {
            "wordRoot": "Decrease",
            "wordDefinition": "Both decrease and reduce mean to make something smaller, but they are used in different situations.\n\nDecrease is used when referring to a change in quantity or number. For example, if you have ten apples and you eat three, the number of apples has decreased from ten to seven.\n\nDecrease refers to a change in quantity or number, while reduce refers to a change in size or intensity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/49f4a8f8-d896-4ab3-8eea-99e6df95bdf2.webp"
        },
        "Diminish": {
            "wordRoot": "Diminish",
            "wordDefinition": "Diminish means to make something smaller or weaker, usually gradually over time.\n\nFor example, a person's interest in a particular hobby may gradually diminish over time as they lose enthusiasm for it.\n\nDiminish describes a gradual decrease while reduce is an immediate decrease.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4db99ecf-4dc9-4c74-b813-bd64a95f841f.webp"
        },
        "Lessen": {
            "wordRoot": "Lessen",
            "wordDefinition": "The words lessen and reduce both mean to make something smaller or decrease it.\n\nHowever, lessen is usually used in reference to something like a feeling or a burden. For example, you might say that talking to a friend lessened your anxiety.\n\nSimilarly, you might say that an action you took lessened the stress on your family.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/418a20ae-cc6d-4e4e-800a-8852d9d76798.webp"
        },
        "Low": {
            "wordRoot": "Low",
            "wordDefinition": "Low refers to something that is already at a low level, while reduce means to make something lower or decrease it from its current level.\n\nFor example, if the price of a product is already low, we can say it is a low price.\n\nHowever, if we want to make the price lower, we can reduce the price further.\n\nSimilarly, if someone's cholesterol levels are already low, we can say they have low cholesterol. But if we want to make their cholesterol levels lower, we can suggest ways to reduce their cholesterol, such as by eating a healthier diet or exercising more.\n\nLow refers to something that is already low, while reduce means to make something lower than it currently is.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a9fcb71e-92d0-4f8e-8c53-94f8689bd437.webp"
        },
        "Minimize": {
            "wordRoot": "Minimize",
            "wordDefinition": "Minimize means to make something as small as possible or to keep it to a minimum. It's used when you want to reduce the amount of something to the lowest possible level.\n\nFor example, people try to minimize stress by taking breaks or avoiding stressful situations.\n\nMinimize is used when you want to make something as small as possible, while reduce is used when you want to make something smaller or decrease its quantity or size.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3080bd15-41fc-4e53-841c-e035bfa9b84d.webp"
        },
        "Shrink": {
            "wordRoot": "Shrink",
            "wordDefinition": "Shrink also means to make something smaller in size, but it usually implies a decrease or loss in value or worth. For example, if a sweater shrinks in the wash, it may become too small to wear or lose its original quality.\n\nIn business, the term shrink is often used to describe the loss of inventory due to theft or damage.\n\nReduce focuses on making something smaller while maintaining its value, while shrink implies a decrease in value or worth in addition to physical size reduction.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d10ab27c-c38f-4959-bfa6-36a653eb7309.webp"
        }
    },
    "videos": [
        {
            "Text": " interacting with each other in a beautiful way, and that that can happen more efficiently at a small scale. So, just as on Earth, clunky stereo systems have shrunk to beautiful, tiny iPods, maybe intelligent life itself, in order to reduce its footprint on the environment, has turned itself microscopic.",
            "Title": "Questions No One Knows...",
            "VideoId": "7SWvDHvWXok",
            "Controls": "start=595"
        },
        {
            "Text": " Comparing what they're experiencing to normal, temporary feelings of sadness can make them feel guilty for struggling. Even just talking about depression openly can help. For example, research shows that asking someone about suicidal thoughts actually reduces their suicide risk.",
            "Title": "What is depression? -...",
            "VideoId": "z-IR48Mb3W0",
            "Controls": "start=220"
        },
        {
            "Text": " When bacteria digest fiber, they produce short chain fatty acids that nourish the gut barrier, improve immune function, and can help prevent inflammation, which reduces the risk of cancer. And the more fiber you ingest, the more fiber-digesting bacteria colonize your gut.",
            "Title": "How the food you eat...",
            "VideoId": "1sISguPDlhY",
            "Controls": "start=79"
        },
        {
            "Text": " So how do we prevent these uncomfortable and potentially fatal attacks in people who have asthma? One way is to reduce the presence of triggers. Unfortunately, the world is an unpredictable place and exposure to triggers can't always be controlled.",
            "Title": "How does asthma work? -...",
            "VideoId": "PzfLDi-sL3w",
            "Controls": "start=176"
        },
        {
            "Text": " beyond just being ready for the epidemic. The primary healthcare, the R&D, those things would reduce global health equity and make the world more just as well as more safe. So I think this should absolutely be a priority. There's no need to panic.",
            "Title": "Bill Gates: The next...",
            "VideoId": "6Af6b_wyiwI",
            "Controls": "start=462"
        },
        {
            "Text": " learned about global warming many organizations advocate cutting greenhouse gas emissions to reduce the impact of global warming consumers can help by saving energy around the house switching to compact fluorescent light bulbs and driving",
            "Title": "Global Warming 101 PIPE...",
            "VideoId": "oJAbATJCugs",
            "Controls": "start=156"
        },
        {
            "Text": " are life long. Luckily they're reducing a lot. We've met quite a few of them. Are there any primates here that, you know, you try to stay away from as much as possible that have maybe issues that are strong, worse than the others?",
            "Title": "Should Primates be Kept...",
            "VideoId": "1hET0mIt11Q",
            "Controls": "start=639"
        },
        {
            "Text": " All of life abounds with suffering. It's caused by selfish craving for one's own fulfillment at the expense of others. Following an eight-step plan can teach us to reduce that craving, and thus reduce the suffering.",
            "Title": "The five major world...",
            "VideoId": "m6dCxo7t_aE",
            "Controls": "start=324"
        },
        {
            "Text": " and potentially reduce the risk of certain types of cancer. No matter what, getting the right amount of liquid makes a world of difference in how you'll feel, think, and function day to day.",
            "Title": "What would happen if you...",
            "VideoId": "9iMGFqMmUFs",
            "Controls": "start=261"
        },
        {
            "Text": " increased value of the crop and the water savings other benefits of hydrogel include it helps reduce topsoil erosion and it allows farmers to use less fertilizer so what's next for the",
            "Title": "Hydrogels as an...",
            "VideoId": "bTRNSh8e9LE",
            "Controls": "start=300"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-kilby.webp",
            "Text": "It's true that the original idea was mine, but what you see today is the work of probably tens of thousands of the world's best engineers, all concentrating on improving the product, reducing the cost, things of that sort.",
            "Title": "American Scientist",
            "Name": "Jack Kilby"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yusuf-hamied.webp",
            "Text": "Reducing the price of AIDS drugs gave me so much satisfaction that I've been thinking what else I could do. One day, I thought, 'Let's look at cancer and see how we can spare cancer patients' unnecessary suffering.",
            "Title": "Indian Scientist",
            "Name": "Yusuf Hamied"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christian-bale.webp",
            "Text": "I don't get it when you get so much openness about the way movies are made, and the special effects and the behind-the-scenes stuff and all of that. I can't help but feel like this reduces it a little bit.",
            "Title": "Welsh Actor",
            "Name": "Christian Bale"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-greitens.webp",
            "Text": "When you have law-abiding citizens who are actively ready to protect themselves and their family, that reduces crime.",
            "Title": "American Politician",
            "Name": "Eric Greitens"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/angela-merkel.webp",
            "Text": "We have shared responsibility for global climate; we have to reduce climate change below 2 degrees Celsius.",
            "Title": "German Statesman",
            "Name": "Angela Merkel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ian-hacking.webp",
            "Text": "It is so hard to make important decisions that we have a great urge to reduce them to rules.",
            "Title": "Canadian Philosopher",
            "Name": "Ian Hacking"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ivan-krastev.webp",
            "Text": "Living in truth cannot be reduced to having access to full information.",
            "Title": "Public Servant",
            "Name": "Ivan Krastev"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jawaharlal-nehru.webp",
            "Text": "Without peace, all other dreams vanish and are reduced to ashes.",
            "Title": "Indian Leader",
            "Name": "Jawaharlal Nehru"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dave-reichert.webp",
            "Text": "I came to Congress to help reduce spending.",
            "Title": "American Politician",
            "Name": "Dave Reichert"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nana-patekar.webp",
            "Text": "Practice helps you reduce your mistakes.",
            "Title": "Indian Actor",
            "Name": "Nana Patekar"
        }
    ]
}