{
    "currentWord": {
        "wordRoot": "regardless",
        "id": 15326,
        "phonemic": "rɪˈɡɑːdləs|rɪˈɡɑːrdləs\r",
        "bigId": "dd46f2f4-842f-43f2-a3ae-72dd49dda154",
        "wordForms": [
            "regardless"
        ]
    },
    "senses": [
        {
            "id": "dd46f2f4-842f-43f2-a3ae-72dd49dda154",
            "de": "Without considering or caring about possible problems or effects",
            "ty": "adverb",
            "ex": "Regardless of the risks, she decided to invest all her savings in the business.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "regardless of risk",
                " regardless of cost",
                " regardless of consequences"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/dd46f2f4-842f-43f2-a3ae-72dd49dda154.webp",
            "Tips": [
                {
                    "title": "Consequence Ignorance",
                    "description": "Used when actions are taken without regard to the negative outcomes that might occur.",
                    "example": "He spoke his mind regardless of offending anyone.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/WpQsnAfZDW0twJe6BeeEAdq5O0.webp"
                },
                {
                    "title": "Unwavering Resolution",
                    "description": "Reflects a strong commitment to do something, no matter what obstacles may come.",
                    "example": "She pursued her dreams regardless of her friends' doubts.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3TyT63cNZNAPHh3nxHXvetAw.webp"
                },
                {
                    "title": "Focus on Priority",
                    "description": "Emphasizes the priority of the main subject over other factors.",
                    "example": "They had to finish the project on time regardless of the lack of resources.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/0OASkdobv5KQVhIgZEmvrkaKDQ.webp"
                }
            ]
        },
        {
            "id": "9b41a75c-c9fc-481b-b522-73ad5963f093",
            "de": "Not considering or worrying about something",
            "ty": "adjective",
            "ex": "They carried on with their plan, regardless of the weather.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "remain regardless",
                " act regardless",
                " continue regardless"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9b41a75c-c9fc-481b-b522-73ad5963f093.webp",
            "Tips": [
                {
                    "title": "Disregard for Impact",
                    "description": "Highlights a lack of consideration for the impact or influence of something else.",
                    "example": "She decorated her room with bright colors, regardless of the latest trends.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Persisting Despite Obstacles",
                    "description": "Shows persistence in an action even when faced with obstacles or challenges.",
                    "example": "They continued their hike regardless of the heavy rain.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Risk Dismissal",
                    "description": "Indicates an action is done without consideration for the risks involved.",
                    "example": "Regardless of possible injury, he went on the extreme sports trip.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Anyway": {
            "wordRoot": "Anyway",
            "wordDefinition": "Both anyway and regardless are used to indicate that a particular action or statement will happen or be true despite other circumstances.\n\nAnyway is used when we want to introduce a contrasting or more important point, often to close a discussion.\n\nIt can also be used to mean \"in any case\" or \"whatever the situation.\" For example, \"I know it's raining, but we're going to the park anyway,\" or \"Anyway, let's change the subject.\"\n\nHowever, anyway is typically used to transition between points or discussions, while regardless emphasizes a lack of dependence on external factors.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/932655d9-3307-44f5-81ba-128e1f644fd7.webp"
        },
        "Despite": {
            "wordRoot": "Despite",
            "wordDefinition": "Despite and regardless are similar in meaning, but they have subtle differences in usage.\n\nDespite is used to acknowledge a fact or situation that may seem to contradict or hinder something else. For example: \"Despite the rainy weather, we still went for a walk.\" In this sentence, despite is used to show that the rainy weather could have prevented them from going for a walk, but they still did it anyway.\n\nDespite is used to acknowledge a hindrance or obstacle, while regardless is used to indicate determination or resolve.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e4e4f51a-8836-4052-bd19-2f943a143626.webp"
        },
        "However": {
            "wordRoot": "However",
            "wordDefinition": "However is used to introduce a contrast or a contradiction with the previous statement, while regardless is used to indicate that something is being done or considered without taking into account any other factors or conditions.\n\nFor example, if someone says \"I like the beach, however, I don't like the sand\", they are introducing a contradiction to their statement about liking the beach.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/219ee185-f4b3-4de0-9f25-b2aa9fc7aeb0.webp"
        },
        "In any case": {
            "wordRoot": "In any case",
            "wordDefinition": "Both in any case and regardless are used to show that something will happen or be true no matter what.\n\nHowever, in any case is typically used when referring to a specific situation, while regardless can be applied more broadly.\n\nFor example, \"In any case, I will attend the party tomorrow\" suggests that the speaker is referring to a specific party or situation that they will definitely attend, no matter what.\n\nOn the other hand, \"Regardless of what happens, I will continue to study hard\" implies that the speaker is determined to keep up their studies even if things don't go as planned.\n\nIn any case is more specific and refers to a particular situation, while regardless is more general and can apply to a wider range of scenarios.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/41404351-aa92-4523-86d1-13260456feac.webp"
        },
        "Nevertheless": {
            "wordRoot": "Nevertheless",
            "wordDefinition": "Both nevertheless and regardless mean \"in spite of something,\" but they are used in slightly different ways.\n\nNevertheless is used to indicate a contrast or opposition between two things. For example, \"I was very tired; nevertheless, I went for a run.\" The speaker is saying that despite being tired, they still went for a run.\n\nNevertheless is used to show a contrast or opposition, while regardless is used to indicate that something is true no matter what.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ddfc7221-6ba8-4a1e-bcfc-df60951a0c03.webp"
        },
        "No matter": {
            "wordRoot": "No matter",
            "wordDefinition": "Both no matter and regardless are similar in meaning, in that they both indicate that something will not be affected by a particular circumstance or condition.\n\nHowever, no matter is used to introduce a clause that emphasizes that something will be true regardless of any other conditions, while regardless is used to indicate that something will be true even if certain conditions are not met.\n\nIn other words, no matter emphasizes the certainty of something, while regardless emphasizes the lack of influence from a particular condition.\n\nFor example, \"No matter how hard I study, I cannot understand this math problem\" indicates that the speaker has tried everything and still cannot grasp the concept.\n\nOn the other hand, \"I will go to the party regardless of whether it rains or not\" indicates that rain may have been a potential factor that could have prevented the speaker from attending the party, but they will still go despite the weather.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/20c9f6dd-0216-4f76-a2db-15fd01f4c2f5.webp"
        },
        "Nonetheless": {
            "wordRoot": "Nonetheless",
            "wordDefinition": "Nonetheless and regardless are both words that indicate something is happening or being done despite certain circumstances.\n\nHowever, nonetheless is used to imply that there is some difficulty or challenge to overcome, but the situation is still being resolved or the goal is being achieved.\n\nRegardless indicates that the situation or circumstance is not being considered or ignored entirely. For example, \"he won the race nonetheless, despite his injury\" means that he overcame a challenge to win the race, whereas \"he won the race regardless of his injury\" means that the injury was not taken into account when determining the winner.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/509aa9a3-9c77-4491-901a-6ccb0065e2ef.webp"
        },
        "Notwithstanding": {
            "wordRoot": "Notwithstanding",
            "wordDefinition": "Notwithstanding means despite something, or in spite of a particular factor.\n\nFor example: \"Notwithstanding the heavy rain, the concert will still go ahead.\"\n\nNotwithstanding is used to overcome obstacles, while regardless is used to convey indifference or lack of concern.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/373b04fa-373a-47a7-a649-2f42fbd83b6e.webp"
        },
        "Respective": {
            "wordRoot": "Respective",
            "wordDefinition": "Respective means relating or belonging individually to each of several people or things, typically used to emphasize the difference between them.\n\nExample: \"Each student should take their respective books.\"\n\nRegardless is used to express indifference or indicate that something is true despite other factors, while respective is used to emphasize the difference between several people or things.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9fc4e09f-8db8-43da-bdb1-a45cb59443f5.webp"
        }
    },
    "videos": [
        {
            "Text": " planet together and these cosmic phenomena are not concerned with us that's right they have been regardless it really ties us together I feel tied together with you I feel tied together with everybody across the u.s. everybody across the world who's watching this stream right now the animals all of nature around us we all",
            "Title": "Watch the Total Solar...",
            "VideoId": "oLBwibYSzEk",
            "Controls": "start=1334"
        },
        {
            "Text": " If you experience math anxiety, it may not help to just know that math anxiety exists. Or perhaps it's reassuring to put a name to the problem. Regardless, if you take a look around yourself, the odds are good that you'll see someone experiencing the same thing as you.",
            "Title": "Why do people get so...",
            "VideoId": "7snnRaC4t5c",
            "Controls": "start=229"
        },
        {
            "Text": " Because all types of bilingual people can become fully proficient in a language regardless of accent or pronunciation, the difference may not be apparent to a casual observer. But recent advances in brain imaging technology have given neurolinguists a glimpse",
            "Title": "The benefits of a...",
            "VideoId": "MMmOLN5zBLY",
            "Controls": "start=104"
        },
        {
            "Text": " Regardless, toxoplasma has definitely benefited from humans to become one of the world's most successful parasites. It's not just our willingness to let cats on our dining room tables or in our beds. Raising livestock and building cities which attract rodents",
            "Title": "Is there a disease that...",
            "VideoId": "rqno7K2zXi4",
            "Controls": "start=264"
        },
        {
            "Text": " Plato argued mathematical concepts were concrete and as real as the universe itself, regardless of our knowledge of them. Euclid, the father of geometry, believed nature itself was the physical manifestation of mathematical laws.",
            "Title": "Is math discovered or...",
            "VideoId": "X_xR5Kes4Rs",
            "Controls": "start=60"
        },
        {
            "Text": " that regardless of how long and hard this is going to take me I'm gonna have to learn 3d printing 3d modeling electronics and programming from scratch and to help me overcome those steep learning curves and to be excited to",
            "Title": "How I made the ultimate...",
            "VideoId": "Fsl66HItm_A",
            "Controls": "start=46"
        },
        {
            "Text": " the clouds parted. Einstein realized that the contradiction could be resolved if it was the speed of light that remained constant, regardless of reference frame, while both time and space were relative to the observer.",
            "Title": "Einstein's miracle year...",
            "VideoId": "91XI7M9l3no",
            "Controls": "start=199"
        },
        {
            "Text": " we can protect ourselves from the worst ravages and keep ourselves warm regardless of the conditions outside but we're not divorced from it even when we're warm indoors the weather affects",
            "Title": "Braving the Storms PIPE...",
            "VideoId": "OFd2VUL01bE",
            "Controls": "start=43"
        },
        {
            "Text": " that no longer was in your life? Have you ever looked back on that event with the sad smile of autumn and the realization that futures will happen regardless? Congratulations.",
            "Title": "Ze Frank: Are you human?",
            "VideoId": "ccIt-qRQBoI",
            "Controls": "start=239"
        },
        {
            "Text": " will yield 'ozo' if the hypothetical question is true and 'ulu' if it's false regardless of what each word actually means. Unfortunately, this doesn't help us with Arr.",
            "Title": "Can you solve the three...",
            "VideoId": "LKvjIsyYng8",
            "Controls": "start=161"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-hart.webp",
            "Text": "When you're doing a film and the majority of the film is cast black, for me, it's most important to get people to view those movies as just movies, as just good movies. At the end of the day, regardless of the color of the cast, we're all doing the same thing in this business: trying to make a good film.",
            "Title": "American Actor",
            "Name": "Kevin Hart"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "What I believe unites the people of this nation, regardless of race or region or party, young or old, rich or poor, is the simple, profound belief in opportunity for all - the notion that if you work hard and take responsibility, you can get ahead.",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lou-holtz.webp",
            "Text": "I think that everybody needs four things in life. Everybody needs something to do regardless of age. Everybody needs someone to love. Everybody needs something to hope for, and, of course, everybody needs someone to believe in.",
            "Title": "American Coach",
            "Name": "Lou Holtz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/chadwick-boseman.webp",
            "Text": "I try to look at every role the same way, regardless of whether the character is real or the character is a fantasy. I always start from myself, because you have to know yourself first.",
            "Title": "American Actor",
            "Name": "Chadwick Boseman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sonia-sotomayor.webp",
            "Text": "I do believe that every person has an equal opportunity to be a good and wise judge regardless of their background or life experiences.",
            "Title": "American Judge",
            "Name": "Sonia Sotomayor"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/taylor-swift.webp",
            "Text": "But when I hear a great song, I can't help but be inspired by it, regardless of whatever genre that song falls under.",
            "Title": "American Singer",
            "Name": "Taylor Swift"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/booker-t-washington.webp",
            "Text": "The individual who can do something that the world wants done will, in the end, make his way regardless of his race.",
            "Title": "American Educator",
            "Name": "Booker T. Washington"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/doja-cat.webp",
            "Text": "Truth is, I love everyone that is a good person regardless of what they look like, walk like, or who they love.",
            "Title": "American Musician",
            "Name": "Doja Cat"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-martin.webp",
            "Text": "Responsibility for learning belongs to the student, regardless of age.",
            "Title": "American Politician",
            "Name": "Robert Martin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mohamed-bin-issa-al-jaber.webp",
            "Text": "Every life - regardless of background or gender - has equal value.",
            "Title": "Saudi Arabian Businessman",
            "Name": "Mohamed Bin Issa Al Jaber"
        }
    ]
}