{
    "currentWord": {
        "wordRoot": "relative",
        "id": 17980,
        "phonemic": "ˈrelətɪv|ˈrelətɪv\r",
        "bigId": "c2593b53-a774-4f10-b5ee-ff81db5d255f",
        "wordForms": [
            "relatives",
            "relatively",
            "relative"
        ]
    },
    "senses": [
        {
            "id": "c2593b53-a774-4f10-b5ee-ff81db5d255f",
            "de": "A person who is connected to you by blood or marriage",
            "ty": "noun",
            "ex": "I am going to visit my relatives this weekend",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "distant relative",
                " close relative",
                " immediate relative"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c2593b53-a774-4f10-b5ee-ff81db5d255f.webp",
            "Tips": [
                {
                    "title": "Family Connection",
                    "description": "Use 'relative' for anyone related by blood or marriage, not just immediate family.",
                    "example": "She discovered a relative from three generations ago.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tx1MzaQZADALY3IzEgKBs0Q4qJw.webp"
                },
                {
                    "title": "Not Necessarily Close",
                    "description": "'Relative' can imply distance, suggesting a family tie without implying a close relationship.",
                    "example": "I've invited a few distant relatives to the wedding.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/p7kD4beWwEFcT8PIGqA2ViVlJM.webp"
                },
                {
                    "title": "Formal Tone",
                    "description": "Using 'relative' can sound formal or official compared to 'family member.'",
                    "example": "Please list all your relatives on the application form.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/3Mlvkql0Ses285Yel3ATUF94aVg.webp"
                }
            ]
        },
        {
            "id": "507cff86-11ba-4a5f-b8a8-07617998226e",
            "de": "Considered in relation to something else",
            "ty": "adjective",
            "ex": "His success was relative to his hard work",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "relative importance",
                " relative value",
                " relative strength"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/507cff86-11ba-4a5f-b8a8-07617998226e.webp",
            "Tips": [
                {
                    "title": "Comparison Required",
                    "description": "'Relative' as an adjective always implies a comparison with something else.",
                    "example": "Prices are low relative to last year's rates.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Absolute",
                    "description": "Emphasize that 'relative' shows something is not total or absolute in nature.",
                    "example": "The benefits of the policy are relative to its costs.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Context Dependent",
                    "description": "Point out that a 'relative' characteristic depends on conditions or context.",
                    "example": "His speed is fast, relative to other beginners.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "dc6d0bbb-3eb6-473b-88bd-5a9f86dc84fd",
            "de": "A thing's existence, nature or value is judged in comparison with something else",
            "do": "Philosophical",
            "ty": "noun",
            "ex": "In comedy, timing is everything - it's all relative",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "relative terms",
                " relative concept",
                " relative morality"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/dc6d0bbb-3eb6-473b-88bd-5a9f86dc84fd.webp",
            "Tips": [
                {
                    "title": "Philosophical Use",
                    "description": "Note that 'relative' in philosophy often discusses concepts that depend on other factors.",
                    "example": "Is morality absolute or relative?\r",
                    "imageUrl": ""
                },
                {
                    "title": "Abstract Concepts",
                    "description": "Explain using 'relative' for abstract ideas measured against something else.",
                    "example": "Success is a relative term, varying for each person.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "a059f239-cbfa-4fd0-9caf-61197d3d6b08",
            "de": "Dependent on the circumstances or context, not absolute",
            "do": "General",
            "ty": "adjective",
            "ex": "Her happiness was relative to the amount of time she spent with her family",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "relative happiness",
                " relative peace",
                " relative comfort"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a059f239-cbfa-4fd0-9caf-61197d3d6b08.webp",
            "Tips": [
                {
                    "title": "Dependent Happiness",
                    "description": "Describe how 'relative' can express that feelings or states depend on specific conditions.",
                    "example": "Happiness is often relative to one's expectations.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Circumstantial",
                    "description": "Clarify 'relative' for expressing something's nature that relies on particular circumstances.",
                    "example": "Feeling of safety is relative to the environment.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Applicable": {
            "wordRoot": "Applicable",
            "wordDefinition": "Applicable means something is appropriate or suitable for a particular situation or person. For example, a law may be applicable to a certain type of crime, or a certain policy may be applicable to a specific group of people.\n\nApplicable refers to something that is fitting for a specific situation, while relative refers to something that is compared to something else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/152fa7d7-cd88-4873-b9ed-39ecea0a5729.webp"
        },
        "Comparative": {
            "wordRoot": "Comparative",
            "wordDefinition": "Both comparative and relative refer to a relation or comparison between two things, but they are used in different contexts.\n\nComparative is used when comparing two or more things, indicating which of them has a higher or lower degree of a certain quality.\n\nFor example, if we say that one book is more interesting than another, we are using a comparative form.\n\nIn summary, while comparative refers to the comparison between two or more things, relative refers to the relationship or connection between them.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ec582019-d3c1-40f2-92c4-64ee8e3d9d98.webp"
        },
        "Connect": {
            "wordRoot": "Connect",
            "wordDefinition": "Connect refers to a relationship or association between two or more things, such as connecting two dots with a line.\n\nIt can also refer to establishing communication or a relationship with someone, such as connecting with a friend on social media.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5610d91a-3dce-41ff-9a46-5aebc8cfd751.webp"
        },
        "Kin": {
            "wordRoot": "Kin",
            "wordDefinition": "Kin usually refers to a person's immediate family members, such as parents, siblings, and children.\n\nIf you're talking specifically about your close family members, you might use the word kin, but if you're talking about family members in general, you might use the word \"relative.\"",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6cc85c40-d4de-432c-8b60-5c1cdf718167.webp"
        },
        "Pertinent": {
            "wordRoot": "Pertinent",
            "wordDefinition": "Pertinent refers to something that is directly related to or applicable to a particular situation or topic. For example, if you are discussing a specific problem or situation, a pertinent comment or solution would be one that directly addresses that issue.\n\nPertinent is more focused and specific to a particular situation, while relative is broader and more comparative.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4e8c66f5-f287-43af-8f07-2159a9afc88f.webp"
        },
        "Proportional": {
            "wordRoot": "Proportional",
            "wordDefinition": "The term proportional refers to the relationship between two quantities that change together in a consistent and predictable way.\n\nFor example, if you increase the length of a rectangle by 2 units, the width should also increase by a proportional amount to maintain the same ratio of length to width.\n\nProportional describes the relationship between two quantities that change together in a consistent and predictable way, while relative describes how something compares to something else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a205d68e-f7df-471c-88c3-474a26de4a57.webp"
        },
        "Relation": {
            "wordRoot": "Relation",
            "wordDefinition": "Relation refers to a connection or association between two or more things or people. For example, the relation between a mother and a child is a familial connection.\n\nRelation refers to a connection or association between two or more things or people, while relative refers to a person who is related to you by blood or marriage.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3e242290-009e-4bba-b0f0-a47a1d2420f3.webp"
        },
        "Relevant": {
            "wordRoot": "Relevant",
            "wordDefinition": "Relevant means something that is important or related to a specific topic or situation. For example, if you say \"this article is relevant to our discussion on climate change,\" it means that the article is important and related to the topic of climate change.\n\nRelative is applicable when comparing or connecting things, while relevant is applicable when something is important or related to a specific topic or situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ced59ad9-c7de-475d-9dca-ab2307bba0b3.webp"
        }
    },
    "videos": [
        {
            "Text": " groups that have a relative advantage tend to grow until that advantage disappears. If people were only fighting and competing throughout human evolution, natural selection would lead to more lefties being the ones that made it until there were so many of them, that it was no longer a rare asset. So in a purely competitive world,",
            "Title": "Why are some people...",
            "VideoId": "TGLYcYCm2FM",
            "Controls": "start=179"
        },
        {
            "Text": " sometimes even outwitting the researchers and manipulating their partners. And they've grasped basic arithmetic, keeping track of the relative amounts of fruit in two baskets after multiple changes. The rare combination of memory and problem solving can explain some of elephants' most clever behaviors,",
            "Title": "Why elephants never...",
            "VideoId": "lSXNqsOoURg",
            "Controls": "start=162"
        },
        {
            "Text": " the scenarios faced by the ever-diligent and maybe too hospitable night manager serve to remind us of just how hard it is for our relatively finite minds to grasp a concept as large as infinity. Maybe you can help tackle these problems after a good night's sleep. But honestly, we might need you",
            "Title": "The Infinite Hotel...",
            "VideoId": "Uj3_KqkI9Zo",
            "Controls": "start=322"
        },
        {
            "Text": " and having bad hair and working out was literally a priority for me at the time as long as we could party chase girls and goof off which we definitely did a lot of things seemed good life seemed good relative to what I knew then of course but it still seemed good my life",
            "Title": "How math saved my life PIPE...",
            "VideoId": "GDU7lEmiiD8",
            "Controls": "start=143"
        },
        {
            "Text": " The north's cold environment may have influenced neanderthals' physique. Their bodies were relatively short, with males averaging five feet, five inches and females five feet, one inch tall, and they were stocky with broad chests, bulky torsos, and muscular limbs.",
            "Title": "Neanderthals 101 PIPE...",
            "VideoId": "FMc81qpCQ3g",
            "Controls": "start=40"
        },
        {
            "Text": " they are relative to each other. Taoists believe that the universe is made up of energies, vibrations, and matter, which behave differently in different contexts. Something can be yin or yang depending on, well, depending on lots of things.",
            "Title": "The hidden meanings of...",
            "VideoId": "ezmR9Attpyc",
            "Controls": "start=41"
        },
        {
            "Text": " knowing both parents' blood types lets us predict the relative probability of their children's blood types. Why do blood types matter? For blood transfusions, finding the correct one is a matter of life and death.",
            "Title": "Why do blood types...",
            "VideoId": "xfZhb6lmxjk",
            "Controls": "start=132"
        },
        {
            "Text": " He wanted to leave all of his money to you, but he knew that if he did, your relatives would pester you forever. So he is banking on the fact that he taught you everything you need to know about riddles.",
            "Title": "Can you solve the locker...",
            "VideoId": "c18GjbnZXMw",
            "Controls": "start=14"
        },
        {
            "Text": " But first, I want you to make a little confession to me. In the past year, I want you to just raise your hand if you've experienced relatively little stress. Anyone?",
            "Title": "How to make stress your...",
            "VideoId": "RcGyVTAoXEU",
            "Controls": "start=14"
        },
        {
            "Text": " millions of years in relative peace but when new challenges arrive they can struggle to cope of all the species that have become",
            "Title": "Yellow Crazy Ants Kill...",
            "VideoId": "NqnauxtCX6I",
            "Controls": "start=196"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/angela-merkel.webp",
            "Text": "I have a relatively sunny spirit, and I always had the expectation that my path through life would be relatively sunny, no matter what happened. I have never allowed myself to be bitter.",
            "Title": "German Statesman",
            "Name": "Angela Merkel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dustin-hoffman.webp",
            "Text": "And that's another reason to make this movie: We can put plays on film now, at a relatively small cost, and they will reach an audience they would never have reached otherwise.",
            "Title": "American Actor",
            "Name": "Dustin Hoffman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/margaret-mead.webp",
            "Text": "Nobody has ever before asked the nuclear family to live all by itself in a box the way we do. With no relatives, no support, we've put it in an impossible situation.",
            "Title": "American Scientist",
            "Name": "Margaret Mead"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zara-phillips.webp",
            "Text": "In our sport you're very lucky to find a horse of a lifetime and I found mine relatively early. He's done everything for me and I owe him the world.",
            "Title": "British Royalty",
            "Name": "Zara Phillips"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alexander-pope.webp",
            "Text": "If a man's character is to be abused there's nobody like a relative to do the business.",
            "Title": "English Poet",
            "Name": "Alexander Pope"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-dell.webp",
            "Text": "Relative to other economies in the world, India has a good feel to it.",
            "Title": "American Businessman",
            "Name": "Michael Dell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeremy-irons.webp",
            "Text": "I have developed a life which seems to need a relatively high income.",
            "Title": "English Actor",
            "Name": "Jeremy Irons"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kate-winslet.webp",
            "Text": "I'm not afraid to admit that I'm a relatively slow reader.",
            "Title": "Actress",
            "Name": "Kate Winslet"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/fareed-zakaria.webp",
            "Text": "Politics and power is a realm of relative influence.",
            "Title": "American Journalist",
            "Name": "Fareed Zakaria"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joan-rivers.webp",
            "Text": "I live very well, but I support a lot of relatives.",
            "Title": "American Comedian",
            "Name": "Joan Rivers"
        }
    ]
}