{
    "currentWord": {
        "wordRoot": "relinquish",
        "id": 16798,
        "phonemic": "rɪˈlɪŋkwɪʃ|rɪˈlɪŋkwɪʃ\r",
        "bigId": "733da940-4090-478d-9575-aa9dcd7bae82",
        "wordForms": [
            "relinquishes",
            "relinquishing",
            "relinquished",
            "relinquish"
        ]
    },
    "senses": [
        {
            "id": "733da940-4090-478d-9575-aa9dcd7bae82",
            "de": "to give up something such as power, responsibility or a claim",
            "ty": "verb",
            "ex": "He will relinquish his role as CEO at the end of the year.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/733da940-4090-478d-9575-aa9dcd7bae82.webp",
            "Tips": [
                {
                    "title": "Not Just Objects",
                    "description": "Relinquish isn't only about physical items; it can refer to abstract things like roles or claims.",
                    "example": "She reluctantly relinquished her claim to the estate.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/7v00XPPhn9Alpj0VWKRg1LJJE.webp"
                },
                {
                    "title": "Voluntary Action",
                    "description": "Relinquishing often involves a conscious decision to surrender something voluntarily.",
                    "example": "He chose to relinquish his parental rights.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/CIxm06LcR5DUi76UmBaJxxE5ysM.webp"
                },
                {
                    "title": "Formal Context",
                    "description": "The word 'relinquish' is formal and used in official or serious situations.",
                    "example": "The general was forced to relinquish command of the army.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FmcTt2QAU5M06T9PyjcgdnSCWaM.webp"
                }
            ]
        },
        {
            "id": "754d5ace-2b1a-4c92-a429-69f5e4243a73",
            "de": "to stop holding something",
            "ty": "verb",
            "ex": "After his defeat, he relinquished the championship title.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/754d5ace-2b1a-4c92-a429-69f5e4243a73.webp",
            "Tips": [
                {
                    "title": "Physical Letting Go",
                    "description": "The action of relinquishing can be the physical act of letting something go from your grasp.",
                    "example": "She reluctantly relinquished her hold on the old family album.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Figurative Release",
                    "description": "It can also be used figuratively to describe giving up a position or title.",
                    "example": "He relinquished his title as the fastest runner in school.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Immediate",
                    "description": "Relinquishing something doesn't always happen instantly; it can be a process.",
                    "example": "Over the next few months, he will relinquish his responsibilities to his successor.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "da1c9560-205b-4fae-a1e8-335bc29f34a7",
            "de": "to let go or release",
            "ty": "verb",
            "ex": "He relinquished his grip on the steering wheel.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/da1c9560-205b-4fae-a1e8-335bc29f34a7.webp",
            "Tips": [
                {
                    "title": "Let Go",
                    "description": "When utilized physically, it suggests completely releasing one's grip or hold on something.",
                    "example": "The child wouldn't relinquish his hold on the toy.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Release",
                    "description": "It can refer to letting go of emotions, grudges, or stress, not just physical items.",
                    "example": "After years of resentment, he finally relinquished his anger.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Loss of Control",
                    "description": "Relinquishing control means you no longer dictate or influence the situation.",
                    "example": "When the CEO fell ill, she had to relinquish control of the company.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Abandon": {
            "wordRoot": "Abandon",
            "wordDefinition": "Abandon means to completely give up on something or someone with no intention of returning or supporting them in the future.\n\nIt is usually a negative term and indicates a sense of desertion or neglect. For example, a person might abandon a project, a relationship, or a child.\n\nAbandon is used when there is a sense of betrayal, rejection or disregard, while relinquish is used when there is a sense of sacrifice, generosity or compliance.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a4456971-8ef0-4903-859d-5bca5ee0280d.webp"
        },
        "Cede": {
            "wordRoot": "Cede",
            "wordDefinition": "Both cede and relinquish mean to give up something or to surrender something, but there is a slight difference between the two.\n\nCede is usually used in reference to official or legal situations. It is the act of transferring ownership or control of something, usually territory or rights, from one person or group to another.\n\nFor example, a city might cede a piece of land to a neighboring town or a country might cede control of a disputed area to another country.\n\nCede is used more in official or legal contexts, while relinquish is used in a wider range of situations where someone is giving up something voluntarily.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a2b9d332-ef32-4c0e-ab11-6bf7a8119f4e.webp"
        },
        "Give up": {
            "wordRoot": "Give up",
            "wordDefinition": "Both give up and relinquish mean to let go of something, but there's a slight difference in their usage.\n\nGive up implies that you are surrendering or abandoning something that belonged to you, either because you no longer want it or because you have been forced to give it up.\n\nFor example, you might give up a habit, a possession, or your claim to something.\n\nRelinquish is often used in legal or official contexts, to mean that you are voluntarily giving up something that you had rights over, such as property, a title, or a position.\n\nGive up tends to be used more informally, while relinquish is more formal and often implies some sort of legal or official context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fb0ae6c0-9951-453c-85d7-6c0c9624c2d5.webp"
        },
        "Renounce": {
            "wordRoot": "Renounce",
            "wordDefinition": "Renounce refers to the act of formally giving up or refusing something, usually with the intention of disowning or rejecting it.\n\nIn simpler terms, relinquish is giving up something willingly, while renounce is giving up something with the intention of rejecting it.\n\nHowever, if someone wants to renounce their citizenship, they need to formally reject it and all that it entails.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/961183e8-5c80-4bdd-b59f-9a3480df16dc.webp"
        },
        "Resign": {
            "wordRoot": "Resign",
            "wordDefinition": "Resign means to quit or give up a position or job, typically with an official announcement. An example sentence would be \"The CEO decided to resign from his position at the company.\".\n\nRelinquish is used when giving up control or possession, while resign is used when quitting a job or position.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/54936062-20be-4109-9b57-c29365d6c599.webp"
        },
        "Surrender": {
            "wordRoot": "Surrender",
            "wordDefinition": "The words relinquish and surrender both refer to giving up something, but they have different meanings and are used in different situations.\n\nSurrender means to give up something because you have no other choice or you have been defeated.\n\nThis word is often used in a military context, when soldiers are forced to give up their weapons and surrender to the enemy.\n\nFor example, \"After years of fighting, the army was forced to surrender to the enemy.\"\n\nRelinquish is used when someone is willingly giving up something they have control over, while surrender is used when someone is forced to give up something they want to keep.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a0619e96-d509-4b9d-bf56-12d4f832b98d.webp"
        },
        "Waive": {
            "wordRoot": "Waive",
            "wordDefinition": "Waive means to give up a right or claim to something. For example, a person might waive their right to sue someone in court.\n\nThe main difference is that relinquish is used when you give up something you have, while waive is used when you give up a right or claim to something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9b27c502-040b-4290-9ecf-cccbfa4bcb14.webp"
        },
        "Yield": {
            "wordRoot": "Yield",
            "wordDefinition": "Both relinquish and yield mean to give up, but there are some slight differences in their usage.\n\nYield is a bit more general and can mean either consciously or unconsciously giving up something. For example, you might yield to another driver in traffic, or you might yield to temptation and eat a cookie even though you're trying to stick to a diet.\n\nOverall, both words can be used when you need to cede control or give up something to someone or something else, but relinquish is more intentional and yield is more general.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/32e8d641-bbe4-4dd2-9239-d1f660d6c72d.webp"
        }
    },
    "videos": [
        {
            "Text": " their homeland in exchange for peace money and services the tribes moved on to a reservation and american farmers moved into the territory relinquished by the tribes to further enhance agricultural development u.s bureau of reclamation at the time known as the reclamation service dammed lakes and drained the",
            "Title": "What It Takes to Keep...",
            "VideoId": "6_4qC71mSMg",
            "Controls": "start=1140"
        },
        {
            "Text": " and suffering, we limit our capacity and shirk our duty to change the course of humanity for the better. By looking for good and working towards the good, we empower ourselves to be agents of good in the fight for the future that we deserve. The alternative -- giving up hope -- only relinquishes power",
            "Title": "The Eco-Creators Helping...",
            "VideoId": "FdbJHeqQh00",
            "Controls": "start=405"
        },
        {
            "Text": " He pulled over. A pregnant lady, Mrs. Hamilton, got on the bus. She ran to the back and got on, not knowing he was trying to have me relinquish my seat. And she sat right next to me. \"The two of you need to get up so I can drive on.\" \"Sir, I paid my dime, I paid my fare.",
            "Title": "Stories: Legacies of who...",
            "VideoId": "5UD0RjZdUHk",
            "Controls": "start=211"
        },
        {
            "Text": " the Republic made Lili’uokalani sign a document that claimed to relinquish her throne, and they imprisoned her in the palace. Under constant guard, she composed songs expressing her love for her people and began making a patchwork quilt that told the story of her life.",
            "Title": "The dark history of the...",
            "VideoId": "C2bjjwv4134",
            "Controls": "start=209"
        },
        {
            "Text": " At this point, my body receives this information, and my lungs start relaxing. I relinquish all control, and relax completely. The pressure starts crushing me, and it doesn't feel bad at all. I even feel like I'm in a cocoon, protected. And the dive continues.",
            "Title": "The Exhilarating Peace...",
            "VideoId": "Rai3pwH3XrU",
            "Controls": "start=466"
        },
        {
            "Text": " and relinquished control of the army when he resigned his consul post. Mere optics. He used his military influence and personal wealth to stack the Senate in his favor, while retaining the powers of a tribune and the right to celebrate military triumphs.",
            "Title": "History vs. Augustus -...",
            "VideoId": "QrcmojhFmzY",
            "Controls": "start=157"
        },
        {
            "Text": " So in an ironic twist, microbial life made way for complex life, and in essence, relinquished its three-billion-year reign over the planet. Today, we humans dig up fossilized complex life and burn it for fuel.",
            "Title": "This ancient rock is...",
            "VideoId": "idfv7Lw4Y_s",
            "Controls": "start=454"
        },
        {
            "Text": " he said, \"But he could still come!\" He had assumed full ownership of this project and was not willing to relinquish it, even to me, its author. That, for me, was success.",
            "Title": "Amanda Williams: Why I...",
            "VideoId": "SMnKboI4fvY",
            "Controls": "start=672"
        },
        {
            "Text": " has been ousted which would be very unusual generally Eagles pair for life so really quite strange I'm not sure why the dark form male would relinquish this",
            "Title": "Safari Live - Day 32 PIPE...",
            "VideoId": "3GfqW--Fsow",
            "Controls": "start=4077"
        },
        {
            "Text": " and then relinquished control forever, so that natural processes could occur, and evolution run its course. This seems more acceptable,",
            "Title": "Rev. Tom Honey: How...",
            "VideoId": "2wdkxdiOFJA",
            "Controls": "start=795"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nia-vardalos.webp",
            "Text": "Our daughter was not damaged or hurt in any way. She was simply relinquished to foster care by two people who were not ready to be parents. I admire them for giving her the chance for a better life. And I am grateful they gave my husband and me the opportunity to be parents.",
            "Title": "Canadian Actress",
            "Name": "Nia Vardalos"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/pierre-poilievre.webp",
            "Text": "As prime minister, I would relinquish to citizens as much of my social, political, and economic control as possible, leaving people to cultivate their own personal prosperity and to govern their own affairs as directly as possible.",
            "Title": "Canadian Politician",
            "Name": "Pierre Poilievre"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hassan-rouhani.webp",
            "Text": "A constructive approach to diplomacy doesn't mean relinquishing one's rights. It means engaging with one's counterparts, on the basis of equal footing and mutual respect, to address shared concerns and achieve shared objectives.",
            "Title": "Iranian Leader",
            "Name": "Hassan Rouhani"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/juan-guaido.webp",
            "Text": "It's important to remember that a dictator will not freely relinquish power after having hijacked the constitution and ruled with threats and promises. Sometimes it is necessary to put enough pressure on him that he leaves.",
            "Title": "Venezuelan Politician",
            "Name": "Juan Guaido"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jessica-lange.webp",
            "Text": "The natural state of motherhood is unselfishness. When you become a mother, you are no longer the center of your own universe. You relinquish that position to your children.",
            "Title": "American Actress",
            "Name": "Jessica Lange"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jon-bon-jovi.webp",
            "Text": "Women have always ruled my life, be it my mother, my wife, my assistant, or my daughter, so I don't really fight with them. I relinquished control years ago.",
            "Title": "American Singer",
            "Name": "Jon Bon Jovi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/irvin-d-yalom.webp",
            "Text": "Sometime early in life, I developed the notion - one which I have never relinquished - that writing a novel is the very finest thing a person can do.",
            "Title": "American Psychologist",
            "Name": "Irvin D. Yalom"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/neil-young.webp",
            "Text": "To protect our freedoms, it seems we're going to have to relinquish some of our freedoms for a short period of time.",
            "Title": "Canadian Singer",
            "Name": "Neil Young"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/isabel-yosito.webp",
            "Text": "Dear is your heart and close your hand, I relinquish all to love's dysmorphic command.",
            "Title": "American Artist",
            "Name": "Isabel Yosito"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kjell-magne-bondevik.webp",
            "Text": "We must never relinquish the vision of a humane society and a humane world.",
            "Title": "Norwegian Statesman",
            "Name": "Kjell Magne Bondevik"
        }
    ]
}