{
    "currentWord": {
        "wordRoot": "rely",
        "id": 6881,
        "phonemic": "rɪˈlaɪ|rɪˈlaɪ\r",
        "bigId": "3d881afa-b499-4f7e-acba-c31d442d0fe9",
        "wordForms": [
            "relies",
            "relying",
            "relied",
            "rely"
        ]
    },
    "senses": [
        {
            "id": "3d881afa-b499-4f7e-acba-c31d442d0fe9",
            "de": "To depend on something or someone for support or help",
            "ty": "verb",
            "ex": "You can always rely on her to keep a secret",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "rely on someone",
                " rely on something",
                " rely heavily"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3d881afa-b499-4f7e-acba-c31d442d0fe9.webp",
            "Tips": [
                {
                    "title": "Emotional Bond",
                    "description": "Implying trust in someone else's abilities or character, often in a personal context.",
                    "example": "I rely on my brother for advice.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/KQerGVYC513TayFybalSJrLE1qw.webp"
                },
                {
                    "title": "Implied Necessity",
                    "description": "Suggests a strong need for the support that's being relied upon.",
                    "example": "Small businesses rely on loyal customers.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/eS066wt9WaB6d77OsXdCwdfbKNQ.webp"
                },
                {
                    "title": "Consistency Expected",
                    "description": "Often used when there’s an expectation of consistent help or support.",
                    "example": "He relies on his routine to stay organized.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/UxUE0iJWtC2o4MnNkqsbUa8WRY.webp"
                }
            ]
        },
        {
            "id": "7327e910-afb8-4b48-b37a-e47dd32ade9a",
            "de": "To feel sure that something will happen or somebody will do as expected",
            "ty": "verb",
            "ex": "She's relying on getting a raise to afford the new house",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "rely on",
                " fully rely",
                " solely rely"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/7327e910-afb8-4b48-b37a-e47dd32ade9a.webp",
            "Tips": [
                {
                    "title": "Future Expectation",
                    "description": "Used when someone is confident that an event or action will happen.",
                    "example": "I rely on the bus being on time.\r",
                    "imageUrl": ""
                },
                {
                    "title": "No Backup Plan",
                    "description": "Indicates no alternative is considered; may imply risk.",
                    "example": "She solely relies on her scholarship for tuition.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5e27305f-cec3-4238-98c5-17712b06430e",
            "de": "To trust in a law or principle",
            "do": "Legal",
            "ty": "verb",
            "ex": "The prosecutor relied on evidence from the crime scene",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "rely on evidence",
                " rely on law",
                " rely on principle"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5e27305f-cec3-4238-98c5-17712b06430e.webp",
            "Tips": [
                {
                    "title": "Legal Confidence",
                    "description": "In law, expresses trust in the strength or relevance of legal elements.",
                    "example": "Lawyers rely on robust evidence to win cases.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Technical Use",
                    "description": "Highlights a formal context where precise language is key.",
                    "example": "Judges rely on legal precedent to make rulings.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "e2c2e3d7-f8db-411a-93c0-ca44910a2c4b",
            "de": "To use as a basis or foundation for; to base something on",
            "ty": "verb",
            "ex": "The study relies on data from various sources",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "rely on data",
                " rely on facts",
                " rely on findings"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e2c2e3d7-f8db-411a-93c0-ca44910a2c4b.webp",
            "Tips": [
                {
                    "title": "Foundation of Truth",
                    "description": "Indicates reliance on empirical or proven information.",
                    "example": "Researchers rely on peer-reviewed studies.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Academic Rigor",
                    "description": "Used to reflect thorough research and credibility in academic work.",
                    "example": "His thesis relies on extensive fieldwork.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Bank on": {
            "wordRoot": "Bank on",
            "wordDefinition": "The main difference between bank on and rely is that bank on is used to express a higher level of certainty than \"rely.\" When you say that you bank on something, you are saying that you are completely counting on it to happen or be true.\n\nOn the other hand, when you say that you rely on something, it means that you are depending on it, but you are not necessarily 100% certain that it will always work out.\n\nFor example, if you say \"I'm banking on getting an A on this test,\" you are expressing complete certainty that you will get an A.\n\nIf you say \"I rely on my alarm clock to wake me up in the mornings,\" you are saying that you need your alarm clock to work, but you acknowledge that there is a chance it might not always work perfectly.\n\nBank on is used for situations where you need to express complete confidence in something, while rely is used when you are depending on something, but you are acknowledging that there is some uncertainty involved.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9d116438-decb-440d-b570-0f0f40bca0fd.webp"
        },
        "Believe in": {
            "wordRoot": "Believe in",
            "wordDefinition": "Believe in means to have faith or trust in something or someone, to accept that it exists or is true without necessarily having any evidence or proof.\n\nIt is often used in a more abstract or emotional sense, such as believing in oneself, believing in a higher power, or believing in a cause.\n\nRely means to depend on something or someone for support, help, or assistance. It implies that there is a tangible need or expectation for something to be provided, and that without it, there could be negative consequences.\n\nBelieve in is more related to personal values and beliefs, while rely is more related to practical needs and expectations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/34f95ed6-21e3-4793-a55e-cc4fd1a714fa.webp"
        },
        "Confide in": {
            "wordRoot": "Confide in",
            "wordDefinition": "The words confide in and rely both have to do with trust, but they are used in different contexts.\n\nConfide in means to trust someone with personal information or a secret. For example, you might confide in your best friend about a problem you're having.\n\nIt's a more emotional connection based on sharing feelings and personal experiences.\n\nRely means to depend on someone or something for help or support. For example, you might rely on your parents to provide for you or a teacher to help you understand a difficult subject.\n\nIt's a more practical connection based on needing assistance or resources.\n\nYou would use confide in when you want to share personal information with someone you trust, and rely when you need to depend on someone or something for help or support.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c2147dbd-fc19-4d5f-b129-cfa2b7b76d78.webp"
        },
        "Count on": {
            "wordRoot": "Count on",
            "wordDefinition": "Both count on and rely mean to depend on someone or something for support, help, or assistance.\n\nCount on is used when you expect someone or something to do what you need them to do. For example, you can count on your best friend to always be there for you when you need them.\n\nRely is used when you greatly trust someone or something to perform a task or function correctly. For example, you rely on your car to safely take you from one place to another.\n\nOverall, both words have similar meanings and can be used interchangeably, but count on implies expectation while rely suggests greater trust and dependence.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fdd31423-4394-4501-9a69-774bcce986e8.webp"
        },
        "Depend": {
            "wordRoot": "Depend",
            "wordDefinition": "Depend means to need someone or something in order to survive or function properly. For example, you might depend on your parents to provide you with food, shelter, and clothes.\n\nBoth words are similar in meaning, but depend is more about needing something to survive, while rely is more about trusting something to be there when you need it.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/1d6bcc15-f958-466b-ac2b-7a525c4e545a.webp"
        },
        "Lean on": {
            "wordRoot": "Lean on",
            "wordDefinition": "Lean on means to physically lean or rest on something for support or guidance, while rely means to depend or trust in someone or something for help or support, usually in a non-physical way.\n\nFor example, you can lean on a wall for support, but you rely on your parents for help and guidance in life. Lean on is more applicable in physical situations where support is needed, while rely is used more in emotional or mental situations where trust and dependability are important.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9140b755-5191-4d03-bc19-83698dbb541f.webp"
        },
        "Rest on": {
            "wordRoot": "Rest on",
            "wordDefinition": "The words rely and rest on mean that you are counting on something or someone for support or help.\n\nHowever, rely is more commonly used when it comes to people or things that are reliable and trustworthy. For example, you might say \"I rely on my best friend to always be there for me.\".\n\nRest on is often used when you are talking about things that are more uncertain or risky. It suggests that you are placing your hope or trust in something that may or may not come through for you.\n\nFor example, you might say \"my chances of getting into college rest on how well I do on my SATs.\"\n\nRely is used when you have faith in something or someone's abilities to deliver, while rest on is used when you are hoping for the best but aren't entirely sure of the outcome.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/74d38ab3-cf38-4e56-a556-2fa76a5bd592.webp"
        },
        "Trust": {
            "wordRoot": "Trust",
            "wordDefinition": "Trust means to have confidence in someone or something, especially that they will act honestly, with your best interests in mind, and in line with your expectations.\n\nFor example, if you trust your best friend, you believe that they will keep your secrets, be loyal to you, and support you in difficult times.\n\nIn summary, relying is when you depend on something or someone to perform a task, while trusting is when you have confidence in someone or something to act not only as required, but also in line with your expectations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f31bb5c6-e24c-46f1-8f4a-7d08d4e3fc93.webp"
        }
    },
    "videos": [
        {
            "Text": " and push fishing industries towards more sustainable practices. Past interventions have successfully helped depleted fish populations recover. There are many solutions. The best approach for each fishery must be considered based on science, respect for the local communities that rely on the ocean, and for fish as wild animals. And then the rules must be enforced.",
            "Title": "Will the ocean ever run...",
            "VideoId": "WNdR808jMSA",
            "Controls": "start=209"
        },
        {
            "Text": " As more writers come to rely on such pages for quick information, an unverified fact in a wiki page can make its way into a published article that may later be added as a citation for the very same wiki information, making it much harder to debunk. Recent advances in communication technology",
            "Title": "How false news can...",
            "VideoId": "cSKGa_7XJkg",
            "Controls": "start=149"
        },
        {
            "Text": " increase the speed and this is infuriating because we solve this problem in our personal lives at home were used to technology acting like a coach and helping us who in this room hasn't used a mapping application to coach you on how to go anywhere new the first few times we rely on health",
            "Title": "Upgrading management...",
            "VideoId": "suywTZi4FOQ",
            "Controls": "start=258"
        },
        {
            "Text": " gentle digestive system so if the cassowaries are at risk all the other plants and animals that rely on them are also in danger invasive species are now the number one threat to Australia's native wildlife they have already contributed to the extinction of",
            "Title": "Nature's Oddest Looking...",
            "VideoId": "GLPjP3hjhMM",
            "Controls": "start=512"
        },
        {
            "Text": " rooted in the nonsensical logic of the situations described. So on the one hand, it's easy to recognize the Kafkaesque in today's world. We rely on increasingly convoluted systems of administration that have real consequences on every aspect of our lives.",
            "Title": "What makes something...",
            "VideoId": "wkPR4Rcf4ww",
            "Controls": "start=244"
        },
        {
            "Text": " but it may be irrational and unpredictable. It can just as easily rally people for peace as incite them to war. Most advertising, from beauty products that promise to relieve our physical insecurities to cars that make us feel powerful, relies on pathos.",
            "Title": "How to use rhetoric to...",
            "VideoId": "3klMM9BkW5o",
            "Controls": "start=210"
        },
        {
            "Text": " in particular relies on the cassowary to germinate it goes through cassery's gut and once it's done that it is obviously food out and it is able to grow in its own little pile of casserole fertilizer australia's wildlife is found nowhere",
            "Title": "Filming The World's...",
            "VideoId": "SuVjOqtcHxE",
            "Controls": "start=332"
        },
        {
            "Text": " We throw out historical symbols, we rely on new, computer-aided design techniques, and we come up with new compositions, forms crashing into forms. This is academic and heady stuff, it's super unpopular, we totally alienate you.",
            "Title": "Why the buildings of the...",
            "VideoId": "hha0NsYXS5c",
            "Controls": "start=432"
        },
        {
            "Text": " With such delicate bodies, they rely on thousands of venom-containing stinging cells called cnidocytes for protection and prey capture. Even baby jellyfish, the size of a pencil eraser, have the ability to sting.",
            "Title": "How does a jellyfish...",
            "VideoId": "Pu_ijC8HFRU",
            "Controls": "start=27"
        },
        {
            "Text": " completely helpless speaking of grocery shopping the centipede relies on ground vibrations and antennae touch to locate a feast like this one mom senses danger and races to the rescue",
            "Title": "Giant Centipede PIPE...",
            "VideoId": "TzF0GKfOvRY",
            "Controls": "start=144"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-barkley.webp",
            "Text": "Poor people cannot rely on the government to come to help you in times of need. You have to get your education. Then nobody can control your destiny.",
            "Title": "American Baseball Player",
            "Name": "Charles Barkley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-abagnale.webp",
            "Text": "You cannot rely on the police, you cannot rely on the government, you cannot rely on the bank to protect you.",
            "Title": "American Celebrity",
            "Name": "Frank Abagnale"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/epictetus.webp",
            "Text": "Neither should a ship rely on one small anchor, nor should life rest on a single hope.",
            "Title": "Greek Philosopher",
            "Name": "Epictetus"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-jefferson.webp",
            "Text": "Advertisements contain the only truths to be relied on in a newspaper.",
            "Title": "American President",
            "Name": "Thomas Jefferson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lwren-scott.webp",
            "Text": "It's so important your customer can rely on you for your classics.",
            "Title": "American Designer",
            "Name": "L'Wren Scott"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luis-suarez.webp",
            "Text": "It's important for the team not to be relying on one player.",
            "Title": "Uruguayan Athlete",
            "Name": "Luis Suarez"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joshua-wong.webp",
            "Text": "The fight for democracy relies on community support.",
            "Title": "Chinese Activist",
            "Name": "Joshua Wong"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/james-wan.webp",
            "Text": "We live in a world that relies on technology.",
            "Title": "Australian Producer",
            "Name": "James Wan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-cobden.webp",
            "Text": "Luck relies on chance, labor on character.",
            "Title": "British Businessman",
            "Name": "Richard Cobden"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/malala-yousafzai.webp",
            "Text": "You cannot rely on other people's support.",
            "Title": "Pakistani Activist",
            "Name": "Malala Yousafzai"
        }
    ]
}