{
    "currentWord": {
        "wordRoot": "responsibility",
        "id": 13332,
        "phonemic": "rɪˌspɒnsəˈbɪləti|rɪˌspɑːnsəˈbɪləti\r",
        "bigId": "e1aa0157-7e04-42ef-931f-32e1822a0685",
        "wordForms": [
            "responsibilities",
            "responsibility"
        ]
    },
    "senses": [
        {
            "id": "e1aa0157-7e04-42ef-931f-32e1822a0685",
            "de": "The state or fact of having a duty to deal with something or of having control over someone.",
            "ty": "noun",
            "ex": "A true leader takes responsibility for their team's performance.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "take responsibility",
                " have responsibility",
                " shift responsibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e1aa0157-7e04-42ef-931f-32e1822a0685.webp",
            "Tips": [
                {
                    "title": "Positive Leadership",
                    "description": "Associated with proactive control or support within a group or task.",
                    "example": "As project leader, the responsibility to motivate her team fell squarely upon her.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/cO8zh6o8g4oq3JwRMbrQGnI0ShI.webp"
                },
                {
                    "title": "Active Engagement",
                    "description": "Implies being actively involved, not passively watching from the sidelines.",
                    "example": "He took on the responsibility of organizing the charity event himself.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/nwxM1JNXeTN2TpcGdAWkGZI.webp"
                }
            ]
        },
        {
            "id": "d73a9901-4072-425c-abf6-e18fa205bf4c",
            "de": "The state or fact of being accountable or to blame for something.",
            "ty": "noun",
            "ex": "The responsibility for the accident lies with the driver.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "bear responsibility",
                " accept responsibility",
                " assign responsibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d73a9901-4072-425c-abf6-e18fa205bf4c.webp",
            "Tips": [
                {
                    "title": "Blame and Consequences",
                    "description": "Carries a sense of moral or legal weight when something goes wrong.",
                    "example": "The company took full responsibility for the data breach.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Accepting Fault",
                    "description": "Often involves admitting mistakes and facing the repercussions.",
                    "example": "After the misunderstanding, Sam accepted responsibility and apologized.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "9e488c51-6b0f-4d15-97a7-2ab69da71d40",
            "de": "A moral obligation to behave correctly towards or in respect of.",
            "ty": "noun",
            "ex": "She had the responsibility of looking after her sick mother.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "shoulder responsibility",
                " neglect responsibility",
                " evade responsibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9e488c51-6b0f-4d15-97a7-2ab69da71d40.webp",
            "Tips": [
                {
                    "title": "Moral Duty",
                    "description": "Suggests an ethical commitment to do the right thing in social situations.",
                    "example": "He felt the responsibility to report the lost wallet he found.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Caring for Others",
                    "description": "Highlights altruism and helping those who depend on us.",
                    "example": "Taking responsibility for her younger sibling, Jane walked her to school daily.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "21be4989-ecff-4eb0-bbc1-1852dfc8c926",
            "de": "The opportunity or ability to act independently and make decisions without authorization.",
            "ty": "noun",
            "ex": "We would like to give team members more responsibility in projects.",
            "use": "",
            "co": "Business",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "delegate responsibility",
                " grant responsibility",
                " assume responsibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/21be4989-ecff-4eb0-bbc1-1852dfc8c926.webp",
            "Tips": [
                {
                    "title": "Self-Directed",
                    "description": "Implies trust and confidence from others to make your own choices.",
                    "example": "With his newfound responsibility, Jake planned the project's stages independently.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Empowering",
                    "description": "Feels liberating, allowing personal growth and self-reliance.",
                    "example": "She embraced the responsibility of leading the research team, empowering her to innovate.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "81a66539-fae4-4b92-918c-ab1ac6086373",
            "de": "Something that it is your job or duty to deal with.",
            "ty": "noun",
            "ex": "Health and safety is everyone's responsibility at the workplace.",
            "use": "",
            "co": "Workplace",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "employer responsibility",
                " employee responsibility",
                " corporate responsibility"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/81a66539-fae4-4b92-918c-ab1ac6086373.webp",
            "Tips": [
                {
                    "title": "Professional Duties",
                    "description": "Refers to tasks and roles that are expected in a job setting.",
                    "example": "Understanding his responsibilities, the security guard kept vigilant watch.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Shared Accountability",
                    "description": "In a workplace, responsibilities are often divided among team members.",
                    "example": "In our department, the responsibility for customer service is shared among staff.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Accountability": {
            "wordRoot": "Accountability",
            "wordDefinition": "Accountability and responsibility both refer to being responsible for something, but there is a difference.\n\nAccountability refers to being answerable or responsible for something. It involves consequences if the task or duty is not completed.\n\nAccountability involves being transparent, owning up to any mistakes, and taking responsibility for the outcomes.\n\nIn essence, responsibility is about fulfilling tasks or duties, whereas accountability is about taking responsibility for the outcomes, good or bad.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0e4b457c-1f1f-4895-8c98-ebccae721e68.webp"
        },
        "Burden": {
            "wordRoot": "Burden",
            "wordDefinition": "Burden refers to something that is heavy or difficult to handle, such as a problem or a task that feels overwhelming.\n\nBurden refers to something negative that is difficult to handle while responsibility refers to something positive that one should take care of.\n\nThe term burden can be used when someone feels weighed down by something unpleasant, while responsibility can be applied when someone is expected to do something important or necessary.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/43769e46-bf98-4b00-88a8-5411156fb918.webp"
        },
        "Charge": {
            "wordRoot": "Charge",
            "wordDefinition": "Charge generally refers to a specific task or duty that someone is assigned to do. It implies a more short-term or immediate responsibility, such as taking charge of a project or charging someone with a certain task.\n\nCharge tends to have a more focused and specific meaning, while responsibility is a broader and more overarching concept.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0ce82455-58ee-4af7-8e72-5c206b8731ac.webp"
        },
        "Commitment": {
            "wordRoot": "Commitment",
            "wordDefinition": "Commitment refers to a strong dedication or promise to a particular task or goal. For example, committing to going to the gym every day shows a strong dedication to fitness.\n\nCommitment can also apply to personal relationships such as promising to be loyal to a friend.\n\nBoth commitment and responsibility are important qualities to possess in different situations. While commitment is applicable in situations that involve personal dedication, responsibility is vital in situations of accountability and ownership.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2f647871-5fd1-40e5-830c-b930c2d65a92.webp"
        },
        "Duty": {
            "wordRoot": "Duty",
            "wordDefinition": "Duty refers to a task or job that someone is expected to do, often because it is part of their job or position. For example, a soldier has a duty to serve their country and follow orders.\n\nDuty is more specific to a particular role or task, while responsibility is a broader concept that encompasses a range of obligations that people have in their lives.\n\nHowever, both duty and responsibility involve a sense of obligation or duty to others or to society, and both are important for individuals to fulfill in order to be productive and contributing members of their communities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cfe1420e-b26e-4f5c-8633-1f0170966fe2.webp"
        },
        "Liability": {
            "wordRoot": "Liability",
            "wordDefinition": "Liability refers to legal or financial accountability for something. For example, if a person causes an accident, they may be liable for damages or compensation.\n\nLiability is often associated with legal and financial consequences.\n\nBoth words can be applicable in various contexts, but liability is usually associated with legal and financial consequences, while responsibility is more related to moral and personal obligations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ff76edeb-7ee4-47cf-a2fd-d9ad42183f31.webp"
        },
        "Mandate": {
            "wordRoot": "Mandate",
            "wordDefinition": "Mandate refers to an official order or command given to someone by an authority figure or a governing body to carry out a task or duty.\n\nSimply put, a mandate is an order while responsibility is a duty.\n\nA mandate is imposed while responsibility is expected.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b85487a1-afa7-46de-916b-5727ead53c04.webp"
        },
        "Obligation": {
            "wordRoot": "Obligation",
            "wordDefinition": "Obligation refers to something that one is required to do or is bound to do by law or social contract, such as paying taxes or following traffic rules.\n\nIt is a duty that must be fulfilled as a matter of legal or moral obligation.\n\nWhile both words refer to duties or duties, obligation usually applies to duties imposed by external forces, such as laws or rules, while responsibility often refers to an internal sense of duty or obligation.\n\nFor example, paying taxes is an obligation because it is required by law, while caring for a pet is a responsibility because it is a personal duty to ensure the well-being of the animal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a56fcd05-e7ab-4e4c-9029-262fa52f9a98.webp"
        },
        "Onus": {
            "wordRoot": "Onus",
            "wordDefinition": "Onus refers to a burden or obligation placed on someone, often used to imply a sense of duty or accountability. For example, the onus is on the government to ensure the safety of its citizens during times of crisis.\n\nWhile the two words have some overlap, onus tends to focus on the burden of fulfilling a duty, while responsibility is more broad and encompasses holding oneself accountable for actions and outcomes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f0d2d67e-d789-446f-b5a1-391dae8c7d40.webp"
        },
        "Stewardship": {
            "wordRoot": "Stewardship",
            "wordDefinition": "Stewardship refers to taking care of something for the benefit of others, often involving a sense of accountability and responsible management.\n\nStewardship can be applicable in various settings, such as environmental stewardship (taking care of the planet for future generations), community stewardship (taking care of the well-being of others in the community), or financial stewardship (responsibly managing money for the benefit of others).",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6b5ccd1b-045f-4389-8f0a-4fef1a407017.webp"
        }
    },
    "videos": [
        {
            "Text": " At the Passover meal, every item on the menu symbolizes an aspect of the escape from slavery. The importance of growing up is emphasized when young people reach the age of bar and bat mitzvah, ceremonies during which they assume responsibility for their actions and celebrate the weaving of their own lives",
            "Title": "The five major world...",
            "VideoId": "m6dCxo7t_aE",
            "Controls": "start=225"
        },
        {
            "Text": " and allow you to feel the landscape so, so your job here is really important. It is. In my family there's four generations who have all guided, we have become kaitiaki or guardians, of all the areas, so it’s our responsibility to take care of our whenua, to take care of our land.",
            "Title": "Exploring the Bay of...",
            "VideoId": "cA5cX1YuuGA",
            "Controls": "start=71"
        },
        {
            "Text": " write, and dance, which taught them graceful control of their movements and helped them in combat. While the responsibilities for the girls of Sparta were different, the high standards of excellence and expectation to serve Sparta with their lives remained the same.",
            "Title": "This is Sparta: Fierce...",
            "VideoId": "M7V1a1I5BL0",
            "Controls": "start=184"
        },
        {
            "Text": " information or context you might have missed and what others are saying about it. Today, we are more free than ever from the old media gatekeepers who used to control the flow of information. But with freedom comes the responsibility to curate our own experience",
            "Title": "How to choose your news...",
            "VideoId": "q-Y-z6HmRgI",
            "Controls": "start=245"
        },
        {
            "Text": " that would be a bad example so I felt an incredible responsibility in some way to make sure that whatever I you know I believed was continuous and that I could stand by it and and that's my story if you like I don't have stood by it since",
            "Title": "A message of peace, hope...",
            "VideoId": "Ec2lto9dPo4",
            "Controls": "start=128"
        },
        {
            "Text": " Germany had to accept full responsibility for the war and pay reparations, debilitating its already weakened economy. All this was seen as a humiliation by many nationalists and veterans. They wrongly believed the war could have been won",
            "Title": "How did Hitler rise to...",
            "VideoId": "jFICRFKtAc4",
            "Controls": "start=54"
        },
        {
            "Text": " where almost everything is shared. At the other extreme, sometimes our attachment to our things can go too far. Part of the cause of hoarding disorder is an exaggerated sense of responsibility and protectiveness toward one's belongings.",
            "Title": "Why are we so attached...",
            "VideoId": "H2_by0rp5q0",
            "Controls": "start=213"
        },
        {
            "Text": " And that distinction is important. And Nick, he needs to hold vigil for the relationship. He needs to become, for a while, the protector of the boundaries. It's his responsibility to bring it up, because if he thinks about it,",
            "Title": "Rethinking infidelity...",
            "VideoId": "P2AUat93a8Q",
            "Controls": "start=1032"
        },
        {
            "Text": " yes but you've taken on a responsibility so you just have to get up with it the outlets have a long way to go before they transform into magnificent super powered owls",
            "Title": "Mesmerising Owl Moments...",
            "VideoId": "Y-1d5zdeg9A",
            "Controls": "start=163"
        },
        {
            "Text": " about that surely we have a responsibility to care for our blue planet the future of humanity and indeed all life",
            "Title": "Sir David Attenborough...",
            "VideoId": "leDm_-nfr2w",
            "Controls": "start=1521"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/leo-tolstoy.webp",
            "Text": "War on the other hand is such a terrible thing, that no man, especially a Christian man, has the right to assume the responsibility of starting it.",
            "Title": "Russian Novelist",
            "Name": "Leo Tolstoy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/khalil-gibran.webp",
            "Text": "Friendship is always a sweet responsibility, never an opportunity.",
            "Title": "Lebanese Poet",
            "Name": "Khalil Gibran"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jordan-peterson.webp",
            "Text": "Accept the terrible responsibility of life with eyes wide open.",
            "Title": "Canadian Psychologist",
            "Name": "Jordan Peterson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/les-brown.webp",
            "Text": "You take on the responsibility for making your dream a reality.",
            "Title": "American Speaker",
            "Name": "Les Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/toni-morrison.webp",
            "Text": "Somebody has to take responsibility for being a leader.",
            "Title": "American Novelist",
            "Name": "Toni Morrison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/future.webp",
            "Text": "I feel a responsibility for telling the truth.",
            "Title": "American Musician",
            "Name": "Future"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/winston-churchill.webp",
            "Text": "The price of greatness is responsibility.",
            "Title": "British Statesman",
            "Name": "Winston Churchill"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tony-robbins.webp",
            "Text": "Whatever happens, take responsibility.",
            "Title": "American Speaker",
            "Name": "Tony Robbins"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/w-edwards-deming.webp",
            "Text": "Quality is everyone's responsibility.",
            "Title": "American Scientist",
            "Name": "W. Edwards Deming"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/william-butler-yeats.webp",
            "Text": "In dreams begins responsibility.",
            "Title": "Irish Poet",
            "Name": "William Butler Yeats"
        }
    ]
}