{
    "currentWord": {
        "wordRoot": "revise",
        "id": 11414,
        "phonemic": "rɪˈvaɪz|rɪˈvaɪz\r",
        "bigId": "58b6aaf2-ab96-4d37-be86-d6b86b52fcfd",
        "wordForms": [
            "revises",
            "revising",
            "revised",
            "revise"
        ]
    },
    "senses": [
        {
            "id": "58b6aaf2-ab96-4d37-be86-d6b86b52fcfd",
            "de": "To change something to improve or make it more accurate.",
            "ty": "verb",
            "ex": "She revised her paper for her final class project.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "revise a plan",
                " revise a paper",
                " revise an opinion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/58b6aaf2-ab96-4d37-be86-d6b86b52fcfd.webp",
            "Tips": [
                {
                    "title": "Improvement Focus",
                    "description": "To revise means focusing on making something better or more accurate, not just making any change.",
                    "example": "She revised her thesis to sharpen her argument.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/oOmcE0O74rdR0b0OkuCVwRQPgpk.webp"
                },
                {
                    "title": "Not Always Big Changes",
                    "description": "Revisions can be minor, such as tweaking words for clarity, not only big alterations.",
                    "example": "He revised the document’s wording for better flow.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/L8N38YtrdeKJ8Vde0PcckZurX2I.webp"
                },
                {
                    "title": "Constructive Process",
                    "description": "Think of revising as constructive criticism of your own work to reach perfection.",
                    "example": "They revised their business proposal to ensure success.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tTeFcJCgowiQZvPdCdocqJAjwA.webp"
                }
            ]
        },
        {
            "id": "53b40d63-4aaf-48a2-a540-72a440f58b0b",
            "de": "To read and correct or improve a piece of writing.",
            "ty": "verb",
            "ex": "He revised his novel over a hundred times before publication.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "revise a manuscript",
                " revise a script",
                " revise an essay"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/53b40d63-4aaf-48a2-a540-72a440f58b0b.webp",
            "Tips": [
                {
                    "title": "Detailed Examination",
                    "description": "When you revise a piece of writing, you examine every detail, not just the general idea.",
                    "example": "He revised the article for grammatical errors.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Just Spelling",
                    "description": "Revising includes checking the flow, style, and coherence of the text, not just spelling or grammar.",
                    "example": "She revised her speech to improve its pacing.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Read Aloud Method",
                    "description": "Reading your writing aloud is a technique for revising to catch errors you might otherwise miss.",
                    "example": "He revised his report by reading it out loud.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "11fbecc4-8730-46ab-9c4e-49deaa981c71",
            "de": "To study again something you have learned, especially for an exam.",
            "ty": "verb",
            "ex": "Are you revising for the English exam?",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "revise for a test",
                " revise a subject",
                " revise a topic"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/11fbecc4-8730-46ab-9c4e-49deaa981c71.webp",
            "Tips": [
                {
                    "title": "Exam Preparation",
                    "description": "Revising for exams means actively engaging with the material, not passive re-reading.",
                    "example": "He revised his notes by creating flashcards.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Systematic Approach",
                    "description": "Have a plan for revising, like focusing on weak subjects first or using practice tests.",
                    "example": "She revised math by solving previous years' papers.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Mix Learning Methods",
                    "description": "Use different techniques like summarizing, teaching others, or quizzing to revise effectively.",
                    "example": "To revise history, he taught the key events to his friend.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Amend": {
            "wordRoot": "Amend",
            "wordDefinition": "Amend means to make a minor change or correction while the word revise means to make more significant changes or improvements.\n\nFor instance, if you have a paper that needs a few small changes like correcting grammar, punctuation, or spelling errors, you would amend the paper.\n\nAmend is used when you make a small change or correction, while revise is used when you make significant or major changes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c1827fc1-cc32-49ca-93d3-7e861a97945d.webp"
        },
        "Correct": {
            "wordRoot": "Correct",
            "wordDefinition": "Correct means to make something right or accurate.\n\nIt is typically used when there is an error or mistake in something and it needs to be fixed. For example, if there is a spelling mistake in an essay, you would correct it.\n\nSo, in short, correct is used to fix mistakes, while revise is used to make changes or improvements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8da0e1dc-72d8-489a-a023-b7e783501afa.webp"
        },
        "Edit": {
            "wordRoot": "Edit",
            "wordDefinition": "The main difference between edit and revise is their focus. Editing typically refers to the process of making small changes to improve the clarity, grammar, and style of a piece of writing.\n\nFor example, an editor might correct spelling errors or suggest better word choices to make a sentence more clear. A revision, however, might involve adding or deleting entire paragraphs to improve the flow of an essay or reorganizing the structure of a story to create a more compelling plot.\n\nIn short, editing focuses on fine-tuning the details, while revision involves making more substantial changes to improve the overall quality of a piece of writing.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7da75aa9-f8ec-45ed-b8d5-1b27cbe04353.webp"
        },
        "Improve": {
            "wordRoot": "Improve",
            "wordDefinition": "Improve means to make something better, often by adding or enhancing its existing features. For example, if you want to improve your grades in school, you might study more or ask your teacher for extra help.\n\nImprove is applicable when you want to enhance something that already exists, while revise is useful when you need to make changes to something to improve its quality or accuracy.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/63b01303-49f7-4564-9030-12f8b6e51cc2.webp"
        },
        "Modify": {
            "wordRoot": "Modify",
            "wordDefinition": "Modify refers to making small changes or adjustments to something, without completely overhauling it. Think of it like adding a few finishing touches to a project you've already completed.\n\nModify can be used when you need to make slight adjustments to something that is already good but needs some tweaking, while revise is more appropriate when you need to make bigger changes to improve something that is not quite up to standard.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/101bd1c5-9840-4d7b-9c0a-1dced4f7abf6.webp"
        },
        "Reconsider": {
            "wordRoot": "Reconsider",
            "wordDefinition": "Reconsider means to think again about something in order to make a new decision or judgment. It is applicable when you need to change your initial opinion or decision after giving it some more thought.\n\nTo summarize, you reconsider when you need to change your opinion or decision, and you revise when you need to change something you have already created or planned.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/495fab9f-003d-48c2-9b71-dc923a09c92f.webp"
        },
        "Rectify": {
            "wordRoot": "Rectify",
            "wordDefinition": "Rectify means to correct or make something right that was wrong before. For example, if a student receives the wrong grade on an assignment and the teacher changes it to the correct one, the teacher has rectified the situation.\n\nRectify is used when something needs to be corrected or fixed, while revise is used when something needs to be improved or modified.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cbe9d4de-654c-4773-b097-f777f6427e7b.webp"
        },
        "Refine": {
            "wordRoot": "Refine",
            "wordDefinition": "The difference between the words refine and revise is that refine means to improve, perfect or make something more precise, while revise means to make changes, corrections or improvements to something, typically written or oral material.\n\nIf you wanted to refine your writing, you would focus more on making it more polished, choosing just the right words and adjusting the details so that everything fits together and flows perfectly.\n\nRevise is more focused on making changes or edits to something, while refine is more about making it better or more impressive in some way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ba424c78-4955-45f4-9682-f0e76561942e.webp"
        },
        "Rewrite": {
            "wordRoot": "Rewrite",
            "wordDefinition": "Rewrite means to completely redo something that has already been written, usually because it needs significant improvements, or because it's being adapted for a different purpose or audience.\n\nRevise is appropriate when you want to improve an existing work by tweaking things here and there, while rewrite is more appropriate when the original work needs a complete overhaul in order to meet a new set of requirements or goals.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fbf51f54-5d2a-441f-9310-6d1b3e16220b.webp"
        },
        "Update": {
            "wordRoot": "Update",
            "wordDefinition": "Update means to make changes or improvements to something, but it is typically a smaller change. Updating something usually means making adjustments to keep it working properly or to make sure it's up-to-date.\n\nA website might be updated regularly to keep it current with new information, but it wouldn't necessarily require a complete overhaul.\n\nRevise is used when you want to make major changes while update is used when you want to make small changes or keep something current.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0fc00ef1-0968-4ca9-ae1f-5cea5ecd12f2.webp"
        }
    },
    "videos": [
        {
            "Text": " it's from the brain scientist gary marcus he says the initial organization of the brain does not depend that much on experience nature provides a first draft which experience then revises built-in doesn't mean unmalleable it means organized in advance of experience okay so what's on the first draft of the moral mind to find out um my my colleague craig joseph and i",
            "Title": "The moral roots of...",
            "VideoId": "8SOQduoLgRw",
            "Controls": "start=300"
        },
        {
            "Text": " Research has shown that crowds are wise when there's independent thinking. This why the wisdom of the crowds can be destroyed by peer pressure, publicity, social media, or sometimes even simple conversations that influence how people think. On the other hand, by talking, a group could exchange knowledge, correct and revise each other",
            "Title": "How can groups make good...",
            "VideoId": "JrRRvqgYgT0",
            "Controls": "start=13"
        },
        {
            "Text": " with conditional probabilities that they're revising to figure out how the world works. All right, now that might seem like an even taller order to actually demonstrate. Because after all, if you ask even grownups about statistics, they look extremely stupid. How could it be that children are doing statistics?",
            "Title": "Alison Gopnik: What do...",
            "VideoId": "cplaWsiu7Yg",
            "Controls": "start=591"
        },
        {
            "Text": " Scholars are discovering evidence that stories shape culture, and that much of what we believe about life comes not from fact, but from fiction - that our ideas of class, marriage and even gender are relatively new, and that many ideologies which held fast for centuries were revised within the 18th century,",
            "Title": "How fiction can change...",
            "VideoId": "ctaPAm14L10",
            "Controls": "start=55"
        },
        {
            "Text": " I can help people to sort out what they want to do, but I can't make their life choices for them. Only you can write your story, and all you need are some tools. So what I want to do is I want to edit this woman's letter together, right here, as a way to show how we can all revise our stories.",
            "Title": "How changing your story...",
            "VideoId": "O_MQr4lHm0c",
            "Controls": "start=512"
        },
        {
            "Text": " was the ultimate spiritual authority. Plus, he criticized the Church for selling indulgences, the practice of purchasing forgiveness of one's sins by giving money to the Church. Luther believed the Church needed to revise its doctrine by returning to the Bible's teachings",
            "Title": "History 101: The...",
            "VideoId": "IATyzSAjC1w",
            "Controls": "start=98"
        },
        {
            "Text": " and support policies they agree with. But partisan-based cognitive dissonance can lead people to reject evidence that’s inconsistent with the party line or discredits party leaders. And when entire groups of people revise the facts in service of partisan beliefs,",
            "Title": "Do politics make us...",
            "VideoId": "8yOoOL9PC-o",
            "Controls": "start=203"
        },
        {
            "Text": " Life necessitates a universal world, however, we believe in the security of having a local identity. And this is what the leaders of this region are trying to do. We're trying to be part of this global village, but at the same time we're revising ourselves",
            "Title": "Sheikha Al Mayassa:...",
            "VideoId": "nItwVO9stX8",
            "Controls": "start=140"
        },
        {
            "Text": " And if that can be our generation's enduring legacy -- that we took responsibility for the thinking that had been handed down to us, that we revisited it, we revised it,",
            "Title": "The way we think about...",
            "VideoId": "bfAzi6D5FpM",
            "Controls": "start=1079"
        },
        {
            "Text": " was outside realized that last year the president human didn't I to revise our territory because they say death is not the accordance with the laws but in",
            "Title": "Brazil’s indigenous...",
            "VideoId": "1D8_fvtGHhA",
            "Controls": "start=503"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sun-yat-sen.webp",
            "Text": "The government should help and guide the weak and small racial groups within its national boundaries toward self-determination and self-government. It should offer resistance to foreign aggression, and simultaneously, it should revise foreign treaties in order to restore our equality and independence among the nations.",
            "Title": "Chinese Leader",
            "Name": "Sun Yat-sen"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yusef-komunyakaa.webp",
            "Text": "Students often have such a lofty idea of what a poem is, and I want them to realize that their own lives are where the poetry comes from. The most important things are to respect the language; to know the classical rules, even if only to break them; and to be prepared to edit, to revise, to shape.",
            "Title": "American Poet",
            "Name": "Yusef Komunyakaa"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maria-semple.webp",
            "Text": "I keep an elaborate calendar for my characters detailing on which dates everything happens. I'm constantly revising this as I go along. It gives me the freedom to intricately plot my story, knowing it will at least hold up on a timeline.",
            "Title": "American Novelist",
            "Name": "Maria Semple"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hallie-ephron.webp",
            "Text": "When you put your characters in a dire situation, they often do things that surprise even you, so you have to go back and revise your original conception of who they are.",
            "Title": "American Novelist",
            "Name": "Hallie Ephron"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shoshana-zuboff.webp",
            "Text": "Awareness requires a rupture with the world we take for granted; then old categories of experience are called into question and revised.",
            "Title": "American Educator",
            "Name": "Shoshana Zuboff"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elizabeth-mccracken.webp",
            "Text": "Revising stuff lately, I was shocked to see how often my characters scratched their ankles, felt their feet, and touched their own ears.",
            "Title": "American Author",
            "Name": "Elizabeth McCracken"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/susan-campbell-bartoletti.webp",
            "Text": "When I create a character, it happens in layers. The more I write and revise, the better I understand the characters.",
            "Title": "American Writer",
            "Name": "Susan Campbell Bartoletti"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wentworth-miller.webp",
            "Text": "I revise obsessively. It's important to me to have a clean page.",
            "Title": "English Actor",
            "Name": "Wentworth Miller"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nancy-thayer.webp",
            "Text": "It's never too late - in fiction or in life - to revise.",
            "Title": "American Writer",
            "Name": "Nancy Thayer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/terry-gross.webp",
            "Text": "I don't want to help a politician revise the truth.",
            "Title": "American Journalist",
            "Name": "Terry Gross"
        }
    ]
}