{
    "currentWord": {
        "wordRoot": "separate",
        "id": 4349,
        "phonemic": "ˈseprət|ˈseprət\r",
        "bigId": "3476e4d4-f1bd-49ed-93bd-3d0a9bb05d6b",
        "wordForms": [
            "separates",
            "separating",
            "separated",
            "separately",
            "separateness",
            "separator",
            "separation",
            "separate"
        ]
    },
    "senses": [
        {
            "id": "3476e4d4-f1bd-49ed-93bd-3d0a9bb05d6b",
            "de": "to make or become distinct or apart",
            "ty": "verb",
            "ex": "Let's separate the light clothes from the dark before washing them.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "separate from",
                " separate into",
                " separate out"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/3476e4d4-f1bd-49ed-93bd-3d0a9bb05d6b.webp",
            "Tips": [
                {
                    "title": "Physical Separation",
                    "description": "Often describes separating objects or items based on characteristics.",
                    "example": "Please separate the recyclables from the trash.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/o3sni2wUXB5uDTwn2PGU3mFc.webp"
                },
                {
                    "title": "Process Orientation",
                    "description": "Can imply a process or steps to sort things or people.",
                    "example": "The teacher asked us to separate into groups according to our project topics.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tLDHOTmrgT2BdbDoqsgxclvY.webp"
                }
            ]
        },
        {
            "id": "9a0f4aff-a63b-4b63-8f89-869bc57182ea",
            "de": "to disunite, to part, to divorce",
            "ty": "verb",
            "ex": "After years of unhappiness, they decided to separate.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "separate from",
                " separate ways",
                " live separate lives"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9a0f4aff-a63b-4b63-8f89-869bc57182ea.webp",
            "Tips": [
                {
                    "title": "End of Union",
                    "description": "Used to describe a wide range of disunions, not just in personal relationships.",
                    "example": "The business partners decided to separate and go their own ways.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Euphemism",
                    "description": "Sometimes used to delicately refer to a divorce or breakup.",
                    "example": "My aunt and uncle are separating after 15 years of marriage.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "886bac0f-e029-4232-9ee9-72f6ed7bd72a",
            "de": "not attached or united, different",
            "ty": "adjective",
            "ex": "They sleep in separate beds.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "separate room",
                " separate space",
                " separate entity"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/886bac0f-e029-4232-9ee9-72f6ed7bd72a.webp",
            "Tips": [
                {
                    "title": "Physical Space",
                    "description": "Highlights being in different locations or spaces.",
                    "example": "During the exam, each student had a separate desk.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Independent Existence",
                    "description": "Shows something operates or exists independently from others.",
                    "example": "The new company will function as a separate entity from the parent corporation.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "99cfbfa7-331c-4dbb-9f1d-a95411aac6d9",
            "de": "to distinguish, to treat differently",
            "do": "Academic",
            "ty": "verb",
            "ex": "It's hard to separate fact from fiction in his stories.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "separate fact",
                " separate from",
                " separate into"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/99cfbfa7-331c-4dbb-9f1d-a95411aac6d9.webp",
            "Tips": [
                {
                    "title": "Intellectual Effort",
                    "description": "Indicates differentiating or making distinctions in thought or analysis.",
                    "example": "In science, it's crucial to separate observations from interpretations.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "77e7dc36-f058-4d11-a47f-6f82634e7023",
            "de": "to separate a substance into its components",
            "do": "Medical",
            "ty": "verb",
            "ex": "The lab technician separated the blood into its components.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "separate into",
                " separate from",
                " separate out"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/77e7dc36-f058-4d11-a47f-6f82634e7023.webp",
            "Tips": [
                {
                    "title": "Extraction Process",
                    "description": "Refers to dividing a mixture into basic parts for examination or use.",
                    "example": "To study the samples, we must first separate the cells from the plasma.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Medical Context",
                    "description": "In medicine, it often involves a precision specific to lab or clinical contexts.",
                    "example": "The surgeon will separate the damaged tissue from the healthy tissue.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Detach": {
            "wordRoot": "Detach",
            "wordDefinition": "The words detach and separate both mean to pull or break something apart, but they are used in slightly different situations.\n\nDetach describes taking something off or away from another thing. For example, you might detach a key from a keyring or detach a document from a larger file.\n\nDetach is more specific and implies that two things were connected before, while separate is a more general term used to describe anything that is no longer together.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8459d533-3cb3-4b78-8f5a-07e7f090bb5e.webp"
        },
        "Disconnect": {
            "wordRoot": "Disconnect",
            "wordDefinition": "Disconnect means to separate or break a connection between two things, so they are no longer linked or communicating with each other.\n\nFor example, you disconnect a phone call, meaning you end the connection between yourself and the person you were talking to.\n\nDisconnect applies to breaking connections, while separate applies to physically dividing or moving things apart.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0f0c88d2-5598-4bc6-8ff3-d2c70ef24647.webp"
        },
        "Disengage": {
            "wordRoot": "Disengage",
            "wordDefinition": "Disengage means to disconnect, detach or withdraw from something or someone. It typically refers to removing oneself from a situation or relationship.\n\nFor example, disengaging from a conversation, disengaging from a toxic relationship, or disengaging from a fight.\n\nDisengage is used when referring to detaching oneself from a situation or relationship while separate is used when referring to dividing or splitting tangible objects or entities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/36eb4357-1ef6-4052-bcf6-bbf6b805351d.webp"
        },
        "Distinguish": {
            "wordRoot": "Distinguish",
            "wordDefinition": "Distinguish means to recognize the difference between two or more things or to identify the unique qualities or characteristics of something.\n\nFor example, we might distinguish between two different types of birds, or we might distinguish between two similar but distinct ideas.\n\nDistinguish is used when we want to identify differences or unique qualities between two or more things, while separate is used when we want to divide or split something into distinct parts or keep something apart from something else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/bae6d370-8693-4ea5-a478-8b87618e053a.webp"
        },
        "Divide": {
            "wordRoot": "Divide",
            "wordDefinition": "Divide means to break something into parts or portions, while separate means to set apart, detach, or isolate something.\n\nFor example, we divide an apple into equal pieces to share it among friends. On the other hand, we separate two different types of fruits or vegetables to store them separately as they may spoil each other.\n\nDivide is used when we want to allocate or distribute something, while separate is used when we want to isolate or distinguish something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/47196dda-4ace-43dd-b291-5958c9c66cb1.webp"
        },
        "Isolate": {
            "wordRoot": "Isolate",
            "wordDefinition": "The words isolate and separate both mean to keep things apart from one another, but they have slightly different meanings.\n\nIsolate usually means to keep something or someone alone or away from others, often for the purpose of protection or study.\n\nFor example, doctors might isolate a patient with a contagious disease to prevent it from spreading to others.\n\nIsolate is used when the focus is on keeping something or someone protected or contained, while separate is used when the focus is on organizing or dividing different things or groups.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a547d09e-0155-4998-af18-4e992bf8950b.webp"
        },
        "Segregate": {
            "wordRoot": "Segregate",
            "wordDefinition": "Segregate means to keep things or people apart because of differences such as race or religion. It has negative connotations because it implies discrimination or prejudice.\n\nFor example, in the past, some schools would segregate students based on their race, which was unfair.\n\nSegregate has negative connotations and implies discrimination, while separate is neutral and simply means dividing things or people into different groups.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/58d22242-995c-4821-b266-e8b458a5ffed.webp"
        },
        "Sift": {
            "wordRoot": "Sift",
            "wordDefinition": "Sift refers to the act of passing something through a sieve or other fine mesh to remove any lumps or impurities.\n\nFor example, you might sift flour before baking to remove any clumps.\n\nSeparate is applicable when you need to divide something into distinct groups, while sift is applicable when you need to remove any unwanted particles from something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fecf4b81-06b4-43d4-b561-fece9458adf7.webp"
        },
        "Split": {
            "wordRoot": "Split",
            "wordDefinition": "Split also means to divide things into parts or groups, but it often implies a more forceful or dramatic separation.\n\nFor example, you might say that a piece of wood split in two when someone hit it with an ax. You might also say that a group of friends split up after a big fight, meaning that they no longer hang out together or have a close relationship.\n\nSeparate is a more general term that can refer to any kind of division, while split often implies a more intense or impactful separation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6648c581-72be-4b91-bd4c-6495d70623cc.webp"
        }
    },
    "videos": [
        {
            "Text": " you'll see them trace out a pattern that's characteristic of wave a set of stripes - regions with many electrons separated by regions where there are none at all. Block one of the slits and the stripes go away. This shows that the pattern is a result of each electron going through both slits at the same time.",
            "Title": "Schrödinger's cat: A...",
            "VideoId": "UjaAxUO6-Uw",
            "Controls": "start=148"
        },
        {
            "Text": " If there's only one group arguing, both others must be telling the truth, and if there are two conflicts, then the possessed students are in separate groups and you can safely trust the majority in both trios since at least two people in each will be truthful. The temple collapses behind you",
            "Title": "Can you solve the temple...",
            "VideoId": "nSbvlktToSY",
            "Controls": "start=209"
        },
        {
            "Text": " you put them together, and you create a watch. Now if everything else in the universe is like this, why are we different? Why think of ourselves as somehow not just being a collection of all our parts, but somehow being a separate, permanent entity which has those parts?",
            "Title": "Julian Baggini: Is there...",
            "VideoId": "Q80MfH7xPPE",
            "Controls": "start=366"
        },
        {
            "Text": " a way to separate things that are specific to a particular flu outbreak from the underlying principles that drive all these epidemics this is what my research aims to do for example it's likely that social interactions are important in spreading flu during the",
            "Title": "How data can predict the...",
            "VideoId": "tsr2nXInMpU",
            "Controls": "start=36"
        },
        {
            "Text": " The vast majority of the galaxies are separating from us so fast that light from them may never reach us. Still, our physical reality here on Earth is intimately connected to those distant, invisible galaxies. We can think of them as part of our universe.",
            "Title": "Questions No One Knows...",
            "VideoId": "7SWvDHvWXok",
            "Controls": "start=194"
        },
        {
            "Text": " A typical cult requires a high level of commitment from its members and maintains a strict hierarchy, separating unsuspecting supporters and recruits from the inner workings. It claims to provide answers to life's biggest questions through its doctrine,",
            "Title": "Why do people join...",
            "VideoId": "kB-dJaCXAxA",
            "Controls": "start=116"
        },
        {
            "Text": " and compulsive behaviors, which tend to be time consuming and interfere with work, school or social life to the point of causing significant distress. This set of diagnostic criteria is what separates people suffering from OCD",
            "Title": "Debunking the myths of...",
            "VideoId": "DhlRgwdDc-E",
            "Controls": "start=78"
        },
        {
            "Text": " when swarms invade we are inevitably separated by an invisible barrier created by our different senses and perceptions swarms may share our world but the gulf between us couldn't be greater",
            "Title": "The Man Who Can Control...",
            "VideoId": "7LSFOqnBbpk",
            "Controls": "start=177"
        },
        {
            "Text": " and later writers filled the gaps with rumors and stereotypes. We may never know the full truth of her life and her reign, but we can separate fact from rumor by putting history on trial.",
            "Title": "History vs. Cleopatra -...",
            "VideoId": "Y6EhRwn4zkc",
            "Controls": "start=231"
        },
        {
            "Text": " in my body for the longest time helped me really separate what are physical things and what are my spiritual components i don't think that i succumbed to my",
            "Title": "Growing Up Transgender...",
            "VideoId": "Z8FZewEPAAk",
            "Controls": "start=746"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kamala-harris.webp",
            "Text": "People who work for me know that family comes first. And I'm fortunate to have a family that is very supportive of the work I do, so I don't have to live two separate lives.",
            "Title": "American Vice President",
            "Name": "Kamala Harris"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/guy-manuel-de-homem-christo.webp",
            "Text": "You cannot separate your life and your music and your job; everything's linked.",
            "Title": "",
            "Name": "Guy-Manuel de Homem-Christo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lyoto-machida.webp",
            "Text": "Separating your profession from friendship is very difficult.",
            "Title": "Brazilian Athlete",
            "Name": "Lyoto Machida"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/julia-holter.webp",
            "Text": "A lot of my personal life feels very separate from my music.",
            "Title": "American Musician",
            "Name": "Julia Holter"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/f-w-de-klerk.webp",
            "Text": "For many years, I supported the concept of separate states.",
            "Title": "South African Statesman",
            "Name": "F. W. de Klerk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lee-mack.webp",
            "Text": "I have a very clear separation between my life and my work.",
            "Title": "English Comedian",
            "Name": "Lee Mack"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-wellstone.webp",
            "Text": "Never separate the life you live from the words you speak.",
            "Title": "American Politician",
            "Name": "Paul Wellstone"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ilhan-omar.webp",
            "Text": "I try not to think of my life in terms of separation.",
            "Title": "American Politician",
            "Name": "Ilhan Omar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jeanne-moreau.webp",
            "Text": "You should not separate your life from what you do.",
            "Title": "French Actress",
            "Name": "Jeanne Moreau"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-cage.webp",
            "Text": "When we separate music from life we get art.",
            "Title": "American Composer",
            "Name": "John Cage"
        }
    ]
}