{
    "currentWord": {
        "wordRoot": "ship",
        "id": 22731,
        "phonemic": "ʃɪp|ʃɪp\r",
        "bigId": "e3c0e953-dfb3-4138-bf74-8d975b5f0f43",
        "wordForms": [
            "ships",
            "shipping",
            "shipped",
            "ship"
        ]
    },
    "senses": [
        {
            "id": "e3c0e953-dfb3-4138-bf74-8d975b5f0f43",
            "de": "A vehicle used to travel on water",
            "ty": "noun",
            "ex": "The ship crossed the Atlantic in five days.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "cruise ship",
                " cargo ship",
                " sail ship"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e3c0e953-dfb3-4138-bf74-8d975b5f0f43.webp",
            "Tips": [
                {
                    "title": "Water Travel",
                    "description": "Used for watercraft larger than boats, usually ocean-going and with multiple decks.",
                    "example": "Giant ships transport goods across seas.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/rdjCD71SuWebqQ9dIlCMxOwmdko.webp"
                },
                {
                    "title": "Literary Imagery",
                    "description": "'Ship' in literature often symbolizes a journey, exploration, or adventure across the sea.",
                    "example": "In the story, the ship became a metaphor for his quest for knowledge.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/kDuROVDJRUqTl7GyJ5izjKdg.webp"
                },
                {
                    "title": "Historical Context",
                    "description": "The term 'ship' evokes images of historical exploration, trade, and naval warfare.",
                    "example": "Ancient ships like the Vikings' allowed for pivotal explorations.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/WWqmZGCGyA5KhzScSzrtdq8zmSk.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "1802bee3-74a7-4682-8064-684a06d0980e",
            "de": "To send something, especially goods or a message, somewhere",
            "ty": "verb",
            "ex": "The company ships its products all over the world.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "ship goods",
                " ship products",
                " ship overseas"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/1802bee3-74a7-4682-8064-684a06d0980e.webp",
            "Tips": [
                {
                    "title": "Commerce",
                    "description": "Often used in a business context to describe the act of sending products to customers.",
                    "example": "The warehouse ships orders within 24 hours.\r",
                    "imageUrl": ""
                },
                {
                    "title": "E-Commerce Usage",
                    "description": "Commonly used in online shopping to refer to the delivery process.",
                    "example": "The online store offers free shipping on all orders.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Logistics",
                    "description": "'Ship' can imply international logistics and the challenges of global trade.",
                    "example": "The company has to navigate customs regulations to ship abroad.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "8e130a1a-31d3-40d1-b00e-852e6be53f77",
            "de": "To take someone or something to a place, especially using a ship",
            "ty": "verb",
            "ex": "The prisoners were shipped off to a deserted island.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "ship off",
                " ship out",
                " ship overseas"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8e130a1a-31d3-40d1-b00e-852e6be53f77.webp",
            "Tips": [
                {
                    "title": "Forced Movement",
                    "description": "Can suggest compulsory relocation, often with a sense of urgency or under duress.",
                    "example": "Convicts were shipped to penal colonies in the 1800s.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Military Context",
                    "description": "Used in a military sense to send troops or supplies, usually overseas.",
                    "example": "Troops were shipped out to the conflict zone last week.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "4b7e5912-4a86-4600-b96b-a615818a4921",
            "de": "The skill or art of managing a ship or aircraft",
            "ty": "noun",
            "ex": "He is studying for a degree in ship management.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4b7e5912-4a86-4600-b96b-a615818a4921.webp",
            "Tips": [
                {
                    "title": "Specialized Skill",
                    "description": "Indicates a very specific set of skills required for professional maritime operations.",
                    "example": "Good ship management is crucial for a successful voyage.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "d57cdaae-2a6c-4f51-927d-d3ec24e565cc",
            "de": "In fandom, to support or have a particular romantic pairing between characters",
            "ty": "verb",
            "ex": "I totally ship these two characters in the series.",
            "use": "",
            "co": "Colloquial",
            "re": "Informal",
            "tp": "",
            "cl": [
                "ship characters",
                " ship together"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d57cdaae-2a6c-4f51-927d-d3ec24e565cc.webp",
            "Tips": [
                {
                    "title": "Fan Culture",
                    "description": "This informal use arises from fan communities and involves rooting for relationships.",
                    "example": "I ship those characters because they have great chemistry.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Literal",
                    "description": "Does not involve actual boats or shipping; it's about characters in stories.",
                    "example": "Fans often ship characters who aren't together in the actual plot.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Connection",
                    "description": "Expresses emotional investment in the relationship between fictional characters.",
                    "example": "It’s easy to ship characters when their stories make you feel invested in them.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Barge": {
            "wordRoot": "Barge",
            "wordDefinition": "A barge is a flat-bottomed boat used for transporting goods on rivers and canals.\n\nIt is typically not self-propelled and relies on being pushed or towed by a tugboat. Barges have a large flat deck and are used for carrying cargo like coal, grain, or construction materials.\n\nUnlike barges, ships are typically self-propelled and have a more complex design with multiple decks and compartments.\n\nIn summary, barges are used for transporting goods on rivers and canals, while ships are used for transportation on open seas or oceans for various purposes.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/661e65fa-f135-4adc-839d-9a5b8e8e521b.webp"
        },
        "Barque": {
            "wordRoot": "Barque",
            "wordDefinition": "A barque is a type of sailing vessel with three or more masts and square sails on the foremast, but with a fore-and-aft rig on the other masts.\n\nA barque is a smaller sailing vessel with a particular rigging system used primarily for coastal trade, while a ship is a larger vessel with a more versatile rigging system used for various purposes, including long-distance travel.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b4e54936-fb5a-4038-a019-7eb12fe39182.webp"
        },
        "Boat": {
            "wordRoot": "Boat",
            "wordDefinition": "Both boat and ship are words for watercraft, but they are used to describe different things.\n\nA boat is a smaller vessel, usually under 100 feet in length, that is used for personal or recreational purposes, like fishing or skiing.\n\nIf it's big enough to carry cargo or passengers, it's a ship. If it's smaller and used for pleasure, it's a boat.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c81fb256-e3d5-4a43-8ad1-8e293ed05120.webp"
        },
        "Craft": {
            "wordRoot": "Craft",
            "wordDefinition": "Craft refers to a small and smaller-than-average object or vehicle.\n\nIt can be used to refer to handmade items or boats, typically ones that are smaller in size. For example, a small wooden boat made by hand is referred to as a \"craft.\".\n\nCraft typically refers to smaller handmade objects, while ship typically refers to larger vessels used for transportation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/70edce81-3e1e-457c-9318-fa35b7e50a9c.webp"
        },
        "Galleon": {
            "wordRoot": "Galleon",
            "wordDefinition": "A galleon is a specific type of ship that was prominent in the 16th to 18th centuries. It was characterized by its high forecastle and aftcastle, and a usually heavily armed.\n\nA ship is a general term that encompasses all types of seafaring vessels, including but not limited to galleons.\n\nA galleon is a specific type of ship, while ship is a more general term that refers to any seafaring vessel.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f9dadb61-aaf7-4977-946b-de2a0d873aeb.webp"
        },
        "Liner": {
            "wordRoot": "Liner",
            "wordDefinition": "A liner refers to a type of ship that is used primarily for transporting passengers and cargo on a fixed route. These ships have a regular schedule for departures and arrivals, and the focus is on providing comfort and amenities for passengers during the journey.\n\nLiners may have additional facilities like swimming pools, restaurants, and entertainment areas.\n\nA liner is a specialized type of ship that focuses on passenger transport and providing amenities, while a ship is a more general term that refers to any vessel used for transport.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f5a8c62c-4007-438c-8bc7-096f9baf2302.webp"
        },
        "Schooner": {
            "wordRoot": "Schooner",
            "wordDefinition": "A schooner is a type of sailboat that has two or more masts with the forward mast being shorter or equal in height to the rear mast.\n\nSchooners are typically smaller and used for fishing or coastal trade.\n\nA schooner is a smaller sailboat used for coastal activities while a ship is a larger vessel used for oceanic voyages and transportation of goods and people.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fe9bc96c-5a04-446d-b64a-569ba58bf352.webp"
        },
        "Vessel": {
            "wordRoot": "Vessel",
            "wordDefinition": "Ship generally refers to a larger vessel that is designed for transportation of people or goods across bodies of water.\n\nIt is often used to describe cargo ships, naval vessels, or passenger ships.\n\nVessel is a broader term that can refer to any type of watercraft. This includes boats, yachts, ferries, and even fishing vessels.\n\nA ship is typically a larger vessel that is designed for transportation over long distances, while a vessel can refer to any type of watercraft.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b509cb80-47eb-46b1-b57f-2d571569f030.webp"
        },
        "Yacht": {
            "wordRoot": "Yacht",
            "wordDefinition": "A ship is a large vessel used for transportation of goods or people, while a yacht is a recreational vessel used for pleasure cruises or racing.\n\nShips are typically much larger than yachts and are used for commercial purposes such as cargo transport or military operations.\n\nYachts are smaller and usually owned by wealthy individuals for leisure activities such as sightseeing, fishing, or hosting parties.\n\nEssentially, a ship is used for work and a yacht is used for play.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0eab35cf-98b5-4ac2-ba11-bf43f96b0439.webp"
        }
    },
    "videos": [
        {
            "Text": " Now, I knew this place had a reputation for sinking ships and grounding planes, and while I was out there floating, I started to get a little bit nervous. Actually, I was totally freaking out -- -- and I was borderline hypothermic, and my friends eventually had to help me out of the water.",
            "Title": "Chris Burkard: The joy...",
            "VideoId": "8VwTZFY-fvw",
            "Controls": "start=470"
        },
        {
            "Text": " and what life was like millennia ago. So what exactly can we find? At shallow depths mingled in with modern-day items, we've discovered all sorts of ancient artifacts. This zone contains evidence of how our ancestors fished, how they repaired their ships, disposed of their trash,",
            "Title": "How much of human...",
            "VideoId": "kSBB5PsRV-k",
            "Controls": "start=40"
        },
        {
            "Text": " Now that you know whether its answers are true or false, ask the same alien whether the center overlord is Arr. The process of elimination will identify the remaining one. The satisfied overlords help you repair your ship and you prepare for takeoff.",
            "Title": "Can you solve the three...",
            "VideoId": "LKvjIsyYng8",
            "Controls": "start=249"
        },
        {
            "Text": " But with the incredibly broad history of tattoos giving you so many options, what are you going to get? This is a bold-lined expression of who you are, or you want to appear to be. As the naturalist aboard Cook's ship said of the tataoed Tahitians,",
            "Title": "The history of tattoos -...",
            "VideoId": "MYn15yDBvxM",
            "Controls": "start=247"
        },
        {
            "Text": " to do deep sea science we use a suite of tools so things like remotely operated vehicles or rovs these can be about the size of a car but you don't go in them and they're attached to the ship by a tether and you're able to see live what the rov is",
            "Title": "The Astronaut of the...",
            "VideoId": "RXpMSsvhcmQ",
            "Controls": "start=115"
        },
        {
            "Text": " Produced in several countries and shipped to plastic manufacturing plants the world over, nurdles often escape during the production process, carried by runoff to the coast or during shipping when they're mistakenly tipped into the waves.",
            "Title": "The nurdles' quest for...",
            "VideoId": "KpVpJsDjWj8",
            "Controls": "start=77"
        },
        {
            "Text": " such as a djembe or a djun djun. But what they did have were plenty of shipping crates. Not only were these readily accessible, but their inconspicuous appearance may have helped get around laws prohibiting slaves from playing music.",
            "Title": "Rhythm in a box: The...",
            "VideoId": "iJRfx0o5648",
            "Controls": "start=54"
        },
        {
            "Text": " That applies both at the ocean's surface and deep below. Sailors have always known about currents, but their patterns weren't well known until recently. In fact, tracking abandoned ships was how scientists determined the shape",
            "Title": "Are ghost ships real? -...",
            "VideoId": "cURn__xlWXk",
            "Controls": "start=232"
        },
        {
            "Text": " and we were embarrassed that we were celebrating and everyone just lets silent and looked at one another and then I said stop the ship and we had a memorial service we realized we were there it was no longer lost it was right",
            "Title": "Titanic: A Remembrance PIPE...",
            "VideoId": "1PhMWUoPDsk",
            "Controls": "start=284"
        },
        {
            "Text": " uhnot Minh in the cupola slant urn this created the world's largest sundial and they were able to recalculate the summer solstice then those astronomical calculations were reap lauded in two shipping routes",
            "Title": "The building of...",
            "VideoId": "ITfG2vospO8",
            "Controls": "start=419"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/david-carradine.webp",
            "Text": "I did get to hang out with my dad for a little while. I went with him to summer stock. I watched him be a real king of the world. He'd ship out as a star in summer stock. He sometimes directed the shows. I learned a lot from him - not just about acting, but about everything, how to handle a woman.",
            "Title": "American Actor",
            "Name": "David Carradine"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dj-qualls.webp",
            "Text": "That's what so great about making movies. It's that you get to do stuff you never would be able to do in real life. You get to go to a recording studio, you get to go to Navy ships and fly all over the world for press. And it's just a great job.",
            "Title": "American Actor",
            "Name": "DJ Qualls"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-steinbeck.webp",
            "Text": "I've always been fascinated by the Chinese. This goes a long way back to my childhood. The Chinese invented money, movable type, clocks, and built the largest ships in the history of the world.",
            "Title": "American Writer",
            "Name": "Thomas Steinbeck"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kym-marsh.webp",
            "Text": "Life is for living and there is only one way to go - unless you are prepared to sink and go down with the ship, which I don't choose to do.",
            "Title": "",
            "Name": "Kym Marsh"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/garth-brooks.webp",
            "Text": "All the artists out there, I ask you and beg you: Take over your ship. It's your career. It's your life.",
            "Title": "American Singer",
            "Name": "Garth Brooks"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eleonora-duse.webp",
            "Text": "If I had my will I would live in a ship on the sea, and never come nearer to humanity than that!",
            "Title": "Italian Actress",
            "Name": "Eleonora Duse"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elizabeth-kenny.webp",
            "Text": "I spent more time on dark ships in danger zones than any other woman in the world.",
            "Title": "Australian Celebrity",
            "Name": "Elizabeth Kenny"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/martin-luther-king-jr.webp",
            "Text": "We may have all come on different ships, but we're in the same boat now.",
            "Title": "American Leader",
            "Name": "Martin Luther King, Jr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/louisa-may-alcott.webp",
            "Text": "I am not afraid of storms for I am learning how to sail my ship.",
            "Title": "American Novelist",
            "Name": "Louisa May Alcott"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-quest.webp",
            "Text": "If the ship is sinking, you need help getting off that ship.",
            "Title": "English Journalist",
            "Name": "Richard Quest"
        }
    ]
}