{
    "currentWord": {
        "wordRoot": "spouse",
        "id": 815,
        "phonemic": "spaʊz|spaʊs\r",
        "bigId": "eb508fbf-14ff-4c85-8eee-d56c018f0c5f",
        "wordForms": [
            "spouses",
            "spouse"
        ]
    },
    "senses": [
        {
            "id": "eb508fbf-14ff-4c85-8eee-d56c018f0c5f",
            "de": "The person one is married to",
            "ty": "noun",
            "ex": "My spouse and I are going on vacation next week",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                "my spouse",
                " spouse of",
                " co-parent with spouse"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/eb508fbf-14ff-4c85-8eee-d56c018f0c5f.webp",
            "Tips": [
                {
                    "title": "Equal Relationship",
                    "description": "Refers to your married partner, without specifying gender or role.",
                    "example": "Do you and your spouse share household chores equally?\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/CCp45hasC62D2KdAGkQBEuE53SM.webp"
                },
                {
                    "title": "Emotionally Charged",
                    "description": "Can imply a close, intimate bond, more than just a legal connection.",
                    "example": "I told my spouse about my deepest fears last night.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FAH24S0HGM3UoGBIhtgsQb0qYxA.webp"
                },
                {
                    "title": "Personal Narratives",
                    "description": "Often used when discussing personal life stories or experiences.",
                    "example": "My spouse and I met in college and have been together since.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/sg9Rv5IoIvwTQvzla2XxZNmPPhM.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "f5204eca-3040-4576-ba38-1a621c3902b5",
            "de": "A husband or wife, in legal terms",
            "do": "Legal",
            "ty": "noun",
            "ex": "The inheritance will be given to the surviving spouse",
            "use": "",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "surviving spouse",
                " legal spouse",
                " separated spouse"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f5204eca-3040-4576-ba38-1a621c3902b5.webp",
            "Tips": [
                {
                    "title": "Legal Significance",
                    "description": "Indicates a legal marriage recognized by government or law.",
                    "example": "Her will stated everything should go to her spouse.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Inheritance Context",
                    "description": "Commonly used in legal situations like wills or inheritance rights.",
                    "example": "As his spouse, you have the right to claim the estate.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Marriage Status",
                    "description": "Connotes current marriage; doesn't apply to past relationships/divorces.",
                    "example": "Please state the name of your current legal spouse.\r",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Beloved": {
            "wordRoot": "Beloved",
            "wordDefinition": "Beloved is an affectionate term used to describe someone you love deeply or hold dear to your heart.\n\nBeloved is a term of endearment that can be used for anyone you love deeply, while spouse is a legal term that describes a husband or wife in a marital relationship.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6ba6ddad-a1b2-4c7e-8ce1-8feca2a50e64.webp"
        },
        "Comrade": {
            "wordRoot": "Comrade",
            "wordDefinition": "Comrade refers to a close friend or ally, often used in reference to people who share the same beliefs, goals, or membership in a group such as soldiers or members of a political party.\n\nComrade refers to a friend or ally in a broader sense, while spouse refers specifically to a married partner.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9124a1a5-7c15-4959-80cb-4794585545c5.webp"
        },
        "Consort": {
            "wordRoot": "Consort",
            "wordDefinition": "Consort, on the other hand, can be used more broadly to refer to any person with whom someone is closely associated or in partnership with, particularly in a non-romantic or non-marital context.\n\nSo, while spouse is generally used to refer to a partner in a marriage, consort is a more general term for a partner or companion.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b72385aa-819e-42c4-8adf-7ce29691dabc.webp"
        },
        "Helpmate": {
            "wordRoot": "Helpmate",
            "wordDefinition": "Both words, helpmate and spouse, refer to a person's partner in marriage.\n\nHowever, the word helpmate specifically emphasizes the idea of a partner who provides support and assistance in daily life and may often be used in a religious context.\n\nOverall, both words are applicable in marriage, but helpmate may emphasize the idea of partnership and collaboration more explicitly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/486df498-4d23-4676-a200-66af7422796e.webp"
        },
        "Mate": {
            "wordRoot": "Mate",
            "wordDefinition": "Mate can refer to a friend, a companion or a romantic partner. It is a less formal term and is generally used in informal situations.\n\nGenerally, mate is used more in casual conversations while spouse is used to refer to a partner in more serious or official contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b8aa9fed-c1b7-45df-b079-40f76b1a9216.webp"
        },
        "Paramour": {
            "wordRoot": "Paramour",
            "wordDefinition": "Spouse refers to a person who is legally married to someone else. While the word paramour refers to a person who is in a romantic or sexual relationship with someone who is married to someone else.\n\nA spouse is applicable when referring to a legally married partner, while a paramour applies when referring to an affair or extramarital relationship.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8b40655a-7216-43c8-a03d-fe9478825e09.webp"
        },
        "Partner": {
            "wordRoot": "Partner",
            "wordDefinition": "Partner usually refers to someone who you are in a romantic relationship with, but not necessarily married to.\n\nIf someone is in a serious relationship but not married, they would typically use the word partner. But if they are legally married, they would use the word spouse.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7a5e0043-2926-44cd-bab0-a7d068bf828f.webp"
        },
        "Soulmate": {
            "wordRoot": "Soulmate",
            "wordDefinition": "A soulmate is someone you connect with on a deep level, often a romantic partner, who you feel a sense of spiritual or emotional unity with.\n\nA spouse is someone you are legally married to or in a committed partnership with. While a spouse can also be your soulmate, they don't have to be.\n\nYou can have a soulmate who is not your spouse and a spouse who is not your soulmate. The term soulmate is often used to describe a romantic relationship, while spouse is a more formal term used to describe someone you are officially committed to.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/61d48f17-c7a0-408a-a1db-ea434ffde871.webp"
        }
    },
    "videos": [
        {
            "Text": " Unfortunately, this is also the first part of our brain that goes offline when we get stressed out, which isn't that helpful. Now, we can all relate to this in our own experience. We're much more likely to do things like yell at our spouse or kids when we're stressed out or tired, even though we know it's not going to be helpful. We just can't help ourselves.",
            "Title": "A simple way to break a...",
            "VideoId": "-moW9jvvMr4",
            "Controls": "start=305"
        },
        {
            "Text": " many of whom by the way are extroverts with quiet colleagues and spouses and kids of their own and together we have just formed a venture-backed mission based company whose goal is to empower introverts for the benefit of us all thank you that's a third to a half of humanity one out of every two or three people you know is introverted so we're",
            "Title": "Blueprint for a quiet...",
            "VideoId": "l1SM9NxxmJo",
            "Controls": "start=196"
        },
        {
            "Text": " problems with empathy, a sense of entitlement, and a need for admiration or attention. What makes these trait a true personality disorder is that they take over people's lives and cause significant problems. Imagine that instead of caring for your spouse or children, you used them as a source of attention or admiration.",
            "Title": "The psychology of...",
            "VideoId": "arJLy3hX1E8",
            "Controls": "start=182"
        },
        {
            "Text": " And he said, \"That's my job. I'm a poet, and I'm going to play the fool. Most people have to go to work all day long, and they come home and they fight with their spouse, and they eat, and they turn on the old boob tube, and somebody tries to sell them something, and I just screwed all that up.",
            "Title": "Give yourself permission...",
            "VideoId": "WRS9Gek4V5Q",
            "Controls": "start=57"
        },
        {
            "Text": " than a lifetime of therapy ever could. So now you may be Why does anyone get married ever? Well, the US federal government counts more than a thousand legal benefits to being someone's spouse. A list that includes visitation rights in jail, but hopefully, you'll never need that one.",
            "Title": "What you don't know...",
            "VideoId": "Y8u42OjH0ss",
            "Controls": "start=520"
        },
        {
            "Text": " Men lie eight times more about themselves than they do other people. Women lie more to protect other people. If you're an average married couple, you're going to lie to your spouse in one out of every 10 interactions. Now, you may think that's bad.",
            "Title": "How to spot a liar PIPE...",
            "VideoId": "P_6vDLq64gE",
            "Controls": "start=281"
        },
        {
            "Text": " I'm talking about your coworkers and your spouses and your children and the person sitting next to you right now -- all of them subject to this bias that is pretty deep and real in our society. We all internalize it from a very early age",
            "Title": "The power of introverts...",
            "VideoId": "c0KYU2j0TM4",
            "Controls": "start=227"
        },
        {
            "Text": " We can also use, as a predictor, the vocal posture. Meaning, how you decide to place your voice when you talk to someone. And you vocal posture, when you talk to your spouse, can help predict not only if, but also when you will divorce.",
            "Title": "Why you don’t like the...",
            "VideoId": "g3vSYbT1Aco",
            "Controls": "start=330"
        },
        {
            "Text": " Do you really want to use your family, do you really ever want to look at your spouse and your kid, and see your jailers? There was something you could have said to your kid,",
            "Title": "Larry Smith: Why you...",
            "VideoId": "qrNDkRHAA4E",
            "Controls": "start=731"
        },
        {
            "Text": " From the point of view of its spouse, this flatworlder has distressingly disappeared then unaccountably materialized from out of nowhere.",
            "Title": "Magic Without Lies PIPE...",
            "VideoId": "cUQaynv7X9Y",
            "Controls": "start=313"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ivanka-trump.webp",
            "Text": "Marrying Jared was the best decision I've ever made. You realize in life, not that many things matter that much, but your choice of a spouse is everything. We're truly partners - he supports my work and my ambitions. I know that he's always got my back, and I've got his.",
            "Title": "American Businesswoman",
            "Name": "Ivanka Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gary-chapman.webp",
            "Text": "When you're married, the person you would most like to love you is your spouse. And if you feel loved by your spouse, the world looks bright. But if the love tank is empty, and you don't feel loved by your spouse, the world begins to look dark.",
            "Title": "American Author",
            "Name": "Gary Chapman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-chatzky.webp",
            "Text": "In a relationship where finances are shared, it's important that both people know what's going on. If one spouse likes being the family accountant, it's fine for that person to take the lead, but the other spouse shouldn't be in the dark.",
            "Title": "American Journalist",
            "Name": "Jean Chatzky"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-maxwell.webp",
            "Text": "A word of encouragement from a teacher to a child can change a life. A word of encouragement from a spouse can save a marriage. A word of encouragement from a leader can inspire a person to reach her potential.",
            "Title": "American Clergyman",
            "Name": "John C. Maxwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/billy-graham.webp",
            "Text": "Over the years I've seen people lose a spouse and then withdraw and lose interest in life, and I believe we need to resist that.",
            "Title": "American Clergyman",
            "Name": "Billy Graham"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jared-polis.webp",
            "Text": "No one should be denied the opportunity to choose his or her spouse. It is a basic human right and deeply personal decision.",
            "Title": "American Politician",
            "Name": "Jared Polis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/hunter-tylo.webp",
            "Text": "We share responsibility. It's important to have a good spouse; that's where I sympathize with single parents.",
            "Title": "American Actress",
            "Name": "Hunter Tylo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jane-omeara-sanders.webp",
            "Text": "When your spouse becomes a congressperson, you have to adjust your entire life if you want to stay married.",
            "Title": "American Educator",
            "Name": "Jane O'Meara Sanders"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/isabel-allende.webp",
            "Text": "Nice people with common sense do not make interesting characters. They only make good former spouses.",
            "Title": "Chilean Writer",
            "Name": "Isabel Allende"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/christina-aguilera.webp",
            "Text": "It's important to take time for your spouse and nurture the relationship.",
            "Title": "American Musician",
            "Name": "Christina Aguilera"
        }
    ]
}