{
    "currentWord": {
        "wordRoot": "strong",
        "id": 12425,
        "phonemic": "strɒŋ|strɔːŋ\r",
        "bigId": "2c854c51-8f1e-4c7e-8bcc-626ff9495a08",
        "wordForms": [
            "stronger",
            "strongest",
            "strongly",
            "strong"
        ]
    },
    "senses": [
        {
            "id": "2c854c51-8f1e-4c7e-8bcc-626ff9495a08",
            "de": "Having a lot of physical power, able to carry heavy objects or move heavy things.",
            "ty": "adjective",
            "ex": "He is strong enough to lift that heavy box.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong man",
                " strong body",
                " strong muscles"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/2c854c51-8f1e-4c7e-8bcc-626ff9495a08.webp",
            "Tips": [
                {
                    "title": "Physical Strength",
                    "description": "Refers to the ability to exert force or bear weight. Often linked with health and fitness.",
                    "example": "Athletes need to be strong to compete.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/U47LLoBt6Gz9kTlcmdBxjahNVZY.webp"
                }
            ]
        },
        {
            "id": "cab0615d-ec4a-4045-ac0a-bc22c9468d40",
            "de": "Not easy to break or damage, sturdy, durable.",
            "ty": "adjective",
            "ex": "This table is made of strong wood.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong materials",
                " strong structure",
                " strong building"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/cab0615d-ec4a-4045-ac0a-bc22c9468d40.webp",
            "Tips": [
                {
                    "title": "Durability Context",
                    "description": "Used for objects that withstand pressure, stress, or wear and tear.",
                    "example": "A strong foundation supports a secure house.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "38353378-4c9c-42c0-af53-5d46ec27459f",
            "de": "Very intense or extreme, not mild or weak.",
            "ty": "adjective",
            "ex": "The coffee she made is very strong.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong flavor",
                " strong smell",
                " strong coffee"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/38353378-4c9c-42c0-af53-5d46ec27459f.webp",
            "Tips": [
                {
                    "title": "Intensity Aspect",
                    "description": "Describes the high degree of a particular quality, like taste or smell.",
                    "example": "I prefer a strong flavor in my food.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "d77ec754-ef36-4a02-b40c-c3ecff4f070f",
            "de": "Confident and able to deal with problems.",
            "ty": "adjective",
            "ex": "After her mom passed away, she became the strong one in the family.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong character",
                " strong personality",
                " strong leadership"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d77ec754-ef36-4a02-b40c-c3ecff4f070f.webp",
            "Tips": [
                {
                    "title": "Emotional Resilience",
                    "description": "Indicates mental or emotional stability, especially under stress or hardship.",
                    "example": "He remained strong after the setback.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "62f87de9-4392-4a88-a7db-a5fb5fe403b8",
            "de": "Very good in a particular skill, area or activity.",
            "ty": "adjective",
            "ex": "She has a strong ability in mathematics.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong skills",
                " strong performance",
                " strong player"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/62f87de9-4392-4a88-a7db-a5fb5fe403b8.webp",
            "Tips": [
                {
                    "title": "Skill Proficiency",
                    "description": "Suggests excellence or high ability in a specific field or action.",
                    "example": "Her strong understanding of economics impressed her teachers.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "15dbfdcb-26f4-4698-8264-16cbcdfdcd9e",
            "de": "Containing a lot of a substance or ingredient.",
            "ty": "adjective",
            "ex": "This wine is quite strong.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "strong drink",
                " strong detergent",
                " strong medicine"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/15dbfdcb-26f4-4698-8264-16cbcdfdcd9e.webp",
            "Tips": [
                {
                    "title": "High Concentration",
                    "description": "Indicates an abundance of an ingredient or element, such as alcohol in drinks.",
                    "example": "Be careful with the strong chemicals in that cleaner.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Courageous": {
            "wordRoot": "Courageous",
            "wordDefinition": "Courageous means being brave or doing something even though it is scary.\n\nIt is often used to describe someone who takes risks or faces their fears. For example, a person who stands up for what they believe in, even if it means going against popular opinion or facing criticism, can be described as courageous.\n\nCourageous is applicable when someone is doing something brave or facing their fears, while strong is applicable when someone has physical or mental power or is able to withstand challenges.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/27fc23b2-f453-46da-9dd7-4843dcb4db0a.webp"
        },
        "Mighty": {
            "wordRoot": "Mighty",
            "wordDefinition": "The words mighty and strong both suggest a great amount of power, but there are subtle differences in their meanings.\n\nMighty implies not just physical strength, but also a sense of authority or greatness.\n\nIt is often used to describe heroes or noble figures. For example, Hercules is mighty because of his incredible physical strength, but also because he displays admirable qualities like bravery and selflessness.\n\nMighty suggests a more grand and awe-inspiring type of power, while strong is more straightforward and focused on physical ability.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/56e4d46d-9135-40de-a5bb-5726de23c6a3.webp"
        },
        "Potent": {
            "wordRoot": "Potent",
            "wordDefinition": "Potent refers to something that is powerful and has a strong effect.\n\nFor example, a potent pain reliever would be one that is very effective at reducing pain.\n\nPotent refers to something that has a strong effect, while strong refers to something that has a lot of physical or emotional force.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/600e2004-95a8-40a2-88cd-ba1b45f42c86.webp"
        },
        "Powerful": {
            "wordRoot": "Powerful",
            "wordDefinition": "Powerful refers to the ability to exert great force or influence, while strong refers to the physical or mental capability to withstand stress or pressure.\n\nFor example, a person can be physically strong, but not necessarily powerful in terms of influence. A nation or organization can be powerful in terms of their ability to exert influence, but not necessarily physically strong.\n\nPowerful is used more in the context of influence, while strong is used more in the context of physical or mental ability.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e4f0dab0-1d6d-46c6-bf2d-1ece47c100b5.webp"
        },
        "Resistant": {
            "wordRoot": "Resistant",
            "wordDefinition": "Resistant means to prevent or withstand something from happening. It implies that something can endure and keep working despite adverse circumstances.\n\nFor example, a waterproof watch is resistant to water, which means it won't stop working even if it gets wet.\n\nResistant refers to the ability to withstand something, while strong refers to the ability to bear heavy loads. Each word is applicable in different contexts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88435c38-7358-4b76-b64c-21d0fa5ffc52.webp"
        },
        "Robust": {
            "wordRoot": "Robust",
            "wordDefinition": "The words robust and strong both mean to be physically or mentally powerful.\n\nHowever, robust is more applicable to describing something that is resilient and can withstand challenges, while strong is more commonly used to describe physical power or force.\n\nFor example, a person may be physically strong, but a tree's roots may be robust enough to endure strong winds.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/103df61a-eaa2-4ce2-84d8-85b22096b40f.webp"
        },
        "Sturdy": {
            "wordRoot": "Sturdy",
            "wordDefinition": "Sturdy means being physically strong and able to withstand rough use or handling. For example, a sturdy pair of shoes can handle a lot of walking without falling apart.\n\nStrong refers to something that can withstand external forces that may cause damage, while sturdy refers to something that is tough and durable, able to handle wear and tear over time.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d134b6c9-30b0-4a97-91d9-1f7278781247.webp"
        },
        "Tough": {
            "wordRoot": "Tough",
            "wordDefinition": "The term tough refers to something that is durable or able to withstand physical stress, such as a tough fabric or a tough piece of meat.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/704baef5-a147-47ce-84e1-00a5183433ab.webp"
        },
        "Vigorous": {
            "wordRoot": "Vigorous",
            "wordDefinition": "Vigorous refers to something that is done with great energy and enthusiasm, showing strong or assertive movement.\n\nFor example, a vigorous workout or a vigorous debate.\n\nStrong describes a person or thing that has power, while vigorous describes action that is done with energy and enthusiasm.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a569100f-985b-4df5-a80d-cc136daea815.webp"
        }
    },
    "videos": [
        {
            "Text": " It is the hippocampus, strongly associated with emotion, that aids recollection by encoding important experiences into long-term memories. The ability to distinguish this importance makes elephant memory a complex and adaptable faculty beyond rote memorization.",
            "Title": "Why elephants never...",
            "VideoId": "lSXNqsOoURg",
            "Controls": "start=117"
        },
        {
            "Text": " Healthy brains maintain strong connections between neurons thanks to the brain's continuous efforts to prune itself and remove unused or faulty neural connections. This process is important because our neural pathways serve as a map for everything we do.",
            "Title": "What is bipolar...",
            "VideoId": "RrWBhVlD1H8",
            "Controls": "start=130"
        },
        {
            "Text": " But if you have a growth mindset and think your abilities can improve, a challenge is an opportunity to learn and grow. Neuroscience supports the growth mindset. The connections in your brain do get stronger and grow with study and practice.",
            "Title": "3 tips to boost your...",
            "VideoId": "l_NYrWqUR40",
            "Controls": "start=148"
        },
        {
            "Text": " I asked my father if I cried when I was a baby and he says I did not. I think I was a stronger baby than my brother. So, when you're inside of the headset. you're not seeing it like this. You're looking around through this world.",
            "Title": "Chris Milk: How virtual...",
            "VideoId": "iXHil1TPxvA",
            "Controls": "start=445"
        },
        {
            "Text": " So what causes narcissism? Twin studies show a strong genetic component, although we don't know which genes are involved. But environment matters, too. Parents who put their child on a pedestal can foster grandiose narcissism.",
            "Title": "The psychology of...",
            "VideoId": "arJLy3hX1E8",
            "Controls": "start=210"
        },
        {
            "Text": " Backpacks should be in contact with your back carried symetrically. If you sit a lot, get up and move around on occassion, and be sure to exercise. Using your muscles will keep them strong enough to support you effectively,",
            "Title": "The benefits of good...",
            "VideoId": "OyK0oE5rwFY",
            "Controls": "start=221"
        },
        {
            "Text": " reflect lights into our eyes that send signals to our brains that we logically and emotionally decode as complex narratives that move us to fight, cry, sing, and think, that are strong enough not only to hold up a world",
            "Title": "How to build a fictional...",
            "VideoId": "ZQTQSbjecLg",
            "Controls": "start=133"
        },
        {
            "Text": " where there was a couple of hours of not really much activity. She's just getting to the point now where she's having some pretty regular and strong contractions. Kaitlyn is entering the advanced stages of labour.",
            "Title": "Birth of Twin Tiger Cubs...",
            "VideoId": "SR6X-j55eEA",
            "Controls": "start=7"
        },
        {
            "Text": " he has such a charisma strong presence and incredible deep chess preparation practically I've lost the game before even making a single move you may ask how is that possible right it's because",
            "Title": "Giving checkmate is...",
            "VideoId": "z-ttu7dyBCU",
            "Controls": "start=380"
        },
        {
            "Text": " the sensation is stronger there it really is about marching towards little by little getting back into the arena of life not back as the way it",
            "Title": "Watch One Family's...",
            "VideoId": "fFua9-Rc4pw",
            "Controls": "start=892"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-j-blige.webp",
            "Text": "I just want fans to walk away knowing that no matter what's going on, no matter how happy you are, no matter how sad you are, we did it. We're strong in this. We've come a long way, and life is not just one thing.",
            "Title": "American Musician",
            "Name": "Mary J. Blige"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/maya-angelou.webp",
            "Text": "We are braver and wiser because they existed, those strong women and strong men... We are who we are because they were who they were. It's wise to know where you come from, who called your name.",
            "Title": "American Poet",
            "Name": "Maya Angelou"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerry-lewis.webp",
            "Text": "The beauty of love, as far as I'm concerned, is it makes you better. It makes you stronger. It gives you direction. It gives you understanding of what life is and what we've been given.",
            "Title": "American Comedian",
            "Name": "Jerry Lewis"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-welch.webp",
            "Text": "Strong managers who make tough decisions to cut jobs provide the only true job security in today's world. Weak managers are the problem. Weak managers destroy jobs.",
            "Title": "American Businessman",
            "Name": "Jack Welch"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/luka-modric.webp",
            "Text": "The war made me stronger; it was a very hard time for me and my family. I don't want to drag that with me forever, but I don't want to forget about it, either.",
            "Title": "Croatian Athlete",
            "Name": "Luka Modric"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dan-gable.webp",
            "Text": "I never won anything by myself. I was always strong because of help that gave me extra strength to win.",
            "Title": "American Wrestler",
            "Name": "Dan Gable"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/victor-hugo.webp",
            "Text": "There is one thing stronger than all the armies in the world, and that is an idea whose time as come.",
            "Title": "French Author",
            "Name": "Victor Hugo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ernest-hemingway.webp",
            "Text": "The world breaks everyone, and afterward, some are strong at the broken places.",
            "Title": "American Novelist",
            "Name": "Ernest Hemingway"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dwayne-johnson.webp",
            "Text": "I was raised by strong women, and that DNA is in my daughter and wife.",
            "Title": "American Actor",
            "Name": "Dwayne Johnson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cesar-chavez.webp",
            "Text": "You are never strong enough that you don't need help.",
            "Title": "American Activist",
            "Name": "Cesar Chavez"
        }
    ]
}