{
    "currentWord": {
        "wordRoot": "subjective",
        "id": 6299,
        "phonemic": "səbˈdʒektɪv|səbˈdʒektɪv\r",
        "bigId": "961966a6-840d-41ef-b2cd-fa6f07d98257",
        "wordForms": [
            "subjectively",
            "subjective"
        ]
    },
    "senses": [
        {
            "id": "961966a6-840d-41ef-b2cd-fa6f07d98257",
            "de": "Based on or influenced by personal feelings, tastes, or opinions.",
            "ty": "adjective",
            "ex": "Art is often a matter of individual, subjective interpretation.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "subjective experience",
                " subjective opinion",
                " subjective judgment"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/961966a6-840d-41ef-b2cd-fa6f07d98257.webp",
            "Tips": [
                {
                    "title": "Context Sensitivity",
                    "description": "The meaning of 'subjective' shifts depending on the topic being discussed.",
                    "example": "Your enjoyment of a movie is subjective and may differ from others.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/7RaWQfflXKq3UBXINatOb9slwuE.webp"
                },
                {
                    "title": "Avoid As Fact",
                    "description": "Use 'subjective' to express personal views, not universal truths.",
                    "example": "'Pizza is the best food' is a subjective statement.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/q7lxaFul8pyWd4ndLSEF5HaCCc.webp"
                },
                {
                    "title": "Debate Cautiously",
                    "description": "Subjective opinions can lead to debates as others may have different views.",
                    "example": "Her subjective preference for winter sparked a lively conversation.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/PZkBc2A4IMQ1cjhe0pkpNtk69g.webp"
                }
            ]
        },
        {
            "id": "149d71c2-fdcf-4cdc-ae1a-ba709d56c9d2",
            "de": "Existing in the mind; belonging to the thinking subject rather than to the object of thought.",
            "do": "Psychology",
            "ty": "adjective",
            "ex": "People's dreams are quite subjective and can be influenced by a variety of factors.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "subjective reality",
                " subjective consciousness",
                " subjective perspective"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/149d71c2-fdcf-4cdc-ae1a-ba709d56c9d2.webp",
            "Tips": [
                {
                    "title": "Mental Processes",
                    "description": "'Subjective' often describes thoughts unique to an individual's mind.",
                    "example": "Fear is subjective, varying from person to person.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Influence",
                    "description": "'Subjective' can highlight the impact emotions have on perception.",
                    "example": "Their breakup caused her subjective view of relationships.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "8245336b-8ec7-4a0c-aa7a-31b071de3c51",
            "de": "Relating to the subject or actor of a sentence and not the object.",
            "do": "Grammar",
            "ty": "adjective",
            "ex": "In the sentence 'I love you', 'I' is in the subjective case.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "subjective case",
                " subjective pronoun",
                " subjective verb"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8245336b-8ec7-4a0c-aa7a-31b071de3c51.webp",
            "Tips": [
                {
                    "title": "Grammatical Role",
                    "description": "'Subjective' specifies a grammatical subject's form in certain languages.",
                    "example": "In 'He reads a book,' 'He' is subjective, referring to the doer.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subject Focus",
                    "description": "When discussing grammar, 'subjective' stresses the subject's action or state.",
                    "example": "In 'She was happy,' 'She' is in the subjective case.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Bias": {
            "wordRoot": "Bias",
            "wordDefinition": "Bias refers to a preference or prejudice that can negatively impact one's judgment or decision-making because they are not based on facts, evidence or fair analysis.\n\nFor example, if someone has a strong bias against a political party, they might not consider any of that party's policies or actions fairly, regardless of their merit.\n\nIt's important to be aware of one's biases and to strive for objectivity whenever possible.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/de285d3d-744b-4729-ba23-2b4ac1116eb0.webp"
        },
        "Opinionated": {
            "wordRoot": "Opinionated",
            "wordDefinition": "Opinionated means having a strong opinion and not willing to consider other people's opinions. It is applicable to a person who strongly believes in something and is not open to hearing another person's point of view.\n\nOpinionated describes a person who has strong opinions, while subjective describes the expression of personal opinions or experiences.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/475c35c4-989f-4193-afd7-6d6f3beb1caf.webp"
        },
        "Partial": {
            "wordRoot": "Partial",
            "wordDefinition": "Partial means showing favoritism or being biased towards one side. Subjective means based on personal opinions or feelings rather than facts or evidence.\n\nFor example, if a sports fan presents an opinion that their favorite team is the best, it may be considered partial because they have a biased view.\n\nPartial applies to situations or opinions that are biased, while subjective applies to opinions that are based on personal feelings rather than on factual information.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/faa50a46-b8dc-4c92-a698-b5949d0ca646.webp"
        },
        "Partisan": {
            "wordRoot": "Partisan",
            "wordDefinition": "Partisan refers to a strong supporter of a particular group or cause, often affiliated with a political party.\n\nPartisan indicates a strong allegiance to a particular group or cause that may lead to bias or close-mindedness, while subjective simply implies an individual's personal perspective on a matter.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/3fe0f672-9165-4f7a-91c6-a56647c05801.webp"
        },
        "Personal": {
            "wordRoot": "Personal",
            "wordDefinition": "Personal describes something that relates to an individual's thoughts, feelings, and experiences. For example, \"My personal favorite food is pizza.\".\n\nSubjective means something that is based on one's personal opinions or feelings, rather than on facts. For example, \"The movie was good, but that's a subjective opinion.\".\n\nPersonal refers to something individual while subjective means something based on personal opinions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/64559064-a2b6-42ae-a199-37fbec4c03fb.webp"
        },
        "Prejudice": {
            "wordRoot": "Prejudice",
            "wordDefinition": "Prejudice is having a preconceived opinion that is not based on reason or actual experience.\n\nPrejudice can lead to unfair treatment and discrimination towards others.\n\nPrejudice is a negative attitude towards a particular group or belief based on preconceived notions without much foundation, while subjective is based on one's personal opinions or experiences, which may or may not be biased.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a824c01f-acae-4acf-84b2-df9fe24d3bcb.webp"
        }
    },
    "videos": [
        {
            "Text": " arrow and this is all meant to capture some aspect of what time means in specific contacts and today today I'm here to share with you a personal and scientific discovery that for all of us time is memory so before I explain this further it's important to differentiate between objective and subjective time",
            "Title": "Time is memory and you...",
            "VideoId": "zUqs3y9ucaU",
            "Controls": "start=72"
        },
        {
            "Text": " fully sharing thoughts and feelings. As humans, we can't help but send and receive messages through our own subjective lenses. When communicating, one person expresses her interpretation of a message, and the person she's communicating with hears his own interpretation of that message.",
            "Title": "How miscommunication...",
            "VideoId": "gCfzeONu3Mo",
            "Controls": "start=105"
        },
        {
            "Text": " can influence how we feel. When we talk about heartbreak, the feeling of brokenness becomes part of our experience, where as in a culture that talks about a bruised heart, there actually seems to be a different subjective experience. Some contemporary thinkers aren't interested",
            "Title": "A brief history of...",
            "VideoId": "8li-3pRrA5Y",
            "Controls": "start=228"
        },
        {
            "Text": " I climbed up on the roof of a three story building to take a picture of a rare tree that was blooming and I fell off the roof. So, you know, our objective versus subjective risk assessment is not, you know, not so great. In the beginning, I was motivated by adventure.",
            "Title": "Underwater Cave Diving:...",
            "VideoId": "_EsuHf3_OKg",
            "Controls": "start=67"
        },
        {
            "Text": " One study showed that even when people do this, they tend to rate the smell subjectively according to how bad they thought it was going to be. But there's one simple, if socially difficult, way of finding out how your breath just take a deep breath and ask a friend.",
            "Title": "What causes bad breath?...",
            "VideoId": "oZ13QfP2os8",
            "Controls": "start=214"
        },
        {
            "Text": " some element of raw, subjective feeling, some primitive precursor to consciousness. This may sound a bit kooky to you. I mean, why would anyone think such a crazy thing? Some motivation comes from the first crazy idea, that consciousness is fundamental.",
            "Title": "How do you explain...",
            "VideoId": "uhRhtFFhNzQ",
            "Controls": "start=744"
        },
        {
            "Text": " anxiety, and depression. There’s no known cure for subjective tinnitus. So the most important thing doctors can do is help people understand this auditory event, and develop neutral associations with these often-distressing sounds.",
            "Title": "What’s that ringing in...",
            "VideoId": "TnsCsR2wDdk",
            "Controls": "start=233"
        },
        {
            "Text": " Love is also a set of behaviors we associate with the Holding hands, kissing, hugging, public displays of affection, dating, marriage, having kids, or just sex. But these loving actions can be subjective or culturally relative.",
            "Title": "What is love? - Brad...",
            "VideoId": "5sY4rhvB9LE",
            "Controls": "start=115"
        },
        {
            "Text": " Humor is subjective. Comedy is trial and error. Writing is rewriting. Just keep trying. Find the flaws, discover the details, insert incongruities, incorporate k-words, and remember the most important rule of writing have fun.",
            "Title": "How to make your writing...",
            "VideoId": "zNTxSBgDNp4",
            "Controls": "start=261"
        },
        {
            "Text": " but subjective perceptions. And there’s not necessarily anything wrong with that— the problems arise when we treat memory as fact, rather than accepting this fundamental truth about the nature of our recollections.",
            "Title": "Are all of your memories...",
            "VideoId": "D-2p86FvqF4",
            "Controls": "start=279"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-lanza.webp",
            "Text": "Our science fails to recognize those special properties of life that make it fundamental to material reality. This view of the world - biocentrism - revolves around the way a subjective experience, which we call consciousness, relates to a physical process. It is a vast mystery and one that I have pursued my entire life.",
            "Title": "American Scientist",
            "Name": "Robert Lanza"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-reed.webp",
            "Text": "Dream study impacts culture. We are put in touch with the inner poet who dreams. We hear our inner, subjective response to the outer world. That helps spiritualize our lives.",
            "Title": "",
            "Name": "Henry Reed"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/roger-ebert.webp",
            "Text": "In my reviews, I feel it's good to make it clear that I'm not proposing objective truth, but subjective reactions; a review should reflect the immediate experience.",
            "Title": "American Critic",
            "Name": "Roger Ebert"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-schumann.webp",
            "Text": "The poet sees better than other mortals. I do not see things as they are, but according to my own subjective impression, and this makes life easier and simpler.",
            "Title": "German Composer",
            "Name": "Robert Schumann"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jack-henry-abbott.webp",
            "Text": "When they talk of ghosts of the dead who wander in the night with things still undone in life, they approximate my subjective experience of this life.",
            "Title": "American Author",
            "Name": "Jack Henry Abbott"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-ocean.webp",
            "Text": "I won't touch on risky, because that's subjective. People are just afraid of things too much. Afraid of things that don't necessarily merit fear.",
            "Title": "American Musician",
            "Name": "Frank Ocean"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/devdutt-pattanaik.webp",
            "Text": "Mythology is a subjective truth. Every culture imagines life a certain way.",
            "Title": "Indian Author",
            "Name": "Devdutt Pattanaik"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/parvathy.webp",
            "Text": "Reviews are extremely subjective, but I have respect for them.",
            "Title": "Indian Actress",
            "Name": "Parvathy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bela-karolyi.webp",
            "Text": "I know gymnastics. It's always been a subjective appreciation.",
            "Title": "Romanian Coach",
            "Name": "Bela Karolyi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/tali-lennox.webp",
            "Text": "Art is subjective. I'm not looking for people's praise.",
            "Title": "British Model",
            "Name": "Tali Lennox"
        }
    ]
}