{
    "currentWord": {
        "wordRoot": "submit",
        "id": 8741,
        "phonemic": "səbˈmɪt|səbˈmɪt\r",
        "bigId": "84874d85-77c2-4303-99be-7187ba5565ac",
        "wordForms": [
            "submits",
            "submitting",
            "submitted",
            "submit"
        ]
    },
    "senses": [
        {
            "id": "84874d85-77c2-4303-99be-7187ba5565ac",
            "de": "To give or offer something for decision or judgment",
            "ty": "verb",
            "ex": "I have to submit my essay by next week.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "submit an application",
                " submit a proposal",
                " submit a request"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/84874d85-77c2-4303-99be-7187ba5565ac.webp",
            "Tips": [
                {
                    "title": "Deadline Context",
                    "description": "Used when referring to deadlines or due dates for assignments and projects.",
                    "example": "Students must submit their final projects by April 30th.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/WsAlFsvNDJBvk3FzlyPxucArVE.webp"
                },
                {
                    "title": "Process Step",
                    "description": "Often indicates the next step in a series of actions, such as applications or processes.",
                    "example": "After reviewing the guidelines, submit your application online.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/p3YBhM9Mb7SVSBkKMkwrlGF0M.webp"
                },
                {
                    "title": "Professional Tone",
                    "description": "Conveys a formal, professional interaction, especially in written communication.",
                    "example": "Please submit your report to the manager for approval.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/LDJNSYfcvXVipidHb0YjKq8Qk.webp"
                }
            ]
        },
        {
            "id": "21c9968b-9baf-42a7-b503-caadfec6f55a",
            "de": "To accept or yield to a superior force or strength",
            "ty": "verb",
            "ex": "The rebels had no choice but to submit to the government forces.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "submit to authority",
                " submit to pressure",
                " submit to will"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/21c9968b-9baf-42a7-b503-caadfec6f55a.webp",
            "Tips": [
                {
                    "title": "Power Dynamics",
                    "description": "Indicates acknowledging someone else's control or authority, often reluctantly.",
                    "example": "The employees had to submit to the new company policies.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Reluctant Acceptance",
                    "description": "May indicate a lack of choice or the need to accept a situation begrudgingly.",
                    "example": "After the debate, he was forced to submit to the opposing argument.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "991c4bfb-f7ec-44e8-9927-69a33fb35d06",
            "de": "To suggest or propose something",
            "ty": "verb",
            "ex": "She submitted a new plan to solve the issue.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "submit a proposal",
                " submit a suggestion",
                " submit a plan"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/991c4bfb-f7ec-44e8-9927-69a33fb35d06.webp",
            "Tips": [
                {
                    "title": "Idea Presentation",
                    "description": "Suggests a more collaborative context where ideas are being offered for discussion.",
                    "example": "Lara submitted her idea for the team's project theme.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Innovation Implication",
                    "description": "Often associated with proposing new, innovative ideas or improvements.",
                    "example": "The committee encouraged staff to submit any innovative solutions they had.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "5f0e2885-19b7-4f31-ba8e-056a6f31f4a8",
            "de": "To subject oneself, as in obedience or resignation, to the power and authority of a higher entity",
            "do": "Theological",
            "ty": "verb",
            "ex": "You have to submit yourself to God's will.",
            "use": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "submit to god's will",
                " submit oneself to fate",
                " submit to divine power"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5f0e2885-19b7-4f31-ba8e-056a6f31f4a8.webp",
            "Tips": [
                {
                    "title": "Spiritual Obedience",
                    "description": "Used in a spiritual context, often implying voluntary obedience to religious faith or teachings.",
                    "example": "Devotees submit themselves to a life of meditation and prayer.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Moral Surrender",
                    "description": "Can also imply a moral decision to follow a particular belief or code.",
                    "example": "Through her charity work, she learned to submit to the needs of others.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "8a6aca06-1051-4c4d-82c9-82b235971b44",
            "de": "To present (a proposal, application, etc.) for the consideration or judgment of another",
            "do": "Legal",
            "ty": "verb",
            "ex": "We submitted our evidence to the court.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "submit evidence",
                " submit documents",
                " submit a proposal"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8a6aca06-1051-4c4d-82c9-82b235971b44.webp",
            "Tips": [
                {
                    "title": "Legal Procedures",
                    "description": "Relates to formal submission of documents or evidence as part of legal processes.",
                    "example": "The lawyer will submit the appeal to the higher court tomorrow.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Formal Documentation",
                    "description": "Indicates the act of providing official, often written, materials as required.",
                    "example": "Applicants must submit their passports along with the visa application form.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Accord": {
            "wordRoot": "Accord",
            "wordDefinition": "Accord means to reach an agreement with someone or something. This is usually when two or more people discuss and negotiate to come to a mutual understanding or make a compromise, so that each person can get what they want or need.\n\nFor example, two friends can accord to watch one movie that they both like at different times.\n\nSo, while accord implies a discussion and coming to an agreement, submit usually implies following rules or regulations without questioning them.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a5b6a89c-40bf-4039-8a24-9345b7b8d28c.webp"
        },
        "Comply": {
            "wordRoot": "Comply",
            "wordDefinition": "Comply means to obey or follow a rule, law or request. It implies that a person is willingly following the given order.\n\nHowever, if a teacher asks a student to comply with the classroom rules, the student has the option to either follow or not follow them.\n\nComply suggests a voluntary action, while submit suggests an obligatory action.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/20acb2e9-463d-48b3-9197-3498d5c51b06.webp"
        },
        "Concede": {
            "wordRoot": "Concede",
            "wordDefinition": "Concede means to admit that something is true or correct, even if you did not want to.\n\nIt can also mean to admit defeat in a competition or argument. For example, \"After arguing for hours, John conceded that Mary was right.\".\n\nConcede involves admitting something is true, while submit involves giving in to someone or something with more power.\n\nConcede is used more in the context of arguments, while submit is used more in the context of authority or submitting something for approval.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f079101d-524b-41bd-937e-4dc0dccee8c2.webp"
        },
        "Conform": {
            "wordRoot": "Conform",
            "wordDefinition": "Conform means to adhere to or follow a set of rules, standards, or expectations. This is often done voluntarily as a way to fit in or be accepted by a group or society.\n\nIn simpler terms, conforming is more of a personal choice to fit in, while submitting is often done out of a sense of obligation or pressure.\n\nConforming may be applicable in social settings or workplaces where certain behaviors or dress codes are expected, while submitting may be applicable in situations such as obeying laws or following orders in a hierarchy.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ed0ab58e-cfda-45a6-ae7d-8828d790752e.webp"
        },
        "Consent": {
            "wordRoot": "Consent",
            "wordDefinition": "Consent means giving permission or agreeing to something. It is applicable in situations where someone needs to agree to an action or decision that affects them.\n\nFor example, a patient may need to give their consent before undergoing surgery.\n\nConsent refers to giving permission or agreeing to something, while submit refers to complying with rules or regulations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ca95c1f4-a710-4161-a7a2-a1854ba3b183.webp"
        },
        "Relinquish": {
            "wordRoot": "Relinquish",
            "wordDefinition": "Relinquish means to voluntarily give up or let go of something or someone. It often carries a sense of giving up control or ownership.\n\nFor example, a person might relinquish their claim to a property or relinquish their position of power.\n\nRelinquish is more about giving up control, while submit is more about giving in to a higher power or authority.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/733da940-4090-478d-9575-aa9dcd7bae82.webp"
        },
        "Succumb": {
            "wordRoot": "Succumb",
            "wordDefinition": "Submit means to give in or agree to something willingly or unwillingly, whereas succumb means to give in or give up completely because of pressure or persuasion, often in a negative sense.\n\nSubmitting is a choice, while succumbing is often seen as a negative or weaker action. Submitting is applicable in situations where you willingly agree to something or someone, while succumbing is more applicable in situations where you are overwhelmed or defeated by something or someone.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/83f0a94b-2542-4106-9ad5-86238b823136.webp"
        },
        "Surrender": {
            "wordRoot": "Surrender",
            "wordDefinition": "Surrender means to give up or relinquish control or possession of something. It often implies defeat or yielding to a stronger force.\n\nFor example, a soldier might surrender to an enemy army or a criminal might surrender to the police.\n\nSubmit is more neutral and can be used in a variety of situations, while surrender usually connotes a more significant sense of loss or defeat.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a0619e96-d509-4b9d-bf56-12d4f832b98d.webp"
        },
        "Yield": {
            "wordRoot": "Yield",
            "wordDefinition": "Both submit and yield mean to give in or surrender in some way, but they are used in slightly different situations.\n\nYield usually means to give up or surrender to something more powerful or inevitable, like a yield sign telling you to give priority to other drivers.\n\nFor example, you might yield to the demands of someone in authority, like a boss or a coach.\n\nSubmit is more often used in formal contexts (like submitting a form), while yield is used in both formal and everyday communication (like yielding to another driver on the road).",
            "wordImage": "https://word-images.cdn-wordup.com/senses/32e8d641-bbe4-4dd2-9239-d1f660d6c72d.webp"
        }
    },
    "videos": [
        {
            "Text": " it probably wouldn't get published in a journal. And in fact, we know that that's true, because several different groups of research scientists tried to replicate the findings of this precognition study, and when they submitted it to the exact same journal, the journal said, \"No, we're not interested in publishing",
            "Title": "What doctors don't know...",
            "VideoId": "RKmxL8VYy0M",
            "Controls": "start=81"
        },
        {
            "Text": " Liam and submitted and laid down on her back and my one-year-old son walked over there and got on top of his chest and grabbed her ears and put his thumb in her nose and putting his hand in her mouth and she wasn't doing anything she was just laying there and taking every bit of it",
            "Title": "Soldier Adopts Dog That...",
            "VideoId": "d1NkQhzZXDE",
            "Controls": "start=117"
        },
        {
            "Text": " and this is a spread from a zine that I made last year when I -- I mean, I think I've let myself go a bit on the illustration front since. But, yeah. So I said on my blog that I wanted to start this publication for teenage girls and ask people to submit",
            "Title": "Tavi Gevinson: A teen...",
            "VideoId": "E22icGCvGXk",
            "Controls": "start=279"
        },
        {
            "Text": " Of course, same thing. The scientific embargo -- a paper has been submitted to \"Nature,\" hopefully, it will be accepted. It deals with the state of compassion, unconditional compassion. We asked meditators, who have been doing that for years and years,",
            "Title": "The habits of happiness...",
            "VideoId": "vbLEf4HR74E",
            "Controls": "start=990"
        },
        {
            "Text": " I'm going to start off we canvassed our TEDx amazing TEDx community around the world and I have picked two questions that were submitted from those questions for you so I'm going to just kick right",
            "Title": "Expanding our definition...",
            "VideoId": "8awctnozMdo",
            "Controls": "start=36"
        },
        {
            "Text": " leisure, happiness. All of these things can be measured. If they have improved over time, that, I submit, is progress. Let's go to the data, beginning with the most precious thing of all, life.",
            "Title": "Is the world getting...",
            "VideoId": "yCm9Ng0bbEQ",
            "Controls": "start=268"
        },
        {
            "Text": " sacred pole and submits his hands to the swarm their agony is unmistakable to help distract them the medicine man leads them in a dance around the pole to be seen as a true tribal warrior each",
            "Title": "Could You Pass the...",
            "VideoId": "XwvIFO9srUw",
            "Controls": "start=121"
        },
        {
            "Text": " by one each young man steps up to the sacred pole and submits his hands to the swarm their agony is unmistakable to help distract them the medicine man leads them in a dance around the pole to",
            "Title": "Initiation With Ants PIPE...",
            "VideoId": "ZGIZ-zUvotM",
            "Controls": "start=118"
        },
        {
            "Text": " And in many cases, members may willingly submit out of desire to belong and to attain the promised rewards. The cult environment discourages critical thinking, making it hard to voice doubts",
            "Title": "Why do people join...",
            "VideoId": "kB-dJaCXAxA",
            "Controls": "start=270"
        },
        {
            "Text": " the wandering male arrives and has a decision to make submit or fight",
            "Title": "Male Hippo Battles...",
            "VideoId": "Whmysnm9Vjw",
            "Controls": "start=93"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-tiffany.webp",
            "Text": "I thought a director was like a pillow who sat under the writer, supporting them and submitting to their vision. It took me a long time to realise that what a writer really wants is a production that matches the play and the writing. It is the only way the play can achieve its full potential.",
            "Title": "English Director",
            "Name": "John Tiffany"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vijay-sethupathi.webp",
            "Text": "I surrender to my directors. I do that because I respect them immensely. In fact, a director's talent scares me. I admit that they're more intelligent than me, and I submit to that, as an assistant director does. Even when I have suggestions to make, I don't state them strongly.",
            "Title": "Indian Actor",
            "Name": "Vijay Sethupathi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jenny-zhang.webp",
            "Text": "I just submitted what I had to the 'Octopus Books' contest open reading period, and they said they wanted to publish my poetry book. Then I started to publish more and more poetry because people would ask me to do readings or ask me submit something for their journal.",
            "Title": "Chinese Actress",
            "Name": "Jenny Zhang"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-piaget.webp",
            "Text": "With regard to moral rules, the child submits more or less completely in intention to the rules laid down for him, but these, remaining, as it were, external to the subject's conscience, do not really transform his conduct.",
            "Title": "Swiss Psychologist",
            "Name": "Jean Piaget"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jinkx-monsoon.webp",
            "Text": "I was always ready to submit my life to my career - but I don't think anything could have truly prepared me for the reality of that.",
            "Title": "American Entertainer",
            "Name": "Jinkx Monsoon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jan-blachowicz.webp",
            "Text": "I have made mistakes, but I didn't make them again. Even when I struggled, I promised myself never to submit in life.",
            "Title": "",
            "Name": "Jan Blachowicz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vidya-balan.webp",
            "Text": "It gives a different kind of high when, as an actor, I get to submit myself to the character I play.",
            "Title": "Indian Actress",
            "Name": "Vidya Balan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/joyce-meyer.webp",
            "Text": "The truth is, if we don't learn to submit to authority, we won't ever learn to submit to God.",
            "Title": "American Author",
            "Name": "Joyce Meyer"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cris-cyborg.webp",
            "Text": "I'm a two-time world champion in jiu-jitsu. I can try to submit you.",
            "Title": "Brazilian Athlete",
            "Name": "Cris Cyborg"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/miguel-de-cervantes.webp",
            "Text": "It is one thing to praise discipline, and another to submit to it.",
            "Title": "Spanish Novelist",
            "Name": "Miguel de Cervantes"
        }
    ]
}