{
    "currentWord": {
        "wordRoot": "substantial",
        "id": 16248,
        "phonemic": "səbˈstænʃl|səbˈstænʃl\r",
        "bigId": "95444393-dfd0-4242-b0cf-a79e5ab7c0d4",
        "wordForms": [
            "substantially",
            "insubstantial",
            "substantial"
        ]
    },
    "senses": [
        {
            "id": "95444393-dfd0-4242-b0cf-a79e5ab7c0d4",
            "de": "A lot of or a big amount",
            "ty": "adjective",
            "ex": "They received a substantial amount of money from the insurance company after the accident.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "substantial amount",
                " substantial evidence",
                " substantial portion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/95444393-dfd0-4242-b0cf-a79e5ab7c0d4.webp",
            "Tips": [
                {
                    "title": "Quantitative Measure",
                    "description": "Used for describing things that can be measured, often related to size or degree.",
                    "example": "The research had a substantial number of participants.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/cVEJa2CamzXmYYUEWipsiCUAhJI.webp"
                },
                {
                    "title": "Not Total",
                    "description": "'Substantial' indicates something is large, but less than complete or total.",
                    "example": "A substantial part of the forest remains untouched.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/yrKr1ydykJFm7AAXMUwRpd4DTI.webp"
                },
                {
                    "title": "Emphasis Addition",
                    "description": "Used to add emphasis, making a statement stronger or more forceful.",
                    "example": "His findings were supported by substantial research.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/rSqvxzGZmCXQRIgWctaYUqVNvm4.webp"
                }
            ]
        },
        {
            "id": "31789fa4-3a7f-44a9-8713-b55cfd1621f0",
            "de": "Strong, solid or sturdy",
            "ty": "adjective",
            "ex": "The house was of substantial construction and wasn't damaged in the storm.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "substantial construction",
                " substantial meal",
                " substantial support"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/31789fa4-3a7f-44a9-8713-b55cfd1621f0.webp",
            "Tips": [
                {
                    "title": "Quality Indication",
                    "description": "Indicates that something is made well and likely to last or withstand challenges.",
                    "example": "The furniture's substantial build promises durability.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Sense of Assurance",
                    "description": "Gives a sense of assurance or confidence in stability or support.",
                    "example": "She has the substantial support of her colleagues.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "698c12a1-8031-4683-9766-84da743c8dbd",
            "de": "Important, serious or significant",
            "ty": "adjective",
            "ex": "They made a substantial contribution to the charity.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "substantial improvement",
                " substantial change",
                " substantial contribution"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/698c12a1-8031-4683-9766-84da743c8dbd.webp",
            "Tips": [
                {
                    "title": "Noteworthy Impact",
                    "description": "Suggests an impact or result that is large enough to be noticed or seen as valuable.",
                    "example": "His work had a substantial impact on our success.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Seriousness Connotation",
                    "description": "Implies a certain level of seriousness or gravity in a situation or topic.",
                    "example": "The topic requires substantial discussion before a decision is made.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Acknowledgement of Value",
                    "description": "Expresses an acknowledgment that something is valuable or has a significant positive effect.",
                    "example": "Her advice played a substantial role in my career advancement.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Ample": {
            "wordRoot": "Ample",
            "wordDefinition": "Ample means enough, sufficient or satisfactory in quantity or size.\n\nIt is often used to describe the space, time, or resources that are enough for a particular purpose, such as ample time to complete a task.\n\nSo, in short, ample is used to refer to enough or sufficient in quantity or size, while substantial is used to refer to something that is considerable or significant in amount or degree.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/661701d7-017a-47e3-95b8-84803877e3df.webp"
        },
        "Considerable": {
            "wordRoot": "Considerable",
            "wordDefinition": "Both words indicate that something is large or significant, but considerable suggests that it is a large amount or degree compared to what is typical or usual, while substantial suggests that it is important or impactful.\n\nFor example, you might say \"she made a considerable effort to finish the project on time,\" indicating that the effort was more than what is typically required.\n\nOverall, both words are used to emphasize the size or importance of something, but considerable emphasizes the quantitative aspect, while substantial emphasizes the qualitative impact.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4b859e1c-6861-4d93-bb20-11d9f5a766f4.webp"
        },
        "Important": {
            "wordRoot": "Important",
            "wordDefinition": "Important means something that has an important role or significance, while substantial means something that is large or significant in amount or degree.\n\nImportant is often used to describe things that are crucial or have a significant impact, like important decisions or important people.\n\nSo, both words are used to describe something that has significance, but important refers to the role it plays, while substantial refers to the quantity or size.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b7874512-abf0-477a-93be-7fb406dab70e.webp"
        },
        "Material": {
            "wordRoot": "Material",
            "wordDefinition": "Both “material” and “substantial” typically mean “important” or “significant.” However, “material” often refers to physical things or assets, while “substantial” usually describes abstract concepts or amounts.\n\nFor example, “material evidence” refers to physical proof while “substantial results” typically refer to significant findings in a study or research.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf40d611-a733-45e4-89b6-7d03cd83581b.webp"
        },
        "Meaningful": {
            "wordRoot": "Meaningful",
            "wordDefinition": "Meaningful refers to something that has a deep and significant purpose or intention behind it. It may have emotional or personal value attached to it.\n\nFor example, a meaningful conversation is one that is important and leaves a lasting impact on one's thoughts or feelings.\n\nMeaningful is about the quality or significance of something, while substantial is about the quantity or size of something.\n\nMeaningful can relate to emotions or ideas, while substantial relates to physical things or measurable values. Both words can describe different aspects of a situation or thing, depending on the context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/054fd63e-2f9c-498a-bee5-f2d1fa26d4c1.webp"
        },
        "Significant": {
            "wordRoot": "Significant",
            "wordDefinition": "The words significant and substantial are similar in meaning but have slightly different uses. Significant means something is important or meaningful, usually in a specific context, such as a study or experiment.\n\nIt's used to describe the importance or value of something. For example, a scientist might say that a particular finding is significant because it helps to confirm a hypothesis they've been testing.\n\nSignificant describes importance, while substantial describes size or quantity.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b39f198e-2003-4bdf-befd-191832e5bfe7.webp"
        },
        "Sizeable": {
            "wordRoot": "Sizeable",
            "wordDefinition": "Both sizeable and substantial mean large or significant, but sizeable typically refers to physical size or amount, while substantial can refer to physical size, amount, or importance.\n\nFor example, you could say \"The cake was a sizeable portion\" meaning it was a large amount of cake. Another example could be \"The elephant was a sizeable animal,\" meaning it was a big animal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b4f59cfa-7045-4c7a-80a4-8adea2cd7554.webp"
        },
        "Weighty": {
            "wordRoot": "Weighty",
            "wordDefinition": "Both substantial and weighty can refer to something that has a significant or important impact or value.\n\nHowever, substantial often refers to something that is large or significant in amount or size, while weighty typically refers to something that is important, serious, or influential.\n\nFor example, a substantial meal might be large or filling, while a weighty decision might be one with significant consequences.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4c06f7d4-b5ab-4130-8d62-47ac7b2f01ec.webp"
        }
    },
    "videos": [
        {
            "Text": " and have too many details at the same time, which if you were trying for that, you wouldn't be able to do it, and it just looks bad at a distance, but having deep meaning puts that element in the plus column. Behind the phoenix, the background is mostly white, and then it has a substantial gold border around it.",
            "Title": "Why city flags may be...",
            "VideoId": "pnv5iKB2hl4",
            "Controls": "start=401"
        },
        {
            "Text": " meters long she's as big as any female crocodilian will get males get substantially bigger but eggs and tiny hatchlings are utterly vulnerable in the wild we can now make sure this brood will be raised safe from predators until they're old enough to take care of",
            "Title": "Orinoco Crocodile...",
            "VideoId": "olYnWXqM7YQ",
            "Controls": "start=177"
        },
        {
            "Text": " over the planet. Today, we humans dig up fossilized complex life and burn it for fuel. This practice pumps vast amounts of carbon dioxide into the atmosphere, and like our microbial predecessors, we have begun to make substantial changes to our planet.",
            "Title": "This ancient rock is...",
            "VideoId": "idfv7Lw4Y_s",
            "Controls": "start=463"
        },
        {
            "Text": " And when he recorded the vibrations produced by worm grunters and moles digging, their frequencies overlapped substantially. This was it. Over hundreds of thousands of years, these earthworms evolved a behavior that helped them escape a top predator.",
            "Title": "This weird trick will...",
            "VideoId": "RDA64eUoxag",
            "Controls": "start=184"
        },
        {
            "Text": " and variations in the bacteria species that live in our digestive systems. No matter the cause, obesity is an escalating global epidemic. It substantially raises the probability of diseases, like diabetes, heart disease, stroke, high blood pressure,",
            "Title": "What is obesity? - Mia...",
            "VideoId": "-vNVG7XJpVE",
            "Controls": "start=177"
        },
        {
            "Text": " a substantial amount of water early on that was able to stay put, despite the lack of an atmosphere, though asteroids may have brought more over the eons. If this turns out to be true, life may have formed much earlier than previously thought.",
            "Title": "Where did Earth’s water...",
            "VideoId": "RwtO04EXgUE",
            "Controls": "start=176"
        },
        {
            "Text": " For most of architectural history, heavy building materials made it difficult for tall buildings to support their own weight. To compensate, taller structures had wider, thicker masonry at the base, making them substantially more expensive.",
            "Title": "How the world’s tallest...",
            "VideoId": "el1K-xILtwo",
            "Controls": "start=45"
        },
        {
            "Text": " never have a majority of the landscape under some sort of formal protection it's really ranchers that have a substantial portion of land under their stewardship and really ranching that can be the right hand to conservation",
            "Title": "Chase a Wild Buffalo...",
            "VideoId": "85_nJwYqE_c",
            "Controls": "start=449"
        },
        {
            "Text": " word poetry and it is without an ounce of exaggeration that I say my whole world changed probably the most substantial evidence is the way that I've been able to share poetry farther and farther away from home since giving",
            "Title": "Poetry makes people...",
            "VideoId": "WHbgZcur7ik",
            "Controls": "start=156"
        },
        {
            "Text": " to nab a more substantial meal now what these baby rats are safe because mom is guarding the nest but mom has to go grocery shopping leaving the babies completely helpless",
            "Title": "Giant Centipede PIPE...",
            "VideoId": "TzF0GKfOvRY",
            "Controls": "start=129"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/raymond-moody.webp",
            "Text": "I felt the question of the afterlife was the black hole of the personal universe: something for which substantial proof of existence had been offered but which had not yet been explored in the proper way by scientists and philosophers.",
            "Title": "American Philosopher",
            "Name": "Raymond Moody"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frankie-faison.webp",
            "Text": "Don't be afraid to see the gift and talent you have, because that thing could lead to a substantial career for you. Because we all do something as good or better than most people.",
            "Title": "American Actor",
            "Name": "Frankie Faison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerome-powell.webp",
            "Text": "The GSEs became powerful advocates for their own bottom lines, providing substantial financial support for political candidates who supported the GSE agenda.",
            "Title": "American Public Servant",
            "Name": "Jerome Powell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/yotam-ottolenghi.webp",
            "Text": "Dried porcini add a substantial, deep flavour to otherwise more neutral vegetables. I use them in risottos, mashed roots and winter soups.",
            "Title": "Israeli Chef",
            "Name": "Yotam Ottolenghi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robin-zander.webp",
            "Text": "I used to collect comic books. I had a substantial collection. I collect records also, but those have gone the way of the world.",
            "Title": "American Musician",
            "Name": "Robin Zander"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/e-o-wilson.webp",
            "Text": "Ants are the leading removers of dead creatures on the land. And the rest of life is substantially dependent upon them.",
            "Title": "American Scientist",
            "Name": "E. O. Wilson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elon-musk.webp",
            "Text": "Some companies out there quote a start of production that is substantially in advance of when customers get their cars.",
            "Title": "South African Businessman",
            "Name": "Elon Musk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kate-brown.webp",
            "Text": "I know what it feels like to be paid less - substantially less - than the male lawyer in the office next to me.",
            "Title": "American Politician",
            "Name": "Kate Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johnny-lever.webp",
            "Text": "I would love to do a substantial role but it has to suit me, my personality. Only then will I take it up.",
            "Title": "Indian Actor",
            "Name": "Johnny Lever"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/deepti-naval.webp",
            "Text": "Heartless' is a rare commercial film where I have a substantial role.",
            "Title": "Indian Actress",
            "Name": "Deepti Naval"
        }
    ]
}