{
    "currentWord": {
        "wordRoot": "substitute",
        "id": 20507,
        "phonemic": "ˈsʌbstɪtjuːt|ˈsʌbstɪtuːt\r",
        "bigId": "8672302f-240e-4848-9e34-d825ea4aac87",
        "wordForms": [
            "substitutes",
            "substituting",
            "substituted",
            "substitution",
            "substitute"
        ]
    },
    "senses": [
        {
            "id": "8672302f-240e-4848-9e34-d825ea4aac87",
            "de": "A person or thing acting in place of another.",
            "ty": "noun",
            "ex": "He is a substitute for my classmate who is sick.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8672302f-240e-4848-9e34-d825ea4aac87.webp",
            "Tips": [
                {
                    "title": "Temporary Replacement",
                    "description": "Refers to someone who takes a place for a short time, not permanently.",
                    "example": "Sara was a substitute teacher for just one week.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/FRDhAA2BFDoCPsA1ReHqzmZLqzg.webp"
                },
                {
                    "title": "Not Identical",
                    "description": "The substitute might be similar but not exactly the same as what it replaces.",
                    "example": "Almond milk can be a good substitute for cow's milk in recipes.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/nWPd66baQXvGQUkA4lKbDcVb1eI.webp"
                },
                {
                    "title": "Plan B",
                    "description": "A substitute often acts as a backup option when the original is unavailable.",
                    "example": "An in-class assignment was the substitute for the canceled field trip.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ExTeOd6aEdBwDAHMj1Cq9h6go4M.webp"
                }
            ]
        },
        {
            "id": "456fdcd7-bf90-417e-828d-b10f55c22041",
            "de": "Put or use in place of another.",
            "ty": "verb",
            "ex": "I had to substitute salt for sugar because I ran out.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/456fdcd7-bf90-417e-828d-b10f55c22041.webp",
            "Tips": [
                {
                    "title": "Immediate Exchange",
                    "description": "Substitute as a verb implies an immediate or direct replacement.",
                    "example": "Can I substitute olive oil for butter in this recipe?\r",
                    "imageUrl": ""
                },
                {
                    "title": "Situational Need",
                    "description": "Use substitute when an original item or person is unavailable or unsuitable.",
                    "example": "She had to substitute regular classes with online ones due to health issues.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Flexibility in Usage",
                    "description": "Substitute can be used in a wide range of contexts, from cooking to sports.",
                    "example": "You can substitute the morning workout with an evening walk.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "42c2cb94-37c2-4a8d-a742-c8ec95bc007c",
            "de": "A person who plays for another who is injured or unable to play in a sports team.",
            "do": "Sport",
            "ty": "noun",
            "ex": "He came on as a substitute when the team captain was injured.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Approving",
            "tp": "",
            "cl": [
                "substitute player",
                " substitute team",
                " substitute bench"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/42c2cb94-37c2-4a8d-a742-c8ec95bc007c.webp",
            "Tips": [
                {
                    "title": "Sports Context",
                    "description": "In sports, a substitute often enters the game after it has started.",
                    "example": "The substitute warmed up eagerly, ready to enter the match.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Strategic Substitution",
                    "description": "Coaches use substitutes strategically to change game dynamics.",
                    "example": "The coach planned to introduce a substitute at halftime to strengthen the defense.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "48a4669c-8cf1-4aec-83bb-82bf1ff9fa3d",
            "de": "Perform an action in place of another person in a play or a game.",
            "do": "Art, Sport",
            "ty": "verb",
            "ex": "John will substitute for Mary in the school play as she is ill.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Neutral",
            "tp": "",
            "cl": [
                "substitute actor",
                " substitute player",
                " substitute performer"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/48a4669c-8cf1-4aec-83bb-82bf1ff9fa3d.webp",
            "Tips": [
                {
                    "title": "Performance Stand-in",
                    "description": "Used in arts to denote a temporary replacement of a performer.",
                    "example": "Despite being a substitute, he delivered his lines flawlessly.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Role Adaptability",
                    "description": "Substitutes must quickly adapt to the roles they are filling in for.",
                    "example": "She prepared to substitute for the absent actress by studying the role all night.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Alternate": {
            "wordRoot": "Alternate",
            "wordDefinition": "Alternate means to switch between two things or to take turns in doing something. For example, if you have two favorite dishes, you could alternate between them when ordering food.\n\nAlternatively, if you and your friend are playing a game, you could alternate turns.\n\nAlternate means to switch between two things, while substitute means to replace one thing with another. Both words are applicable in different scenarios depending on the specific situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2f0addb2-e125-46da-b67c-37166500c092.webp"
        },
        "Backup": {
            "wordRoot": "Backup",
            "wordDefinition": "Backup means a secondary option that can replace the primary one if it fails or isn't available.\n\nIt is used when we want to ensure that we have a backup plan in case something goes wrong. For example, backing up important files on a computer.\n\nBackup is used as a precautionary measure in case of undesirable events, while substitute is used as an alternative to something that is not available or not optimal.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c32788ed-77b0-410a-9cd1-47e3a9cbe77d.webp"
        },
        "Deputy": {
            "wordRoot": "Deputy",
            "wordDefinition": "A deputy is a person appointed to take over the role of another person who is temporarily unavailable or absent. For example, a deputy sheriff may be appointed to take over the role of the sheriff if the sheriff is sick or on vacation.\n\nA deputy is typically expected to carry out the same duties and responsibilities as the person they are replacing.\n\nA deputy is someone who takes over temporarily for someone else in a specific role, while a substitute is someone who can fill in for anyone momentarily, regardless of the role they play.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cbe62731-2644-47d8-a0b9-f5614339d839.webp"
        },
        "Proxy": {
            "wordRoot": "Proxy",
            "wordDefinition": "A proxy is someone or something that acts on behalf of another person or thing. For example, in politics, a proxy can be a representative who votes on behalf of someone who cannot be present to vote themselves.\n\nIn computing, a proxy server acts as an intermediary between a client and the internet, as a way of anonymizing the user's requests.\n\nA proxy acts on behalf of someone or something, while a substitute replaces or fulfills the function of someone or something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/5db64639-7d9d-4ab3-bee8-12eeb9288c5d.webp"
        },
        "Replacement": {
            "wordRoot": "Replacement",
            "wordDefinition": "Replacement describes something that is used to replace a broken or damaged item, person or thing. For example, if the engine of a car is damaged, it may need to be replaced with a new one.\n\nSo, essentially, a replacement is used when something needs to be fixed or replaced, while a substitute is used when something is not available or not present.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9dd69984-be83-4380-93cd-09f51904f300.webp"
        },
        "Surrogate": {
            "wordRoot": "Surrogate",
            "wordDefinition": "A surrogate is a person or thing that serves as a substitute for something that can't be there. For example, a surrogate mother might carry a baby for someone else who can't have a baby themselves.\n\nThe key difference is that a substitute is a replacement for something or someone that is normally there, while a surrogate is a replacement for something that can't be there in the first place.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9123aee8-e70d-4698-92e3-4e35d51c1902.webp"
        },
        "Temporary": {
            "wordRoot": "Temporary",
            "wordDefinition": "Substitute refers to something or someone who replaces another thing or person permanently or for a long time, whereas temporary refers to something or someone who replaces another thing or person only for a limited time.\n\nIf a teacher is sick and another teacher comes in to teach the class for just one day, that teacher is temporary.\n\nSubstitute is used when referring to long-term replacements, and temporary is used when referring to short-term replacements.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/04ecdd69-290a-41f1-a0a0-19f9d0114e76.webp"
        }
    },
    "videos": [
        {
            "Text": " Honey is a great nutritional substitute for regular sugar because there are different types of sugars in there. We also have a classroom hives project, where -- this is a nonprofit venture -- we're spreading the word around the world for how honeybee hives can be taken into the classroom or into the museum setting, behind glass, and used as an educational tool.",
            "Title": "Noah Wilson-Rich: Every...",
            "VideoId": "R2kOgSVF2Uk",
            "Controls": "start=595"
        },
        {
            "Text": " thirty years of research and dedication paid off the success rate with orphans soared and has paid dividends for matora who would almost certainly have died but for the success of the substitute milk you must feel that it's been worthwhile oh you know when you go down there and",
            "Title": "Feeding Baby Orphaned...",
            "VideoId": "qoXBIDikriU",
            "Controls": "start=324"
        },
        {
            "Text": " paid off the success rate with orphans has soared and has paid dividends for mutora who would almost certainly have died but for the success of the substitute milk the otter family have cubs seeing autocubs in the wild like this is extremely rare",
            "Title": "Adorable Baby Animal...",
            "VideoId": "W9zdyytICHU",
            "Controls": "start=952"
        },
        {
            "Text": " They're not going to be a substitute for a strong culture or for stronger leadership, but when those fundamentals are in place, they can take you to the mountaintop. I want you to think about your life for a moment. Do you have the right metrics?",
            "Title": "Why the secret to...",
            "VideoId": "L4N1q4RNi9I",
            "Controls": "start=601"
        },
        {
            "Text": " This part of the process changes as technology evolves. But focus groups have remained largely the same for decades. Perhaps when it comes to the big, important questions, there's no substitute for people genuinely interacting with each other.",
            "Title": "How do focus groups...",
            "VideoId": "3TwgVQIZPsw",
            "Controls": "start=254"
        },
        {
            "Text": " can get up enough people to influence school board okay again I'm an educator so I'm here to tell you the consequence of that if you substitute religious philosophy for science there will be a generation of people who will not",
            "Title": "Neil deGrasse Tyson on...",
            "VideoId": "VO969i-qgxE",
            "Controls": "start=201"
        },
        {
            "Text": " which opens up this technology globally, even for the poorest countries. Now, we've been very encouraged by our results with sensory substitution, but what we've been thinking a lot about is sensory addition.",
            "Title": "Can we create new senses...",
            "VideoId": "4c1lqFXHvqI",
            "Controls": "start=832"
        },
        {
            "Text": " I call them zombie nouns, because they consume the living. They cannibalize active verbs, they suck the lifeblood from adjectives, and they substitute abstract entities for human beings. Here's an example.",
            "Title": "Beware of nominalizations...",
            "VideoId": "dNlkHtMgcPQ",
            "Controls": "start=55"
        },
        {
            "Text": " prescribed combinations, or to opt for particular food substitutes, like drinks, bars, or powders. The truth is shedding pounds in the long run simply doesn't have a quick-fix solution.",
            "Title": "How to spot a fad diet -...",
            "VideoId": "8V15Z-yyiVg",
            "Controls": "start=154"
        },
        {
            "Text": " eventually the new order begins to establish itself by technological substitution and outright suppression the population of fires plummets good fires as well as bad fires it falls",
            "Title": "How fire shapes...",
            "VideoId": "LPC7UQyQQhQ",
            "Controls": "start=346"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/zig-ziglar.webp",
            "Text": "Money is not the most important thing, but when you need it, there are few substitutes. So while I like the things money can buy, I love what money won't buy. It bought me a house but it won't buy me a home. It would buy me a companion but it won't buy me a friend.",
            "Title": "American Author",
            "Name": "Zig Ziglar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/elon-musk.webp",
            "Text": "The problem is that at a lot of big companies, process becomes a substitute for thinking. You're encouraged to behave like a little gear in a complex machine. Frankly, it allows you to keep people who aren't that smart, who aren't that creative.",
            "Title": "South African Businessman",
            "Name": "Elon Musk"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/ivanka-trump.webp",
            "Text": "Love what you do. There's always going to be someone else who's smarter than you, but there's no substitute for passion. People who are passionate always work the hardest, and that sets them apart.",
            "Title": "American Businesswoman",
            "Name": "Ivanka Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-dickens.webp",
            "Text": "Electric communication will never be a substitute for the face of someone who with their soul encourages another person to be brave and true.",
            "Title": "English Novelist",
            "Name": "Charles Dickens"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-simon.webp",
            "Text": "My life so common it disappears and sometimes even music cannot substitute for tears.",
            "Title": "American Musician",
            "Name": "Paul Simon"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-louis-stevenson.webp",
            "Text": "Books are good enough in their own way, but they are a poor substitute for life.",
            "Title": "Scottish Writer",
            "Name": "Robert Louis Stevenson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/michael-heisley.webp",
            "Text": "There's very little substitute in the business world for making money.",
            "Title": "American Businessman",
            "Name": "Michael Heisley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/fran-lebowitz.webp",
            "Text": "Humility is no substitute for a good personality.",
            "Title": "American Journalist",
            "Name": "Fran Lebowitz"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nick-nolte.webp",
            "Text": "Acting is a bit of a substitute for life.",
            "Title": "American Actor",
            "Name": "Nick Nolte"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rush-limbaugh.webp",
            "Text": "Compassion is no substitute for justice.",
            "Title": "American Entertainer",
            "Name": "Rush Limbaugh"
        }
    ]
}