{
    "currentWord": {
        "wordRoot": "suggestion",
        "id": 17787,
        "phonemic": "səˈdʒestʃən|səɡˈdʒestʃən\r",
        "bigId": "df1df3e0-3c62-4c1e-afbe-3b4ccb5e46c2",
        "wordForms": [
            "suggestions",
            "suggestion"
        ]
    },
    "senses": [
        {
            "id": "df1df3e0-3c62-4c1e-afbe-3b4ccb5e46c2",
            "de": "An idea or plan that you offer for someone to think about",
            "ty": "noun",
            "ex": "She made some very helpful suggestions for improving the proposal.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "make a suggestion",
                " offer a suggestion",
                " accept a suggestion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/df1df3e0-3c62-4c1e-afbe-3b4ccb5e46c2.webp",
            "Tips": [
                {
                    "title": "Expressing Ideas",
                    "description": "Use 'suggestion' when presenting a new idea, especially in group settings or meetings.",
                    "example": "I have a suggestion for increasing productivity.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ceC0DWI4WKcZ1kbig1OIqEfFTM.webp"
                },
                {
                    "title": "Polite Proposals",
                    "description": "'Suggestion' is polite, not forceful, conveying willingness to consider alternatives.",
                    "example": "Might I make a suggestion regarding the schedule?\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/294WqM7XHxyQrhzsWBIDgULbA.webp"
                },
                {
                    "title": "Opening Discussions",
                    "description": "A 'suggestion' can initiate discussion without committing to a specific course of action.",
                    "example": "As a suggestion, perhaps we could survey our customers.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/mLUjSQhHgCXzEMryGxkbzd9wi64.webp"
                }
            ]
        },
        {
            "id": "f9d1b5a2-17f5-4c16-ba39-bcf18690012c",
            "de": "A hint or indication about something",
            "ty": "noun",
            "ex": "His face gave no suggestion of his actual thoughts.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "give a suggestion",
                " hint or suggestion",
                " lack of suggestion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/f9d1b5a2-17f5-4c16-ba39-bcf18690012c.webp",
            "Tips": [
                {
                    "title": "Subtle Clues",
                    "description": "Use 'suggestion' to point out subtle cues that imply something indirectly.",
                    "example": "There was a suggestion of irritation in his voice.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Implied Meanings",
                    "description": "'Suggestion' can be about implied meanings rather than direct statements.",
                    "example": "The dark clouds were a suggestion that rain was coming.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Reading Between Lines",
                    "description": "Detect 'suggestion' when interpreting unspoken or hinted messages in communication.",
                    "example": "His hesitation was a suggestion that he disagreed.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "8eb33db0-7054-41dd-9f16-17a2e1558c2c",
            "de": "The process of leading or causing a person to consider something, especially through indirect methods",
            "ty": "noun",
            "ex": "Through a process of suggestion and reassurance, he eventually convinced them to agree.",
            "use": "",
            "co": "Psychological",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "process of suggestion",
                " suggestion and reassurance",
                " psychological suggestion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8eb33db0-7054-41dd-9f16-17a2e1558c2c.webp",
            "Tips": [
                {
                    "title": "Persuasion Technique",
                    "description": "'Suggestion' in psychology means gently influencing others to consider a point of view.",
                    "example": "The therapist used suggestion to challenge the patient's fears.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Indirect Influence",
                    "description": "Indirect 'suggestion' can be powerful in guiding someone without explicit instruction.",
                    "example": "With clever suggestion, he guided them to the solution.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Subconscious Impact",
                    "description": "'Suggestion' might work subconsciously, affecting thoughts or actions without overt persuasion.",
                    "example": "The ad relied on suggestion to create a desire for the product.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Advice": {
            "wordRoot": "Advice",
            "wordDefinition": "Advice and suggestion are two similar words that express different ideas and have different uses.\n\nAdvice is a recommendation or guidance given by someone who has expertise or experience in a particular area.\n\nIt is usually more authoritative and personal in nature. For example, if you are seeking career advice from a professional, they might give you advice on which jobs to apply for, and how to present your credentials.\n\nAdvice is typically given by someone who has knowledge or experience in an area, while suggestions can come from anyone and are less authoritative.\n\nAdvice is also more specific and personalized, while suggestions provide a general direction but leave room for the person to make their own choices.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/03cd11f5-c7e1-49d7-85cb-eeff462802cf.webp"
        },
        "Counsel": {
            "wordRoot": "Counsel",
            "wordDefinition": "Counsel is advice given by a professional or an expert in a specific field. For example, a lawyer may give legal counsel to a client.\n\nBoth counsel and suggestion are applicable in different situations. Counsel is more formal and usually given by professionals, while suggestion is more casual and can be given by anyone.\n\nCounsel is usually given to help solve a specific problem, while suggestion can be given for a variety of reasons.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/93a4f852-49a4-4326-85e1-72d7cd9b14fd.webp"
        },
        "Hint": {
            "wordRoot": "Hint",
            "wordDefinition": "A hint is a subtle or indirect clue or piece of information that suggests something, whereas a suggestion is a proposal or idea put forward for consideration or action.\n\nHints are often used when someone is trying to give a clue or help someone in figuring out something, but they don't want to say it directly.\n\nFor example, if someone loses their keys, a person might drop a hint by saying something like, \"Maybe check the pockets of your jacket.\"\n\nIn summary, hints are more subtle and indirect, while suggestions are more straightforward and offer possible solutions or ideas.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/afc54379-7285-4a8d-bcdd-44ea895b197e.webp"
        },
        "Idea": {
            "wordRoot": "Idea",
            "wordDefinition": "Idea refers to a thought or concept that someone has come up with.\n\nAn idea is applicable when someone is trying to come up with something original or innovative, while a suggestion is applicable when someone wants to offer help or advice to someone else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/9fdfee73-17b5-4c2c-a272-ec642a6f60b6.webp"
        },
        "Opinion": {
            "wordRoot": "Opinion",
            "wordDefinition": "An opinion is a personal belief or feeling you have about something, and it may or may not be based on facts. For example, \"In my opinion, the movie was boring.\".\n\nBoth can be applicable in different situations. Opinions are often used when expressing personal thoughts, experiences, or preferences.\n\nOverall, when giving an opinion, you are sharing your own thoughts and feelings, and when giving a suggestion, you are sharing an idea or recommendation that may be beneficial to someone else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c9414f24-c729-4884-a21f-37bb6698d232.webp"
        },
        "Proposal": {
            "wordRoot": "Proposal",
            "wordDefinition": "A proposal is a formal plan or offer that is presented for consideration or acceptance. This means that a proposal is a well-thought-out idea that is usually supported by facts, research, and other evidence.\n\nFor example, a company might submit a proposal to a potential client outlining their services and costs.\n\nA proposal is a formal plan or offer based on research and evidence, while a suggestion is a more informal idea or thought.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ce2cecf1-c04e-45fe-b430-b6bcddfab04e.webp"
        },
        "Proposition": {
            "wordRoot": "Proposition",
            "wordDefinition": "A proposition is a formal statement or proposal made for consideration and acceptance. It often refers to an idea or plan that is being put forward for others to agree with or act upon.\n\nA proposition is a more formal idea or statement that is meant to be agreed upon, while a suggestion is a less formal recommendation meant to be considered.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e8cd57b7-6892-4d37-9362-01ac1209058b.webp"
        },
        "Recommendation": {
            "wordRoot": "Recommendation",
            "wordDefinition": "A recommendation is a piece of advice that someone gives based on their experience or expertise.\n\nIt is usually given with the intention of helping someone make a decision or take an action. For example, a doctor may give a recommendation for a certain medication to treat a patient's illness.\n\nA suggestion is an idea or proposal that someone offers, usually in a less formal way than a recommendation.\n\nA recommendation is a specific piece of advice given with a clear intention, while a suggestion is an idea offered to inspire or stimulate thought.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7884960e-a756-412b-b2e5-95a44209b0e6.webp"
        }
    },
    "videos": [
        {
            "Text": " And for so many of us, when we have an important idea, we don't bother to try. But I have some good news for you. You are not going to get judged on your bad ideas. A lot of people think they will. If you look across industries and ask people about their biggest idea, their most important suggestion,",
            "Title": "The surprising habits of...",
            "VideoId": "fxbCHn6gE3U",
            "Controls": "start=752"
        },
        {
            "Text": " Enough of us know Bill over many years and have seen the passion and engagement in this to know that you are crazy. So get over it, and let's look at the actual problem of solving this pandemic. Honestly. If anyone in the chat here has a suggestion, a positive suggestion for how you can,",
            "Title": "How the pandemic will...",
            "VideoId": "jmQWOPDqxWA",
            "Controls": "start=2044"
        },
        {
            "Text": " and even the insides of his friends, which is probably pretty awkward. Once the hapless square comes to terms with the third dimension, he begs his host to help him visit the fourth and higher dimensions, but the sphere bristles at the mere suggestion of dimensions higher than three",
            "Title": "Exploring other...",
            "VideoId": "C6kn6nXMWF0",
            "Controls": "start=154"
        },
        {
            "Text": " last that long okay and so so there are about two three years lifetime so if you're planning on foot anyway is just not gonna not gonna work they're very inexpensive suits that you can always go out and buy that for the next month so what's a suggestion that astronomers",
            "Title": "Watch the Total Solar...",
            "VideoId": "oLBwibYSzEk",
            "Controls": "start=1947"
        },
        {
            "Text": " of what a person is. There is a person who has all the things that make up our life experiences. But the suggestion I want to put to you today is that there's something fundamentally wrong with this model. And I can show you what's wrong with one click.",
            "Title": "Julian Baggini: Is there...",
            "VideoId": "Q80MfH7xPPE",
            "Controls": "start=176"
        },
        {
            "Text": " unconscious bias flows throughout most of our lives. It's really difficult to disentangle those strands. But he did have one suggestion. He used to work for two editors who said every story had to have at least one female source.",
            "Title": "Megan Kamerick: Women...",
            "VideoId": "rufeS-lZJg8",
            "Controls": "start=426"
        },
        {
            "Text": " and the computer is listening through its sensors. But that's really only half of the story. The real story is that the computer is on one side, making suggestions to the robot, and on the other side are the physics of the world.",
            "Title": "Meet Spot, the robot dog...",
            "VideoId": "AO4In7d6X-c",
            "Controls": "start=398"
        },
        {
            "Text": " You totally earned them. Yeah! Awesome. Wait, wait, wait. You still have your special mission, your secret mission. How are you going to spend these minutes of bonus life? Well, here's my suggestion.",
            "Title": "The game that can give...",
            "VideoId": "lfBpsV1Hwqs",
            "Controls": "start=1080"
        },
        {
            "Text": " was this so important I don't believe that the people receiving the food would care what color these planes were I came up with a few suggestions that I thought could help this humanitarian",
            "Title": "The supply-chain...",
            "VideoId": "Nv8Lm7xCQIw",
            "Controls": "start=447"
        },
        {
            "Text": " suggestion I can't win it when animals facing you and we panic it it's gonna run the way it's facing put the horns down and then I'm coming for you",
            "Title": "How to Herd Dangerous...",
            "VideoId": "VkoNXALEaMg",
            "Controls": "start=80"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/holly-branson.webp",
            "Text": "Businesses should encourage all their staff to come up with ideas, not be afraid to make suggestions, and then to act on those suggestions. There is nothing worse than going to a job every day were you feel like you are not making a difference to either the place you work or the world you live in.",
            "Title": "",
            "Name": "Holly Branson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/vijay-sethupathi.webp",
            "Text": "I surrender to my directors. I do that because I respect them immensely. In fact, a director's talent scares me. I admit that they're more intelligent than me, and I submit to that, as an assistant director does. Even when I have suggestions to make, I don't state them strongly.",
            "Title": "Indian Actor",
            "Name": "Vijay Sethupathi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/peter-hitchens.webp",
            "Text": "What many of us object to is the politicians who, for whatever reason, forget that societies cannot easily absorb huge numbers of new citizens. I resent the suggestion that this perfectly reasonable view is motivated by racial hatred or personal spite.",
            "Title": "English Journalist",
            "Name": "Peter Hitchens"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/steve-buscemi.webp",
            "Text": "I think it's important to create an atmosphere where actors feel like they can try things out. It doesn't mean that I'll take every suggestion, but I want there to be some room for actors to grow.",
            "Title": "American Actor",
            "Name": "Steve Buscemi"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/travis-bradberry.webp",
            "Text": "When you take on more than the norm, your boss can't help but think that you're capable of a bigger role. This includes showing that you're willing to take risks by making innovative suggestions.",
            "Title": "American Author",
            "Name": "Travis Bradberry"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerry-b-jenkins.webp",
            "Text": "The theater of the mind is impossible to compete with, and I like the idea that with a few suggestions, each reader forms in his or her own mind what a character or a place looks like.",
            "Title": "American Novelist",
            "Name": "Jerry B. Jenkins"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/harvey-mackay.webp",
            "Text": "The employees who share innovative ideas may also be the folks who have some hidden talents that would help incorporate their suggestions.",
            "Title": "American Businessman",
            "Name": "Harvey Mackay"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-dunn.webp",
            "Text": "I'm not from that world where you get on your feet and somebody gives you a suggestion and you improv your way through things.",
            "Title": "American Actor",
            "Name": "Kevin Dunn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/siri-hustvedt.webp",
            "Text": "None of us is immune to suggestion. We are social beings and live in a social world.",
            "Title": "American Novelist",
            "Name": "Siri Hustvedt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/aquaria.webp",
            "Text": "I'm someone who doesn't often ask for help, just suggestions.",
            "Title": "American",
            "Name": "Aquaria"
        }
    ]
}