{
    "currentWord": {
        "wordRoot": "systematically",
        "id": 27197,
        "phonemic": "ˌsɪstəˈmætɪkli|ˌsɪstəˈmætɪkli\r",
        "bigId": "07733440-67d8-42cd-8bea-d03e9c950cd2",
        "wordForms": [
            "systematically"
        ]
    },
    "senses": [
        {
            "id": "07733440-67d8-42cd-8bea-d03e9c950cd2",
            "de": "To do something in an organized and logical way, often following a fixed plan or set of rules",
            "ty": "adverb",
            "ex": "The teacher systematically checked each student's homework.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "work systematically",
                " systematically review",
                " systematically analyze"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/07733440-67d8-42cd-8bea-d03e9c950cd2.webp",
            "Tips": [
                {
                    "title": "Fixed Plan",
                    "description": "Used when actions are done following a specific sequence or checklist.",
                    "example": "She systematically organized the conference, ensuring no detail was missed.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/N81jxqktKHte4yuoSsGrlbUcc0.webp"
                },
                {
                    "title": "Attention to Order",
                    "description": "Highlights a person's careful arrangement or doing things step by step.",
                    "example": "He systematically filed all the reports by date and importance.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/HkdX0EqDPgkty6W6R35ZmYbxzw.webp"
                },
                {
                    "title": "Consistent Progress",
                    "description": "Indicates regular actions contributing to an overall purpose or goal.",
                    "example": "She systematically studied for her exams, covering a new topic each week.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/fjTlH8xuHSCDctOKaoXgm1rs7Cw.webp"
                }
            ]
        },
        {
            "id": "d55c94c8-d6e9-44ff-957c-50748e9c51c5",
            "de": "In a way that shows a consistent and clear plan, to achieve a specific outcome",
            "do": "Academic",
            "ty": "adverb",
            "ex": "The researcher systematically gathered data for the study.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "systematically gathered",
                " systematically collected",
                " systematically sorted"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d55c94c8-d6e9-44ff-957c-50748e9c51c5.webp",
            "Tips": [
                {
                    "title": "Academic Rigour",
                    "description": "Describes thorough, comprehensive research or study processes.",
                    "example": "Articles must be systematically reviewed before publication in the journal.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Goal-Oriented",
                    "description": "Indicates a clear aim or objective behind the systematic action.",
                    "example": "The team systematically developed the app, focusing on user experience.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Data Organization",
                    "description": "Pertains to the orderly collection and arrangement of information.",
                    "example": "Data was systematically sorted to facilitate the analysis.\r",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "0f47759c-bba5-4642-bcc4-5c5aebeb0b3f",
            "de": "In a way that shows a deliberate and determined plan, often in a ruthless or cruel manner",
            "ty": "adverb",
            "ex": "The regime systematically oppressed its people.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "systematically oppressed",
                " systematically abused",
                " systematically neglected"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/0f47759c-bba5-4642-bcc4-5c5aebeb0b3f.webp",
            "Tips": [
                {
                    "title": "Deliberate Action",
                    "description": "Implies intentional, thought-out processes to achieve a specific end, sometimes negative.",
                    "example": "The policy was systematically enforced to restrict freedom of speech.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Possibly Negative",
                    "description": "Suggests that systematic actions can have harmful impacts, used in critiques.",
                    "example": "The industry has systematically contributed to environmental degradation.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Cruel Efficiency",
                    "description": "Associates systematic actions with ruthless efficiency, lacking compassion.",
                    "example": "The organization systematically terminated employees who opposed the management.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Coherent": {
            "wordRoot": "Coherent",
            "wordDefinition": "Coherent refers to an idea or argument that is logical and consistent. It means that all the different parts of the idea fit together and make sense.\n\nBoth words are applicable in different situations. For example, when writing an essay or a speech, it's important to make sure that your points are coherent so that your audience can follow your argument.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d2592dcc-dcf1-41bd-a06a-3a3eaaee396b.webp"
        },
        "Consistent": {
            "wordRoot": "Consistent",
            "wordDefinition": "Consistent means to always behave or perform in the same way, without changing.\n\nIt can be applicable when talking about a person's behavior, work ethic, or performance. For example, a consistent performer in sports is someone who always performs well in every game.\n\nConsistent is often used to describe a behavior or performance that does not change, while systematically describes a planned and organized method of doing something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8c06a5c1-8c28-49ba-9aef-e08ae03ea3a7.webp"
        },
        "Logical": {
            "wordRoot": "Logical",
            "wordDefinition": "Logical means following a sensible and reasonable thought process, where the reasoning is based on facts, evidence and common sense.\n\nSuppose you have a math problem to solve; You use logical thinking to figure out the steps to solve the problem.\n\nHowever, when you execute the steps one after the other methodically, you are being systematic. Logical thinking relates to deciding how to get to the answer, while systematic relates to following a process to execute the steps.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/aef16aaf-7007-48c7-b707-07519306908e.webp"
        },
        "Methodical": {
            "wordRoot": "Methodical",
            "wordDefinition": "Methodical describes a person who follows a set of methods or procedures in an orderly and precise way, while the word systematically describes a process that follows a set of well-organized steps in a logical way.\n\nFor example, a methodical person would approach a task with a clear plan and a structured approach, carefully considering each step along the way.\n\nMethodical refers to the approach or behavior of an individual, while systematically refers to the design or structure of a process or system.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f9503762-1340-4c42-b3ac-9145e26a880b.webp"
        },
        "Order": {
            "wordRoot": "Order",
            "wordDefinition": "Order means arranging things in a particular sequence or pattern. It's applicable when referring to the way things should be arranged or organized to make sense.\n\nFor example, if you want to organize your closet, you'd use the word order. You'd arrange your clothes by type, color, or season.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fc50fd79-d055-4244-a872-8cdade011ffc.webp"
        },
        "Rational": {
            "wordRoot": "Rational",
            "wordDefinition": "Rational refers to something that is based on logical reasoning and sound judgment. It is applicable in situations where one needs to make decisions or solve problems using reason rather than emotions or impulses.\n\nRational is about using reason and logic to make decisions, while systematically is about approaching a task in an orderly and methodical way.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b5c7802d-8cf5-41ac-bfe8-94e1e731857c.webp"
        },
        "Regular": {
            "wordRoot": "Regular",
            "wordDefinition": "Regular means that something is happening at a fixed time or interval. It implies that there is some consistency in the occurrence of the said thing.\n\nFor example, if you go to the gym regularly, it means that you go there on specific days or times every week.\n\nRegular refers to the frequency of an event, while systematically refers to the method or process of doing something.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ec5b5991-1fd9-4b30-b9f8-04e4455e947d.webp"
        }
    },
    "videos": [
        {
            "Text": " these conversations and realize that survivors are not just data points on a graph they're not just their medical samples and medical records these are people we can have conversation with to help us to help them they are the people behind me they are unique individuals which form a global community and modern medicine needs to systematically change",
            "Title": "What can cancer...",
            "VideoId": "XJVKF6tTHvI",
            "Controls": "start=200"
        },
        {
            "Text": " This dilemma is an example of a broader class of problems where a life-saving resource— such as a donated organ or vaccine— is scarce. There are many schools of thought on how to approach these problems, and one of the most influential is utilitarianism, an ethical view first systematically developed",
            "Title": "You can only save one—...",
            "VideoId": "A1x7FqXRy9c",
            "Controls": "start=57"
        },
        {
            "Text": " if you approach it systematically. Imagine you brought just three nodules. Would that be enough? No - for example, you might have two blue and one red connection, and be stuck in the past forever. Would four nodules be enough? No - there are many arrangements here",
            "Title": "Can you solve the time...",
            "VideoId": "ukUPojrPFPA",
            "Controls": "start=106"
        },
        {
            "Text": " Because there was no mechanism in this explanation for making this structure hard to bend. And no one had systematically looked at the wall tissue. So I thought, wall tissue's important in skeletons. It has to be part of the explanation. And this was the point",
            "Title": "What we didn't know...",
            "VideoId": "u7SWcQaoaRQ",
            "Controls": "start=352"
        },
        {
            "Text": " that connect us as communities. Literally, like integrated neighborhoods and schools. That by the way is the reason to support integration. Not just because it's the right thing to do, but because integration systematically combats hate.",
            "Title": "What we can do about the...",
            "VideoId": "BzeTjn0R2VY",
            "Controls": "start=796"
        },
        {
            "Text": " But he found that systematically, no matter what, there's a significant number of people who do behave altruistically, no matter what. If you see someone deeply wounded, great suffering, you might just help out of empathic distress --",
            "Title": "Matthieu Ricard: How to...",
            "VideoId": "_p_GKCr8rq8",
            "Controls": "start=497"
        },
        {
            "Text": " The technique of war has been developed over thousands of years with massive resources and some of our best minds dedicated to understanding and improving how it works. Meanwhile, nonviolent struggle is rarely systematically studied,",
            "Title": "The secret to effective...",
            "VideoId": "OIpgrZ8yS-Q",
            "Controls": "start=363"
        },
        {
            "Text": " the crux of the matter. What we've done is we've created economies. We've created systems, which systematically privilege, encourage, one narrow quadrant of the human soul and left the others unregarded.",
            "Title": "Tim Jackson: An economic...",
            "VideoId": "NZsp_EdO2Xk",
            "Controls": "start=701"
        },
        {
            "Text": " have dispersed itself naturally in a biodiverse environment instead made its way to humans likely from bats animals whose habitats have been systematically raided and destroyed for decades",
            "Title": "The Nature of Nature PIPE...",
            "VideoId": "Exjndysi_TI",
            "Controls": "start=375"
        },
        {
            "Text": " Now the interests of the new males and those of the lionesses differ. Without their fathers to protect them, the cubs are in peril. They're systematically hunted down and dispatched.",
            "Title": "Brutal Lion Infanticide...",
            "VideoId": "KUGf-irpTMQ",
            "Controls": "start=82"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/leila-janah.webp",
            "Text": "Through my studies, I became increasingly disillusioned with the international aid system. I think we systematically deny poor people the chance to engage as equals in the global economic order. At best, we give them handouts or tiny loans and hope they will suffer a bit less from extreme poverty. We don't view them as equals.",
            "Title": "American Businesswoman",
            "Name": "Leila Janah"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-l-trump.webp",
            "Text": "Donald learned from a very young age that in order to survive in my family, he needed to be what my grandfather referred to as a killer, you know, somebody who had no weaknesses - in other words, kindness, generosity, sensitivity. So I think, over time, those qualities were systematically drilled out of Donald by his dad.",
            "Title": "American Psychologist",
            "Name": "Mary L. Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-kennedy.webp",
            "Text": "When human rights are systematically abused, it raises the question whether it may be legitimate in some circumstances for the international community to intervene within individual states as well as in conflicts between states.",
            "Title": "British Politician",
            "Name": "Charles Kennedy"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/andrew-ng.webp",
            "Text": "I want an AI-powered society because I see so many ways that AI can make human life better. We can make so many decisions more systematically or automate away repetitive tasks and save so much human time.",
            "Title": "Chinese Scientist",
            "Name": "Andrew Ng"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mary-wollstonecraft.webp",
            "Text": "Women are systematically degraded by receiving the trivial attentions which men think it manly to pay to the sex, when, in fact, men are insultingly supporting their own superiority.",
            "Title": "British Writer",
            "Name": "Mary Wollstonecraft"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jerry-costello.webp",
            "Text": "Mr. Speaker, genocide is the most potent of all crimes against humanity because it is an effort to systematically wipe out a people and a culture as well as individual lives.",
            "Title": "American Politician",
            "Name": "Jerry Costello"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jose-angel-gurria.webp",
            "Text": "In a world that places a growing premium on social skills, education systems need to do much better at fostering those skills systematically across the school curriculum.",
            "Title": "Mexican Economist",
            "Name": "Jose Angel Gurria"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/marcus-aurelius.webp",
            "Text": "Nothing has such power to broaden the mind as the ability to investigate systematically and truly all that comes under thy observation in life.",
            "Title": "Roman Leader",
            "Name": "Marcus Aurelius"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/thomas-a-edison.webp",
            "Text": "It is astonishing what an effort it seems to be for many people to put their brains definitely and systematically to work.",
            "Title": "American Inventor",
            "Name": "Thomas A. Edison"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-michel.webp",
            "Text": "At the European table, we are systematically the most determined to advance a strategy of increased cooperation.",
            "Title": "Belgian Politician",
            "Name": "Charles Michel"
        }
    ]
}