{
    "currentWord": {
        "wordRoot": "thrill",
        "id": 3864,
        "phonemic": "θrɪl|θrɪl\r",
        "bigId": "60dc3cef-73c1-44e1-8c4f-3bde6cb47c3b",
        "wordForms": [
            "thrills",
            "thrilling",
            "thrilled",
            "thrill"
        ]
    },
    "senses": [
        {
            "id": "60dc3cef-73c1-44e1-8c4f-3bde6cb47c3b",
            "de": "A strong feeling of excitement or happiness",
            "ty": "noun",
            "ex": "She got a thrill from skydiving",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "get a thrill",
                " sense of thrill",
                " thrill ride"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/60dc3cef-73c1-44e1-8c4f-3bde6cb47c3b.webp",
            "Tips": [
                {
                    "title": "Positive Emotion",
                    "description": "Used to describe experiences or activities that give a very happy feeling.",
                    "example": "Seeing her childhood photos brought a thrill to her heart.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/zD92b3wIchmP1YIFCBfJJBzKNc.webp"
                },
                {
                    "title": "Achievement Elation",
                    "description": "Often used when someone achieves something and feels a burst of happiness.",
                    "example": "Winning the race gave him an unmatched thrill.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tIth4TDrI52QMMqndwD4jztlNK8.webp"
                },
                {
                    "title": "Hobbies and Interests",
                    "description": "Refers to personal interests that make one feel especially excited or alive.",
                    "example": "He finds a thrill in collecting rare stamps.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/NY1oJETUGtcWQBk8vVbx5v498Q.webp"
                }
            ]
        },
        {
            "id": "69e47093-5522-4bd4-8ae9-1c31271e9308",
            "de": "To cause to experience excitement or happiness",
            "ty": "verb",
            "ex": "His stories about his travels thrilled us",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "thrill to",
                " thrill at",
                " thrill by"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/69e47093-5522-4bd4-8ae9-1c31271e9308.webp",
            "Tips": [
                {
                    "title": "Sharing Excitement",
                    "description": "When someone's actions or words make others feel excited.",
                    "example": "Her passionate speech thrilled the audience.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Response to Art",
                    "description": "People may use it to express how they are moved by music, movies, or performance.",
                    "example": "The orchestra's performance thrilled me to the core.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "e60da84e-ddba-450e-9174-1fc35e103799",
            "de": "A sudden feeling of fear or excitement",
            "ty": "noun",
            "ex": "He felt a thrill of fear as the door slowly opened",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "thrill of fear",
                " thrill of anticipation",
                " thrill of horror"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/e60da84e-ddba-450e-9174-1fc35e103799.webp",
            "Tips": [
                {
                    "title": "Intense Anticipation",
                    "description": "Refers to the mix of fear and excitement one feels before a significant event.",
                    "example": "She felt a thrill before the curtain rose on her first play.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Negative Surprise",
                    "description": "Can indicate a sudden, often negative, surprise that causes a strong reaction.",
                    "example": "A thrill went down his spine when he heard the strange noise.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "44e594cf-37d4-42c4-8540-b31339e1478a",
            "de": "In medical term, it's a vibration felt on the chest wall",
            "do": "Medical",
            "ty": "noun",
            "ex": "The doctor detected a thrill in the patient's chest",
            "use": "",
            "co": "Technical",
            "re": "",
            "tp": "",
            "cl": [
                "cardiac thrill",
                " palpable thrill",
                " vascular thrill"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/44e594cf-37d4-42c4-8540-b31339e1478a.webp",
            "Tips": [
                {
                    "title": "Medical Context",
                    "description": "Specifically in medicine, it's about feeling abnormal vibrations caused by turbulent blood flow.",
                    "example": "The cardiologist was concerned about the thrill she felt in the patient's pulse.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Technical Term",
                    "description": "Remember, this term is technical and not used in casual conversation unless discussing health.",
                    "example": "The medical student learned how to detect a thrill during a physical examination.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Buzz": {
            "wordRoot": "Buzz",
            "wordDefinition": "Buzz refers to a feeling of excitement that's often brief or fleeting. It's like a burst of energy or enthusiasm that you might get from a new experience or activity.\n\nFor example, if someone says they got a buzz from riding a roller coaster, it means they experienced a rush of adrenaline or a sense of positive energy during the ride.\n\nBuzz is applicable when you feel a brief or fleeting moment of excitement, while thrill is applicable when you feel a sustained feeling of enjoyment or excitement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/0aea8ab0-3328-4ab5-9c16-a0084c93acc5.webp"
        },
        "Delight": {
            "wordRoot": "Delight",
            "wordDefinition": "Delight means to experience great pleasure or satisfaction.\n\nDelight is more of a gentle, peaceful emotion.\n\nDelight is a feeling of pleasure or contentment, while thrill is a feeling of excitement or adrenaline. Delight is applicable for pleasant or enjoyable experiences, while thrill is applicable for experiences that involve a rush or surge of excitement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7d5d7740-cdb6-4a0a-a3ba-5a406daa016f.webp"
        },
        "Euphoria": {
            "wordRoot": "Euphoria",
            "wordDefinition": "Euphoria is a feeling of intense joy and happiness that may last for a longer time, while thrill is a sudden feeling of excitement and pleasure that is short-lived.\n\nEuphoria is often associated with achieving a long-term goal or reaching a significant milestone in life, whereas thrill can be felt in the moment, such as during a thrilling ride or a daring adventure.\n\nEuphoria is applicable in moments of achievement or accomplishment, while thrill is applicable in moments of excitement or adventure.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/fb6d4c15-7a95-484a-9c39-d82fdad6d269.webp"
        },
        "Excitement": {
            "wordRoot": "Excitement",
            "wordDefinition": "Excitement and thrill are both emotions that relate to feelings of enthusiasm and adventure.\n\nHowever, excitement tends to be a more general feeling of enthusiasm, while thrill is more specific and often associated with a physical experience.\n\nFor example, you might feel excitement before going on a vacation or starting a new job, but you might feel a thrill when doing something like skydiving or riding a roller coaster.\n\nExcitement can be applied to a wider range of experiences, whereas a thrill is typically reserved for more intense or exhilarating activities.\n\nExcitement is a more general feeling of enthusiasm while thrill is a specific feeling of excitement associated with a more intense or adventurous experience.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/39b628fe-185c-4c0c-8b83-14a15448049e.webp"
        },
        "Exhilarate": {
            "wordRoot": "Exhilarate",
            "wordDefinition": "Both exhilarate and thrill describe a feeling of excitement, but they are used slightly differently.\n\nExhilarate is more commonly used to describe a feeling of invigoration or stimulation caused by something that is challenging, difficult or emotional.\n\nFor example, one might say \"the thrill of rock climbing exhilarates me\" to convey the sense of excitement and challenge that the sport brings.\n\nExhilarate describes the positive feeling that comes from being challenged or emotionally moved, while thrill describes any intense feeling of excitement or pleasure.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e50b6372-922d-4534-be31-016f73eef824.webp"
        },
        "Joy": {
            "wordRoot": "Joy",
            "wordDefinition": "Joy typically refers to a feeling of happiness or contentment that is steady and long-lasting, often associated with overall life satisfaction.\n\nJoy can be experienced in everyday life, while thrill is usually linked to more heightened, unusual situations.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c883f7ab-7037-4c8d-a81a-8f7b3cc28b18.webp"
        },
        "Pleasure": {
            "wordRoot": "Pleasure",
            "wordDefinition": "Pleasure refers to a feeling of enjoyment or satisfaction, usually obtained from something that we like or enjoy doing regularly.\n\nThrill refers to a strong and intense feeling of excitement or pleasure, often accompanied by a rush of adrenaline.\n\nPleasure is a milder feeling of enjoyment that can be obtained from regular activities, while thrill is a more intense feeling of excitement that is associated with risky or adventurous activities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2750859c-486a-4dfe-a395-bfe5891baa73.webp"
        },
        "Rush": {
            "wordRoot": "Rush",
            "wordDefinition": "Rush refers to the feeling of excitement one gets from doing something quickly or urgently. It's like a sudden surge of energy or adrenaline.\n\nRush can be applied when someone is in a hurry, or rushed, to do something.\n\nRush is more about urgency and speed, while thrill is about excitement and danger.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c0beb8c3-5734-4ea0-939b-f9aa969511b5.webp"
        },
        "Stimulate": {
            "wordRoot": "Stimulate",
            "wordDefinition": "Stimulate means to encourage or arouse activity or interest in a particular thing. It is applicable when you are trying to motivate someone to do something or if you want to increase their enthusiasm for a certain topic or subject.\n\nStimulate is about motivation and interest, while thrill is about intense excitement and enjoyment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/585102f2-690b-4536-a66d-e5e4b5b00744.webp"
        },
        "Tingle": {
            "wordRoot": "Tingle",
            "wordDefinition": "Tingle refers to a feeling of slight numbness or pins and needles sensation that is often felt in the body.\n\nThrill describes a positive feeling of excitement, while tingle is a physical sensation that can have either positive or negative connotations depending on the context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/51856a76-e243-403c-8fe3-df52f7d2a800.webp"
        }
    },
    "videos": [
        {
            "Text": " of isn't it what it's all about? Isn't life about the journey, not really the destination? And here we've been on this journey, and the truth is, it's been thrilling. We haven't reached that other shore, and still, our sense of pride and commitment,",
            "Title": "Never, ever give up PIPE...",
            "VideoId": "Zx8uYIfUvh4",
            "Controls": "start=164"
        },
        {
            "Text": " And because it was a collective adventure, you need to share it, not just with your collaborators. I believe that everybody can appreciate the thrill of mathematical research, and share the passionate stories of humans and ideas behind it.",
            "Title": "What's so sexy about...",
            "VideoId": "Kc0Kthyo0hU",
            "Controls": "start=922"
        },
        {
            "Text": " with each character given their own distinctive and convincing voice. One of the most remarkable things about \"Crime and Punishment\" is its ability to thrill despite the details of the central murder being revealed in the first act.",
            "Title": "Why should you read...",
            "VideoId": "Vtkv3-endYc",
            "Controls": "start=232"
        },
        {
            "Text": " out they were just as effective scaring the daylights out of customers paying for the privilege Queenstown has enough adventure activities to easily fill a week and you can often get your thrills on a budget by booking several",
            "Title": "The Thrill Seeker's...",
            "VideoId": "F4AUjegJZNA",
            "Controls": "start=94"
        },
        {
            "Text": " have made roller coasters safer and more thrilling than ever. Our precise knowledge about the limits of the human body have helped us build coasters that are faster, taller, and loopier – and all without going off the rails.",
            "Title": "How rollercoasters...",
            "VideoId": "BunU6CTmhFw",
            "Controls": "start=266"
        },
        {
            "Text": " was this big photo of me and this glowing review underneath and I was so thrilled I couldn't wait to call home and tell everyone about it and when I got to the bottom of the article it said turn to page seven for exclusive",
            "Title": "Poetry makes people...",
            "VideoId": "WHbgZcur7ik",
            "Controls": "start=267"
        },
        {
            "Text": " But if the people I met were less bitter than I'd anticipated about being in prison, they were also less thrilled than I'd expected about the reform process going on in their country. Ma Thida said,",
            "Title": "How the worst moments in...",
            "VideoId": "RiM5a-vaNkg",
            "Controls": "start=391"
        },
        {
            "Text": " of all kinds of looks and poses and across all species of domestic and wild cats. We were thrilled to have put together ImageNet, and we wanted the whole research world to benefit from it,",
            "Title": "How we teach computers...",
            "VideoId": "40riCqvRoMs",
            "Controls": "start=549"
        },
        {
            "Text": " that's about as ambitious as any cheetah has ever been i may have been more exposed when i was on foot but it was an incredible thrill to share their world like this",
            "Title": "Best Cheetah Moments PIPE...",
            "VideoId": "nf07HnA5Jak",
            "Controls": "start=771"
        },
        {
            "Text": " people just love the thrill of sitting in the stands and cheering on their",
            "Title": "Bull in the Stands PIPE Do...",
            "VideoId": "3YvCdK0hOdM",
            "Controls": "start=0"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/freddie-hubbard.webp",
            "Text": "That was the biggest thrill, going over to these guy's houses and having them want me to practice with them and they would show me a lot of stuff, which was really advanced stuff to me at my age.",
            "Title": "American Musician",
            "Name": "Freddie Hubbard"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/cara-delevingne.webp",
            "Text": "The thrill of acting is making a character real. Modeling is the opposite of real. It's being fake in front of the camera.",
            "Title": "English Model",
            "Name": "Cara Delevingne"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/anne-robinson.webp",
            "Text": "I was thrilled when a designer shop assistant said I was a size smaller than Madonna!",
            "Title": "British Celebrity",
            "Name": "Anne Robinson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/phil-knight.webp",
            "Text": "Meeting sports athletes that are the best in the world is a thrill to this day.",
            "Title": "American Businessman",
            "Name": "Phil Knight"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gabrielle-union.webp",
            "Text": "If my real life was half as exciting as what is reported, I would be thrilled.",
            "Title": "American Actress",
            "Name": "Gabrielle Union"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/daniel-rigby.webp",
            "Text": "It's a total thrill to be helping to bring the Teletubbies back to life.",
            "Title": "English Actor",
            "Name": "Daniel Rigby"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/wayne-gretzky.webp",
            "Text": "It's an honour and a thrill and a privilege just to play in the NHL.",
            "Title": "Canadian Hockey Player",
            "Name": "Wayne Gretzky"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/mohit-raina.webp",
            "Text": "I search for thrill in my characters because I am a boring person.",
            "Title": "Indian Actor",
            "Name": "Mohit Raina"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bindi-irwin.webp",
            "Text": "I'm thrilled to be partnered up with SeaWorld.",
            "Title": "Australian Actress",
            "Name": "Bindi Irwin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dave-clark.webp",
            "Text": "My big thrill in life is my Jaguar XKE.",
            "Title": "English Musician",
            "Name": "Dave Clark"
        }
    ]
}