{
    "currentWord": {
        "wordRoot": "usual",
        "id": 15630,
        "phonemic": "ˈjuːʒəl|ˈjuːʒuəl\r",
        "bigId": "c4de0cda-d32a-467d-b356-947e5392f32d",
        "wordForms": [
            "usually",
            "unusual",
            "usual"
        ]
    },
    "senses": [
        {
            "id": "c4de0cda-d32a-467d-b356-947e5392f32d",
            "de": "Happens or is done most of the time or in most situations.",
            "ty": "adjective",
            "ex": "She took her usual route to work.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "as usual",
                " the usual",
                " usual way"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c4de0cda-d32a-467d-b356-947e5392f32d.webp",
            "Tips": [
                {
                    "title": "Frequency Context",
                    "description": "‘Usual’ indicates a high frequency, something that happens most of the time.",
                    "example": "He orders the usual pizza every Friday night.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/Ym3W653Cqju3SKYOic7wGmbPdY.webp"
                },
                {
                    "title": "Routine Activities",
                    "description": "Use 'usual' to describe activities that are part of a routine or habit.",
                    "example": "She's having her usual morning jog in the park.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tE1geYhR3LcTQeWpi5V8gpB5OQ.webp"
                },
                {
                    "title": "Predictability",
                    "description": "‘Usual’ suggests predictability in situations or behaviors.",
                    "example": "The meeting followed its usual pattern of discussions and decisions.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/1DsWeGRGmN6K6HSL7agkFGesKrk.webp"
                }
            ]
        },
        {
            "id": "d6c0428f-e734-48d1-9f79-17b086953a5e",
            "de": "Ordinary and what you would expect.",
            "ty": "adjective",
            "ex": "For me a usual day starts with a cup of coffee.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "usual day",
                " usual time",
                " usual stuff"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d6c0428f-e734-48d1-9f79-17b086953a5e.webp",
            "Tips": [
                {
                    "title": "Expectation Norm",
                    "description": "‘Usual’ describes what's expected based on past experiences or norms.",
                    "example": "It was a usual weekday, filled with loads of work.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Ordinariness Highlight",
                    "description": "Emphasizes the ordinariness or lack of uniqueness in a situation.",
                    "example": "The café offered the usual array of pastries and coffee.\r",
                    "imageUrl": ""
                },
                {
                    "title": "No Surprise",
                    "description": "Use 'usual' when there's no element of surprise or there's comfort in familiarity.",
                    "example": "He greeted me with his usual broad smile.\r",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Common": {
            "wordRoot": "Common",
            "wordDefinition": "Common means frequently occurring or found in many different situations. For example, it's common for people to use smartphones these days.\n\nCommon refers to things that are widespread or generally happening all the time, while usual describes things that are typical or expected in a specific context or for a particular person.\n\nCommon describes things that happen often or are widely seen, while usual describes things that are normal or expected in a certain situation or for a specific person.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/af247a1c-4ca1-4fff-983e-d20bda0907d4.webp"
        },
        "Customary": {
            "wordRoot": "Customary",
            "wordDefinition": "Customary means something that is done according to a particular custom or tradition. It refers to an established practice or behavior that is followed because it has been done that way for a long time.\n\nFor example, in some cultures, it is customary to bow your head to show respect.\n\nCustomary refers to something that is done because of tradition or cultural practice, while usual refers to something that is commonly or frequently done in a situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4d754a39-129a-4f5a-8a75-6a5ef71bc864.webp"
        },
        "Familiar": {
            "wordRoot": "Familiar",
            "wordDefinition": "Familiar means something that is well-known or easily recognized, while usual means something that is common or expected in a particular situation.\n\nThese activities are familiar to the person because they perform them regularly.\n\nA familiar song is one that a person knows well and can sing along to easily, while a usual meal may be one that is commonly eaten in a particular culture or region.\n\nFamiliar refers to something that is known or recognized, while usual refers to something that is typical or expected in a particular context.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/faade12c-a6dd-4346-b45c-a9a3445795dd.webp"
        },
        "Habitual": {
            "wordRoot": "Habitual",
            "wordDefinition": "Habitual refers to something that is done repeatedly or regularly, often out of habit or routine. For example, if someone always brushes their teeth before going to bed, brushing their teeth before bed is a habitual behavior for them.\n\nHabitual means something that is done regularly or repeatedly out of habit, while usual refers to something that is customary or typical.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/eb48d5e3-baff-4aed-aebc-ac01a1d9e9f1.webp"
        },
        "Normal": {
            "wordRoot": "Normal",
            "wordDefinition": "The words normal and usual are similar in meaning but have slightly different connotations.\n\nNormal means conforming to a standard or typical pattern. It implies that something is within the range of what is considered ordinary or expected.\n\nFor example, it is normal for humans to have two arms and two legs.\n\nNormal refers to a more objective standard or definition of what is expected or acceptable, while usual refers to a more subjective and personal experience or expectation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e5a9718d-381c-4e10-ad20-f7439076df89.webp"
        },
        "Ordinary": {
            "wordRoot": "Ordinary",
            "wordDefinition": "Ordinary implies something that is average or common and can be used to refer to things that do not stand out or have any special features.\n\nFor example, \"I had an ordinary day at school\" means that the day wasn't eventful or exceptional in any way.\n\nThe difference between the two words is that ordinary refers to something that is average without any special features, while usual refers to something that happens or appears repeatedly.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6613882e-4ec1-4fae-91ea-a6bc9fef452e.webp"
        },
        "Regular": {
            "wordRoot": "Regular",
            "wordDefinition": "Regular means something that happens or occurs according to a set pattern or schedule, such as a regular exercise routine or a regular meeting.\n\nRegular refers to something that happens frequently or routinely, while the word usual refers to something that is commonplace or expected in a particular situation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/ec5b5991-1fd9-4b30-b9f8-04e4455e947d.webp"
        },
        "Standard": {
            "wordRoot": "Standard",
            "wordDefinition": "Standard implies a commonly accepted level or quality that is used as a benchmark or reference point. For example, a standard size for a sheet of paper is 8.5 x 11 inches.\n\nStandard usually refers to a specific requirement or expectation set by an authority, while usual refers to something that is common or habitual.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b586dd57-f4f9-48f6-a898-11ad2218a97a.webp"
        },
        "Typical": {
            "wordRoot": "Typical",
            "wordDefinition": "Typical and usual are similar words that mean similar things, but there is a slight difference between them.\n\nTypical means something that is characteristic or representative of a particular group or situation. For example, if you say \"It's typical for teenagers to spend a lot of time on their phones,\" you are saying that it is a common trait of teenagers to do so.\n\nUsual means something that is normal or expected. It refers to something that happens regularly or frequently. For example, if you say \"It's usual for me to have cereal for breakfast,\" you are saying that you typically eat cereal for breakfast.\n\nTypical describes something that is common or representative of a group, while usual describes something that is normal or expected.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/49c0ea1b-4a8c-48a5-9918-a66102ff5436.webp"
        }
    },
    "videos": [
        {
            "Text": " orangutans have adapted to a life high in the rain forest canopies. Many of the skills they learn are transmitted through the special bond they have with their mothers, the most extended in the animal kingdom next to humans. Orangutan mothers usually give birth to one baby at a time, waiting up to eight years before having another.",
            "Title": "How smart are...",
            "VideoId": "gFzqqaBA9wQ",
            "Controls": "start=53"
        },
        {
            "Text": " It's really important, because, ultimately, from day one, we've been building a bond with them. And the fact that they just get used to hearing my voice and the sensation of being touched and picked up and stuff is really good. His eyes are still completely closed. This is day eight -Yeah, it's usually between six and 12. -Yeah.",
            "Title": "Handraising Twin Tiger...",
            "VideoId": "fcRRJHVtGPw",
            "Controls": "start=34"
        },
        {
            "Text": " Rinsing with vinegar will usually render undischarged nematocysts inactive. Seawater can also help remove residual nematocysts. But don't use fresh water because any change in salt balance alters the osmotic pressure outside of the cnidocyte and will trigger the nematocyst to fire.",
            "Title": "How does a jellyfish...",
            "VideoId": "Pu_ijC8HFRU",
            "Controls": "start=111"
        },
        {
            "Text": " which tend to be time consuming and interfere with work, school or social life to the point of causing significant distress. This set of diagnostic criteria is what separates people suffering from OCD from those who may just be a bit more meticulous or hygiene obsessed than usual.",
            "Title": "Debunking the myths of...",
            "VideoId": "DhlRgwdDc-E",
            "Controls": "start=80"
        },
        {
            "Text": " But most kidney stones don't become this serious, or even require invasive treatment. Masses less than five millimeters in diameter will usually pass out of the body on their own. A doctor will often simply recommend drinking large amounts of water to help speed the process along,",
            "Title": "What causes kidney...",
            "VideoId": "W0GpIMNTPYg",
            "Controls": "start=139"
        },
        {
            "Text": " when it's done this explanation for trees are real hit with middle school boys I can tell you that and yes it is certainly silly and perhaps even a little bit vulgar and although I usually mean it in mild jest it's also pretty helpful for me whenever I travel to",
            "Title": "Poetry makes people...",
            "VideoId": "WHbgZcur7ik",
            "Controls": "start=58"
        },
        {
            "Text": " the ratio between the sexes among newborns is usually equal true to form two of these cubs are male and to a female it will be rare indeed for all four of them to reach maturity many dangers lie ahead",
            "Title": "5 Amazing Animal...",
            "VideoId": "uIKJgxbhAzM",
            "Controls": "start=536"
        },
        {
            "Text": " But the point is, in that kind of occasion, usually children try to hide somewhere. But here, just they leave and come back. It's a natural process. And secondly, we consider noise very important.",
            "Title": "The best kindergarten...",
            "VideoId": "J5jwEyDaR-0",
            "Controls": "start=226"
        },
        {
            "Text": " they needed her as an engineer when they had briefings i asked permission to go and they said well the girls don't usually go and i said well is there a law i began attending the briefings",
            "Title": "NASA Trailblazer:...",
            "VideoId": "E4j_LpKzcZQ",
            "Controls": "start=155"
        },
        {
            "Text": " So important is their dam to them, that if they detect the slightest leak, usually by hearing the sound of trickling water,",
            "Title": "Beaver Lodge Construction...",
            "VideoId": "iyNA62FrKCE",
            "Controls": "start=111"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/orson-welles.webp",
            "Text": "I'm never certain of a performance - my own or the other actors' - or the script or anything... But to me it seems there's only one place in the world the camera can be, and the decision usually comes immediately.",
            "Title": "American Actor",
            "Name": "Orson Welles"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/oliver-wendell-holmes-sr.webp",
            "Text": "Fame usually comes to those who are thinking about something else - very rarely to those who say to themselves, 'Go to, now, let us be a celebrated individual!'.",
            "Title": "American Writer",
            "Name": "Oliver Wendell Holmes, Sr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sylvester-stallone.webp",
            "Text": "Usually whenever you're scared of something, do it. If you're not afraid of it, don't do it.",
            "Title": "American Actor",
            "Name": "Sylvester Stallone"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/margaret-thatcher.webp",
            "Text": "Of course it's the same old story. Truth usually is the same old story.",
            "Title": "English Leader",
            "Name": "Margaret Thatcher"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/petra-nemcova.webp",
            "Text": "It's usually when the cameras leave that the support leaves as well.",
            "Title": "Czechoslovakian Model",
            "Name": "Petra Nemcova"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/timothy-spall.webp",
            "Text": "These people I play are not usually wish-fulfillment characters.",
            "Title": "English Actor",
            "Name": "Timothy Spall"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rachel-cohn.webp",
            "Text": "Usually my characters, though young, tend to be street-wise.",
            "Title": "American Author",
            "Name": "Rachel Cohn"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/khris-middleton.webp",
            "Text": "Teams usually take on the personality of the coach.",
            "Title": "American Athlete",
            "Name": "Khris Middleton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/erno-rubik.webp",
            "Text": "Usually we are saying only part of the truth.",
            "Title": "Hungarian Inventor",
            "Name": "Erno Rubik"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/francois-de-la-rochefoucauld.webp",
            "Text": "Usually we praise only to be praised.",
            "Title": "French Writer",
            "Name": "Francois de La Rochefoucauld"
        }
    ]
}