{
    "currentWord": {
        "wordRoot": "verbal",
        "id": 15275,
        "phonemic": "ˈvɜːbl|ˈvɜːrbl\r",
        "bigId": "5f98d4d6-3fb7-475f-bcae-afec6e63f081",
        "wordForms": [
            "verbally",
            "verbalizing",
            "verbal"
        ]
    },
    "senses": [
        {
            "id": "5f98d4d6-3fb7-475f-bcae-afec6e63f081",
            "de": "Related to words or spoken language",
            "ty": "adjective",
            "ex": "The child has excellent verbal skills for his age.",
            "use": "",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/5f98d4d6-3fb7-475f-bcae-afec6e63f081.webp",
            "Tips": [
                {
                    "title": "Spoken Context",
                    "description": "Use 'verbal' when emphasizing spoken skills over writing or nonverbal communication.",
                    "example": "Her verbal articulation during the presentation was impressive.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/ZhE6zk2RAln578qFtUhRrt5lic.webp"
                },
                {
                    "title": "Language Fluency",
                    "description": "Mention 'verbal' to stress the fluency or expressive nature of someone's language ability.",
                    "example": "His verbal fluency in Spanish surpasses his written skills.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/HJRgI9yNHRxsoX1JkjGFNBIxrE.webp"
                },
                {
                    "title": "Non-textual communication",
                    "description": "'Verbal' suggests that communication is oral, in contrast with text-based or sign language.",
                    "example": "She prefers verbal instructions over emails.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/wJTzIsZ40dvaJZYCr0C0R0suYSY.webp"
                }
            ],
            "op": ""
        },
        {
            "id": "d8b7b94a-fe5a-4076-923a-51bbc1a5d08a",
            "de": "Expressed in words, not action",
            "ty": "adjective",
            "ex": "She made a verbal commitment, promising to help.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/d8b7b94a-fe5a-4076-923a-51bbc1a5d08a.webp",
            "Tips": [
                {
                    "title": "Not Binding",
                    "description": "'Verbal' agreements often imply they are less formal and not legally binding like written contracts.",
                    "example": "We have a verbal understanding, but nothing's on paper yet.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Commitment Level",
                    "description": "'Verbal' can indicate a preliminary commitment, before any formal actions are taken.",
                    "example": "He gave a verbal agreement to join the meeting.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "a1079b3a-90b9-488d-ba73-946611e614f6",
            "de": "Used to describe a noun in grammar",
            "do": "Grammar",
            "ty": "adjective",
            "ex": "In the sentence 'fishing is fun', 'fishing' is a verbal noun.",
            "use": "",
            "co": "Academic",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a1079b3a-90b9-488d-ba73-946611e614f6.webp",
            "Tips": [
                {
                    "title": "Behavior Description",
                    "description": "Use 'verbal' to describe certain behaviors or actions when expressed through language.",
                    "example": "Verbal bullying can be as harmful as physical intimidation.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Emotional Expression",
                    "description": "'Verbal' can highlight emotional expression particularly when conveyed through words.",
                    "example": "He often struggles with verbal expression of his feelings.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Grammar Usage",
                    "description": "'Verbal' in grammar indicates a word formed from a verb that functions like a noun.",
                    "example": "'Running' in 'Running is healthy' is a verbal noun because it names an activity.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Articulate": {
            "wordRoot": "Articulate",
            "wordDefinition": "Articulate means to be able to express oneself clearly and effectively, with good grammar and vocabulary. It refers to one's ability to speak or write well.\n\nFor example, someone who is articulate can explain complex ideas in a way that is easy to understand, while someone who is verbal simply uses words to convey their thoughts, even if they are not expressed clearly or effectively.\n\nArticulate is often used to describe someone who is an excellent communicator, while verbal is used more generally to describe someone who uses words to express themselves.\n\nOverall, while both words are related to communication and language, articulate emphasizes the quality and effectiveness of expression, while verbal refers to the act of using words to communicate.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/f6ce7fe8-b8ba-48c2-b15b-8e8a896a70f4.webp"
        },
        "Communicative": {
            "wordRoot": "Communicative",
            "wordDefinition": "Communicative refers to the ability of a person to communicate effectively with others using different means such as body language, facial expressions, and gestures apart from just speaking.\n\nCommunicative is a broader term that signifies the ability to communicate using different means, while verbal specifically pertains to spoken or written language.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7c16709c-aa59-4406-8464-1ebaa9193e75.webp"
        },
        "Linguistic": {
            "wordRoot": "Linguistic",
            "wordDefinition": "Linguistic refers to language as a system of communication, including things like grammar, syntax, and semantics.\n\nFor example, if a linguist is studying the grammar of a language, they would be focusing on the linguistic aspects of the language, whereas if someone is giving a speech or writing an essay, they would be using verbal language to express their ideas.\n\nLinguistic refers to the technical aspects of language and how it works, while verbal refers to the actual use of language to communicate ideas.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/88b6a819-afd2-433c-901e-b58150dfdd17.webp"
        },
        "Oral": {
            "wordRoot": "Oral",
            "wordDefinition": "Oral refers to spoken communication, while the word verbal includes both spoken and written communication. Oral communication is applicable in situations where people speak to each other face-to-face or over the phone, while verbal communication is applicable in any situation where words are used, whether spoken or written, such as emails and messages.\n\nFor example, a conversation with friends is an example of oral communication, while a text message or email is an example of verbal communication.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/6e6a733d-f090-44b6-b6e9-f106e45e895c.webp"
        },
        "Phonic": {
            "wordRoot": "Phonic",
            "wordDefinition": "Phonic relates to sounds and pronunciation of words, particularly in terms of how letters and letter combinations create certain sounds.\n\nPhonic refers to the sounds of words, while verbal refers to the words themselves.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/758a405b-d7df-44d3-a424-2d224e21a55e.webp"
        },
        "Speak": {
            "wordRoot": "Speak",
            "wordDefinition": "Speak is a verb used to describe the action of communicating using words or speech. It usually refers to the act of producing sounds that correspond to particular meanings.\n\nFor example, when someone talks to you, they are speaking.\n\nVerbal refers to language that is spoken or composed of words that are spoken. It describes something that is communicated using words or speech.\n\nFor example, a verbal agreement is one that is made through spoken words rather than in writing.\n\nIn simpler terms, speak refers to the action of using words or speech to communicate, while verbal describes something that is spoken or communicated using words.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/703a6369-3397-4377-ba29-aa8d6de21d14.webp"
        },
        "Vocal": {
            "wordRoot": "Vocal",
            "wordDefinition": "Vocal refers to sound produced by the voice or relating to the human voice.\n\nIn simpler terms, verbal is about using words, while vocal is about making sounds with your voice. Verbal is usually used when talking about what someone said or wrote, while vocal is usually used when talking about singing or making noises with your voice, like in a choir or a bird chirping.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2c1b29b5-5d7c-46f5-a4ea-7286d67ed057.webp"
        }
    },
    "videos": [
        {
            "Text": " What's going on? Why do so many men abuse physically, emotionally, verbally, and other ways, the women and girls, and the men and boys, that they claim to love? What's going on with men? Why do so many adult men sexually abuse little girls and boys? Why is that a common problem in our society and all over the world today? Why do we hear over and over again",
            "Title": "Jackson Katz: Violence...",
            "VideoId": "ElJxUVJ8blw",
            "Controls": "start=318"
        },
        {
            "Text": " Do they follow through? Secondly, if, for example, you're out and you're being verbally attacked by somebody, or you're suffering from a really disabling illness, does your partner step up and do what needs to be done to leave you feeling cared for and protected?",
            "Title": "3 ways to build a happy...",
            "VideoId": "aRcD31sA2a0",
            "Controls": "start=539"
        },
        {
            "Text": " But, luckily, there are some simple practices that can help us all navigate our daily interactions for better communication. recognize that passive hearing and active listening are not the same. Engage actively with the verbal and nonverbal feedback of others,",
            "Title": "How miscommunication...",
            "VideoId": "gCfzeONu3Mo",
            "Controls": "start=189"
        },
        {
            "Text": " But she said it again. She said no. Did he listen to her words? In the age of Me Too and Time's Up, people ask me, \"How do I even know what my partner wants and likes? Is all consent to be verbal and contractual now?\" There are times when consent is ambiguous",
            "Title": "The truth about unwanted...",
            "VideoId": "L-q-tSHo9Ho",
            "Controls": "start=470"
        },
        {
            "Text": " But how can a medium that is on the surface so simple have so much influence and at times be so meaningful? Let's look at what a cartoon is. It starts with an idea. The idea can be verbal, written in words, or it can be visual. A visual idea is simply",
            "Title": "Inside a cartoonist's...",
            "VideoId": "1c3AQT_Lex4",
            "Controls": "start=60"
        },
        {
            "Text": " I don't see facial expressions or gestures. I've learned to solicit a lot more verbal feedback. I basically force people to tell me what they think. And in this respect, it's become, like I said, a real blessing for me personally and for my company,",
            "Title": "Isaac Lidsky: What...",
            "VideoId": "cmpu58yv8-g",
            "Controls": "start=663"
        },
        {
            "Text": " he probably doesn't actually mean that. He probably means that the weather is horrible, but he has said the opposite. This is verbal irony when the speaker says the opposite of what he means. I know what you're thinking. Isn't this sarcasm,",
            "Title": "What is verbal irony? -...",
            "VideoId": "IiR-bnCHIYo",
            "Controls": "start=63"
        },
        {
            "Text": " and when she does she's rewarded with a piece of fish now you may be thinking big deal it's a sea lion that can play snaps but there's far more to this than meets the eye we have no way of giving real verbal instructions so what she's",
            "Title": "Sea Lion Plays Snap!...",
            "VideoId": "Ex1nEuzAYxo",
            "Controls": "start=13"
        },
        {
            "Text": " growls barks yips and whines are equally as important as the non verbal body language of baring teeth and warning of pending aggression or the tucking of a tail in submission those are just a few examples of the broad array of",
            "Title": "Jim & Jamie Dutcher: The...",
            "VideoId": "d36MK94POaI",
            "Controls": "start=483"
        },
        {
            "Text": " could we look again with an unquestioning mind like we listen to music watching my daughter's grow up I saw that when they were pre verbal they can become entranced with the visual world",
            "Title": "Let your eyes do the...",
            "VideoId": "6NQlIeZWsTQ",
            "Controls": "start=126"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/susannah-cahalan.webp",
            "Text": "For me, I think that there's a lot missing from the recovery or the post-diagnosis side of treating patients. Once the diagnosis is made, I feel that care drops off tremendously, even though it is precisely the time that a patient needs help the most, even if they are not verbalizing it.",
            "Title": "American Journalist",
            "Name": "Susannah Cahalan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/faith-salie.webp",
            "Text": "Harassment doesn't just happen to 'social observers' and 'comedians' - women who express themselves publicly are reliably verbally attacked online and in person, not for their substance but for their form.",
            "Title": "American Journalist",
            "Name": "Faith Salie"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/gyles-brandreth.webp",
            "Text": "And the purpose of small talk is not to be controversial, clever or even interesting. It's simply to fill the silent void with a small gesture of common humanity. It's a spoken smile, a verbal handshake.",
            "Title": "British Actor",
            "Name": "Gyles Brandreth"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/audre-lorde.webp",
            "Text": "I have come to believe over and over again that what is most important to me must be spoken, made verbal and shared, even at the risk of having it bruised or misunderstood.",
            "Title": "American Poet",
            "Name": "Audre Lorde"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/patricia-heaton.webp",
            "Text": "Again, I find it difficult to be taken care of and rarely acknowledge it, and every act he does registers, but I also just need to verbally acknowledge him and hug him.",
            "Title": "American Actress",
            "Name": "Patricia Heaton"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jonathan-winters.webp",
            "Text": "I started out as an artist, and what I do is verbal paintings. I paint a picture. Hopefully, you'll see the characters and what they're doing and what they're saying.",
            "Title": "American Comedian",
            "Name": "Jonathan Winters"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/howie-mandel.webp",
            "Text": "I've been chased. I've been pushed. I've been screamed at. I've been verbally abused. I've been afraid for my safety. But I did it all in the name of entertainment.",
            "Title": "Comedian",
            "Name": "Howie Mandel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/frank-shamrock.webp",
            "Text": "I'm the first guy to jump on somebody and pick a fight with them, at least verbally, I try to do it with some class and respect.",
            "Title": "American Mixed Martial Artist",
            "Name": "Frank Shamrock"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/lena-headey.webp",
            "Text": "It's a feeling without a lid, of what you would do, physically, verbally, to protect the one thing that is your greatest love.",
            "Title": "English Actress",
            "Name": "Lena Headey"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/buzz-aldrin.webp",
            "Text": "I don't go through life verbalizing what I feel.",
            "Title": "American Astronaut",
            "Name": "Buzz Aldrin"
        }
    ]
}