{
    "currentWord": {
        "wordRoot": "vest",
        "id": 16853,
        "phonemic": "vest|vest\r",
        "bigId": "760e1579-c9b0-4545-bd2b-6d477aaf58f1",
        "wordForms": [
            "vests",
            "vested",
            "vest"
        ]
    },
    "senses": [
        {
            "id": "760e1579-c9b0-4545-bd2b-6d477aaf58f1",
            "de": "A sleeveless garment worn on the upper body, usually over a shirt.",
            "ty": "noun",
            "ex": "He wore a vest over his white shirt to the wedding.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "wear a vest",
                " buttoned-up vest",
                " vest top"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/760e1579-c9b0-4545-bd2b-6d477aaf58f1.webp",
            "Tips": [
                {
                    "title": "Formal Attire",
                    "description": "Vests are often part of formal wear, combined with suits and ties.",
                    "example": "He donned his vest for the formal gala.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xCioTAAyPeqKg9uU9WCMAqk.webp"
                },
                {
                    "title": "Layering Piece",
                    "description": "A vest acts as a middle layer between a shirt and a suit jacket.",
                    "example": "She chose a silk vest to layer her business attire.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/MvPGklnFGyVyeTxzHCKMAlwPHws.webp"
                },
                {
                    "title": "Casual Options",
                    "description": "Informal vests, like vest tops, are worn for casual occasions.",
                    "example": "On a hot day, he opted for a lightweight vest top.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/nvjHQS8UuwgrmzweyCCPuQGMb0.webp"
                }
            ]
        },
        {
            "id": "4bb7f866-1620-4b4c-b2c1-ec429bf7b3b5",
            "de": "A protective outer garment, like a bulletproof vest or life vest.",
            "ty": "noun",
            "ex": "The police officer put on a bulletproof vest for safety.",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                "bulletproof vest",
                " life vest",
                " safety vest"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4bb7f866-1620-4b4c-b2c1-ec429bf7b3b5.webp",
            "Tips": [
                {
                    "title": "Safety First",
                    "description": "Safety vests are high-visibility clothing for protection.",
                    "example": "Construction workers wear orange safety vests at the site.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Specialized Use",
                    "description": "Some vests serve specific purposes, like flotation or bullet resistance.",
                    "example": "Life vests are essential for safety on a boat.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "af488114-c6bf-4d20-bcb5-2c15b70defca",
            "de": "To give someone power or legal authority, especially in a formal way。",
            "do": "Legal",
            "ty": "verb",
            "ex": "The powers are vested in the board of directors.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "vest power in",
                " vest authority in",
                " vest rights in"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/af488114-c6bf-4d20-bcb5-2c15b70defca.webp",
            "Tips": [
                {
                    "title": "Legal Authority",
                    "description": "In law, 'vest' can mean to legally grant power or rights.",
                    "example": "Responsibility vested in her at the company's inception.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Process Over Time",
                    "description": "Some rights or powers vest over time according to specific conditions or laws.",
                    "example": "The shares will vest over a five-year period.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "b9142f1c-b139-4255-8820-2f5914098bb3",
            "de": "To give someone the legal right to own a property or asset",
            "do": "Legal",
            "ty": "verb",
            "ex": "The property will vest in the children when they turn 18.",
            "use": "",
            "co": "Technical",
            "sy": "",
            "op": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "vest property in",
                " vest assets in"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b9142f1c-b139-4255-8820-2f5914098bb3.webp",
            "Tips": [
                {
                    "title": "Ownership Transfer",
                    "description": "To vest property means to transfer ownership, often triggered by an event.",
                    "example": "The land vested in him after his father's passing.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Bodice": {
            "wordRoot": "Bodice",
            "wordDefinition": "A bodice and a vest are both pieces of clothing worn on the upper body, but they are different in their design and purpose.\n\nA bodice is a fitted garment that usually extends from the shoulders to the waist or hips, hugging the torso and accentuating the curves of the body.\n\nThe bodice provides support and structure to the bust and waistline, making the wearer look more elegant and feminine.\n\nA bodice is a form-fitting and often glamorous top for women, while a vest is a sleeveless and versatile layer for men and women.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/01c06895-3943-4b05-96ba-91f5319d7136.webp"
        },
        "Camisole": {
            "wordRoot": "Camisole",
            "wordDefinition": "A camisole and a vest are both types of sleeveless garments worn as an underlayer but they have some differences in their design and purpose.\n\nA camisole is a form-fitting, lightweight top that usually has spaghetti straps or thin shoulder straps. It is meant to be worn as an undergarment, usually under a shirt or a blouse, to provide coverage and add an extra layer for warmth.\n\nCamisoles can also be worn alone as a tank top or a lounge-wear.\n\nA vest is a sleeveless garment that is often made of thicker material than a camisole. It usually has a more relaxed fit and may have buttons, zippers, or pockets.\n\nA camisole is a more form-fitting and lightweight undergarment while a vest is a more substantial outerwear garment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c7a74fc3-421b-48a3-b4d4-b978e752a712.webp"
        },
        "Corset": {
            "wordRoot": "Corset",
            "wordDefinition": "A corset is a tight-fitting undergarment that is worn to cinch in the waist and give the wearer an hourglass figure.\n\nIt is typically made of strong material and has boning to keep its shape. Corsets are usually associated with historical clothing or lingerie.\n\nA corset is a tight-fitting undergarment used to shape the figure, while a vest is a sleeveless garment worn over a shirt or blouse.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b2d014b2-075e-4294-a015-5de575b1f812.webp"
        },
        "Jerkin": {
            "wordRoot": "Jerkin",
            "wordDefinition": "A jerkin is a sleeveless, close-fitting jacket or vest that is traditionally made of leather or suede.\n\nJerkins are more commonly worn as a part of historical or costume dressing, as they were popular in the medieval times.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b19be3b7-0d23-4ac9-affe-8deb42542445.webp"
        },
        "Undershirt": {
            "wordRoot": "Undershirt",
            "wordDefinition": "Undershirt and vest are two different types of clothing worn underneath a shirt or a jacket.\n\nAn undershirt, also known as a t-shirt, is a thin and lightweight garment worn underneath a shirt to absorb sweat and provide a layer of comfort.\n\nAn undershirt is a thin cotton garment worn directly over the skin to absorb sweat and provide a layer of comfort.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/70b19838-f4bc-4c8a-9c46-21380513d082.webp"
        },
        "Waistcoat": {
            "wordRoot": "Waistcoat",
            "wordDefinition": "A vest and a waistcoat are both types of clothing that are worn over a shirt, but there are some differences between them.\n\nA waistcoat is a more formal piece of clothing.\n\nA waistcoat typically has two pockets on the front and is often worn as part of a three-piece suit.\n\nWhile a vest can be worn in more casual settings, a waistcoat is typically reserved for formal occasions.\n\nTo sum it up, a vest is a sleeveless garment that is worn as an undergarment or as a layering piece, while a waistcoat is a more formal garment that is part of a suit and is worn for formal occasions.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/23f2c940-4086-4935-b56c-7182a12a02d9.webp"
        }
    },
    "videos": [
        {
            "Text": " so they're using it in things like bulletproof vests and helmets and outdoor jackets. It has a great performance. But again, it's bioderived, and at the end of its life, it potentially can go back into the soil and get composted to again be potentially used as a new material. I'd like to leave you with one last form which is biobased,",
            "Title": "To eliminate waste, we...",
            "VideoId": "kZP8Kqr_bcw",
            "Controls": "start=507"
        },
        {
            "Text": " \"I do\" has acted upon them and profoundly changed their world. However, performatives depend on context and reception. These are known as felicity conditions. Imagine if the mayor showed up to the wedding and said, \"By the power vested in me as mayor of the city,",
            "Title": "Speech acts: Constative...",
            "VideoId": "LgmpbXIGpcc",
            "Controls": "start=131"
        },
        {
            "Text": " on just to help decrease. I want to see the whole thing. I'm so proud of all the work Jennifer has put in. She's even using tools like weighted vest to burn energy. She looks-- oh my! They have pink? Yeah! Oh, my lord! I love it even more! Yeah.",
            "Title": "Calming an Overly...",
            "VideoId": "Tmm6EfWAi8Q",
            "Controls": "start=149"
        },
        {
            "Text": " Are they truly experts in the matter, or do they have a vested interest? Second, we should pay particular attention to papers published in the top academic journals. Now, academics are often accused of being detached from the real world.",
            "Title": "What to trust in a...",
            "VideoId": "rpJx5VLQMxk",
            "Controls": "start=848"
        },
        {
            "Text": " the tablet and then it's getting mapped onto a vest that's covered in vibratory motors and I'm wearing the vest right now so as I'm speaking I'm feeling the sonic world around me we've been testing this with deaf people now and it turns",
            "Title": "The Year in Ideas: TED...",
            "VideoId": "yWRmWnPNkqU",
            "Controls": "start=127"
        },
        {
            "Text": " much your heart do you want to protect all of it all of it one way or the other but here's a good start half of the world is called the high seas and every person on the planet has a vested interest in taking care of it it belongs",
            "Title": "Taking care of the ocean...",
            "VideoId": "4l3-uT9wZ_I",
            "Controls": "start=457"
        },
        {
            "Text": " I'm feeling the sonic world around me. So, we've been testing this with deaf people now, and it turns out that after just a little bit of time, people can start feeling, they can start understanding the language of the vest.",
            "Title": "Can we create new senses...",
            "VideoId": "4c1lqFXHvqI",
            "Controls": "start=713"
        },
        {
            "Text": " and how that influenced the start of World War I, where the entire time my heart and my head were on my soldiers who were now throwing on Kevlars and grabbing their flak vests and figuring out how exactly do I change around",
            "Title": "Wes Moore: How to talk...",
            "VideoId": "5P04stEjJ9E",
            "Controls": "start=345"
        },
        {
            "Text": " This was the little girl I showed you in the picture earlier, with the life vests. Her older sister Sandra had just drowned, and her mother knew she had to do everything in her power to save her daughter.",
            "Title": "A boat carrying 500...",
            "VideoId": "B12syeJflbQ",
            "Controls": "start=582"
        },
        {
            "Text": " As a society, we have a vested interest in encouraging multipotentialites to be themselves. We have a lot of complex, multidimensional problems in the world right now,",
            "Title": "Why some of us don't...",
            "VideoId": "4sZdcB6bjI8",
            "Controls": "start=623"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dave-chappelle.webp",
            "Text": "Most of the people around me have a vested interest in how much money I make. You know, so a celebrity could find themselves in a position where people could have meetings about their life without them involved. And when I say 'their life' I mean not their professional life either. They could talk about their personal life.",
            "Title": "American Comedian",
            "Name": "Dave Chappelle"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/monty-williams.webp",
            "Text": "I get vested in my guys. I want to know who their family members are, I want to know their interests, I want to know what makes them tick. I want them to also know I care about the other side of them, their personal character and growth as men, because I think we all sharpen each other that way.",
            "Title": "American Coach",
            "Name": "Monty Williams"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/rocky-carroll.webp",
            "Text": "When you love somebody, and they go through a real adversity, you don't back away from that relationship. You don't say, 'When you're better, call me.' The opposite happens. Your bond strengthens, and you become even more vested.",
            "Title": "American Actor",
            "Name": "Rocky Carroll"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jill-stein.webp",
            "Text": "I don't have a vested interest in a particular political career or a particular political office. My job is to do everything that I can to create an America and a world that we can live in and that we can survive in.",
            "Title": "American Politician",
            "Name": "Jill Stein"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-eastman.webp",
            "Text": "It has been said that the position of woman is the test of civilization, and that of our women was secure. In them was vested our standard of morals and the purity of our blood.",
            "Title": "Sioux Author",
            "Name": "Charles Eastman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/shawn-ashmore.webp",
            "Text": "I think it is important that you care about the characters, and you are not just waiting for the next action sequence but have a vested interested in what happens to them.",
            "Title": "Canadian Actor",
            "Name": "Shawn Ashmore"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kevin-mchale.webp",
            "Text": "I've always supported LGBT organizations and things like that because I felt like I had a vested interest in this, where I wanted to help out.",
            "Title": "American Actor",
            "Name": "Kevin McHale"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/blase-j-cupich.webp",
            "Text": "The state and its leaders have not only a responsibility but also a vested interest in defending the sacredness and value of every human life.",
            "Title": "American Clergyman",
            "Name": "Blase J. Cupich"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/josie-totah.webp",
            "Text": "I have never worn a sweater vest a day in my life. Nor will I ever wear a sweater vest.",
            "Title": "American Actress",
            "Name": "Josie Totah"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/patricia-arquette.webp",
            "Text": "Everyone should help women. Everyone has a vested interest.",
            "Title": "American Actress",
            "Name": "Patricia Arquette"
        }
    ]
}