{
    "currentWord": {
        "wordRoot": "wage",
        "id": 16473,
        "phonemic": "weɪdʒ|weɪdʒ\r",
        "bigId": "aab2d292-0261-448e-81ba-377782c588a5",
        "wordForms": [
            "wages",
            "waging",
            "waged",
            "wageer",
            "wage"
        ]
    },
    "senses": [
        {
            "id": "aab2d292-0261-448e-81ba-377782c588a5",
            "de": "The money earned for work done, typically paid on a weekly or monthly basis",
            "ty": "noun",
            "ex": "Because of your extra hours, your wage this month is much higher",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "minimum wage",
                " wage increase",
                " wage decrease"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/aab2d292-0261-448e-81ba-377782c588a5.webp",
            "Tips": [
                {
                    "title": "Payment Frequency",
                    "description": "Understand 'wage' often implies a regular payment schedule, like weekly or monthly.",
                    "example": "My wage is deposited into my bank account every Friday.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/86aMIl7AYF135w9QPbsksgCJwcA.webp"
                },
                {
                    "title": "Hourly Context",
                    "description": "'Wage' can imply payment based on hours worked, different from annual salary.",
                    "example": "The part-time job offers an hourly wage of $15.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/wF5g2J3SD89mSW7OfNFwJSCZslo.webp"
                },
                {
                    "title": "Related to Effort",
                    "description": "'Wage' suggests a direct link between the amount of work and payment received.",
                    "example": "Overtime work resulted in an increased wage this week.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/DjEoEvsFVlIJjgPqRqJlaTd9E.webp"
                }
            ]
        },
        {
            "id": "a0f64dc6-8f9a-431f-bbd0-e0497d62b275",
            "de": "To start and continue a fight or argument",
            "ty": "verb",
            "ex": "They waged war against the neighboring country",
            "use": "",
            "sy": "",
            "op": "",
            "re": "Disapproving",
            "tp": "",
            "cl": [
                "wage war",
                " wage a battle",
                " wage a campaign"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/a0f64dc6-8f9a-431f-bbd0-e0497d62b275.webp",
            "Tips": [
                {
                    "title": "Conflict Initiation",
                    "description": "As a verb, 'wage' involves starting or continuing a conflict or campaign.",
                    "example": "Activists waged a campaign to raise awareness.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Persistent Effort",
                    "description": "To 'wage' something like a war implies sustained effort over a period of time.",
                    "example": "The general vowed to wage a prolonged war if necessary.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "047b32e5-b617-4bf7-aeb3-e165a9973c81",
            "de": "A fixed regular amount of money paid by an employer",
            "ty": "noun",
            "ex": "He earns a good wage working in the city",
            "use": "",
            "co": "Technical",
            "sy": "",
            "re": "Formal",
            "tp": "",
            "cl": [
                "living wage",
                " wage negotiations",
                " wage slip"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/047b32e5-b617-4bf7-aeb3-e165a9973c81.webp",
            "Tips": [
                {
                    "title": "Employment Term",
                    "description": "When talking about employment terms, 'wage' often refers to the full pay structure.",
                    "example": "His wage includes his base pay plus commissions.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not Always Cash",
                    "description": "'Wage' doesn't necessarily mean cash payment; it can also mean total compensation.",
                    "example": "Her wage package comes with health insurance benefits.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "208b800f-843d-4f5b-a655-8b4b2d8c1849",
            "de": "Conducted or used for the purpose of carrying on or furthering",
            "ty": "noun",
            "ex": "A wage battle with less expense",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                "wage laborers",
                " wage earners",
                " wage disputes"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/208b800f-843d-4f5b-a655-8b4b2d8c1849.webp",
            "Tips": [
                {
                    "title": "Historical Usage",
                    "description": "'Wage' in archaic contexts often refers to something done with a purpose or intent.",
                    "example": "He set forth to wage a noble endeavor.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Bygone Labor Context",
                    "description": "In historical times, 'wage' might denote the status and rights of laborers.",
                    "example": "Wage laborers of the era fought for fair working conditions.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        }
    ],
    "comparisons": {
        "Compensation": {
            "wordRoot": "Compensation",
            "wordDefinition": "Compensation refers to the total amount of money and benefits that an employee receives from their employer in exchange for their work.\n\nBoth compensation and wage are applicable in the context of a job or employment.\n\nHowever, compensation encompasses more than just the wage, as it includes all the other benefits and perks that an employee receives.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d5034d15-f81f-4878-b380-128ec77f4f75.webp"
        },
        "Earnings": {
            "wordRoot": "Earnings",
            "wordDefinition": "Earnings refers to the money you get from your job or from other sources, like investments or selling something you have made.\n\nIf you have a job and you get paid an hourly rate, the money you make from working is your wage. If you also have some investments that earn you money, the total amount of money you make from both your job and your investments is your earnings.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/06bde760-5e4c-4226-b8bc-2327d9e8d24a.webp"
        },
        "Emolument": {
            "wordRoot": "Emolument",
            "wordDefinition": "Emolument refers to any type of payment received by a person for their work or service, and it may include financial and non-financial benefits, such as perks, bonuses, and allowances.\n\nEmolument is more commonly used in a professional or legal context.\n\nEmolument is a broader term that encompasses all types of payments for work, including wages. Wages refer specifically to the monetary compensation paid for the work done.\n\nEmoluments are more commonly used in professional or legal contexts, while wages are associated with manual labor and hourly paid jobs.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a680ab98-9d89-4026-b50a-b4f2923ac3d4.webp"
        },
        "Income": {
            "wordRoot": "Income",
            "wordDefinition": "Income is the total money earned by an individual or household from any source, including wages, salaries, investments, and other sources.\n\nIn other words, income is a broader term that includes all sources of money earned, while wages are a specific type of income that is earned by hourly employees based on their hours worked.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/46e6f131-0db5-4089-b0ea-73956af3fd38.webp"
        },
        "Pay": {
            "wordRoot": "Pay",
            "wordDefinition": "Pay refers to the money given to an employee for their work or services. Wage refers to a specific amount of money paid on an hourly basis.\n\nFor example, if you work at a restaurant and are paid a flat rate of $10 an hour, that is your wage. If you work at a store and are paid $400 every two weeks, that is your pay.\n\nPay can refer to both the hourly wage and any additional benefits or bonuses given to an employee.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/53cec10f-74d8-4783-a4ad-b55f2e98b675.webp"
        },
        "Remunerate": {
            "wordRoot": "Remunerate",
            "wordDefinition": "Remunerate means to pay someone for their work or services, often in the form of a salary, bonus, or commission.\n\nRemunerate implies a more comprehensive payment package, including benefits, whereas wages are usually just an hourly or daily pay rate.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/852280dc-33ca-46b8-8f70-fbeb0118f2b8.webp"
        },
        "Salary": {
            "wordRoot": "Salary",
            "wordDefinition": "Salary and wage refer to the money that a person earns for their work. The main difference is in how they are calculated and when they are paid.\n\nA salary is usually a fixed amount of money that is paid to an employee on a regular basis, such as monthly or annually, regardless of the number of hours worked.\n\nIn general, salaries are more commonly used for professional or management-level positions, while wages are more commonly used for jobs that require manual labor or hourly work.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d0feec99-937a-467f-ab52-de2b2df7f818.webp"
        },
        "Stipend": {
            "wordRoot": "Stipend",
            "wordDefinition": "A stipend is a fixed sum of money paid to someone, usually for a specific purpose or period of time, such as an allowance given to a research assistant or a scholarship received by a student.\n\nStipends are often paid on a regular basis and may not necessarily be related to the amount of work done by the recipient.\n\nA stipend is a fixed amount of money paid for a specific purpose, while a wage is a payment for work done. Stipends are commonly used in academic and non-profit settings, while wages are used in almost all forms of employment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/62ac4abe-9bfb-47c4-98f0-94e537b57ded.webp"
        }
    },
    "videos": [
        {
            "Text": " your years of schooling constant you should expect your wages to go up by about 8 percent as the share of adults with a college degree in your metropolitan area goes up by 10 percent now the importance of skills in explaining urban resurgence it helps make sense of a great paradox we live in an age in which it is effortless to",
            "Title": "It’s time to embrace our...",
            "VideoId": "ILDwnzQNlGc",
            "Controls": "start=466"
        },
        {
            "Text": " When you're ready, they'll go to a garage, and they'll say, if you employ this guy for a year, we'll pay half his wages. The goal was to make sure that every addict in Portugal had something to get out of bed for in the morning. And when I went and met the addicts in Portugal, what they said is, as they rediscovered purpose,",
            "Title": "Everything you think you...",
            "VideoId": "PY9DcIMGxMs",
            "Controls": "start=579"
        },
        {
            "Text": " being made by those who are who are waging that war the one thing that strikes you when you get out there is just how kind of resourceful these guys are how autonomous and how alone I mean how on their own they are yeah we have the most powerful military the world's ever created but these guys",
            "Title": "Inside the Green Berets:...",
            "VideoId": "YW017qv0aJI",
            "Controls": "start=253"
        },
        {
            "Text": " based on five categories of fair employment. Digital gig platforms come with drawbacks and may not provide a reliable living wage. But for many around the world who don’t have the luxury of choice and need to make money as soon as possible, like, say, if you just lost your job,",
            "Title": "What is a gig economy?",
            "VideoId": "OXT8xdqcAoU",
            "Controls": "start=263"
        },
        {
            "Text": " under almost all circumstances. But we also have to be very aware that there are redistributive consequences, that importantly, low-skilled immigration can lead to a reduction in wages for the most impoverished in our societies and also put pressure on house prices.",
            "Title": "Why Brexit happened --...",
            "VideoId": "dcwuBo4PvE0",
            "Controls": "start=504"
        },
        {
            "Text": " workers and government officials, and various exotic animals, indicating that Emperor Qin had more plans for the afterlife than simply waging war. All the figurines are sculpted from terracotta, or baked earth, a type of reddish brown clay.",
            "Title": "The incredible history...",
            "VideoId": "mP5p4QbvPtc",
            "Controls": "start=133"
        },
        {
            "Text": " today, they work only for big corporations and billionaires, and that is creating a little bit of a problem. We could choose to enact economic policies that raise taxes on the rich, regulate powerful corporations or raise wages for workers.",
            "Title": "The dirty secret of...",
            "VideoId": "th3KE_H27bs",
            "Controls": "start=76"
        },
        {
            "Text": " wage is twenty pounds a week in the countryside it is far less we don't understand why you tend to put the white life on top of the life of African people what you think when you say baby good weather in a doctor it looks very very very",
            "Title": "Bush Meat Orphans PIPE Ape...",
            "VideoId": "vParrMT20N0",
            "Controls": "start=56"
        },
        {
            "Text": " but can be expanded anywhere around the globe, and maybe we'll find out that the most important thing for the public is that we create living wage jobs, or make healthy products, or help, not harm, the environment.",
            "Title": "Paul Tudor Jones II: Why...",
            "VideoId": "dvJSK4viVMs",
            "Controls": "start=411"
        },
        {
            "Text": " and build armed citadels, or you may look for life-forms and species to learn from and respect. And you can use all the moneys we all have earned to wage futile wars and give guns in the hands of little children",
            "Title": "Thoughts on humanity,...",
            "VideoId": "0NV1KdWRHck",
            "Controls": "start=897"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eric-trump.webp",
            "Text": "Out of all my friends, I believe I'm the only kid whose dad made us work to cut rebars; we laid bricks in construction sites and did other real work every summer for minimum wage. Our dad said that it's important in the future that when we tell people to dig a hole, that you personally know how long it will take to dig that hole.",
            "Title": "American Businessman",
            "Name": "Eric Trump"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/barack-obama.webp",
            "Text": "Fixing a broken immigration system. Protecting our kids from gun violence. Equal pay for equal work, paid leave, raising the minimum wage. All these things still matter to hardworking families; they are still the right thing to do; and I will not let up until they get done.",
            "Title": "American President",
            "Name": "Barack Obama"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/jean-paul-sartre.webp",
            "Text": "Total war is no longer war waged by all members of one national community against all those of another. It is total... because it may well involve the whole world.",
            "Title": "French Philosopher",
            "Name": "Jean-Paul Sartre"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/martin-luther-king-jr.webp",
            "Text": "It is not enough to say we must not wage war. It is necessary to love peace and sacrifice for it.",
            "Title": "American Leader",
            "Name": "Martin Luther King, Jr."
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-c-maxwell.webp",
            "Text": "How do leaders serve their people? They may pay good wages and treat employees with respect.",
            "Title": "American Clergyman",
            "Name": "John C. Maxwell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sherrod-brown.webp",
            "Text": "The current minimum wage simply is not supporting Ohio's working families.",
            "Title": "American Politician",
            "Name": "Sherrod Brown"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/dan-donovan.webp",
            "Text": "I have never said I was against raising the minimum wage.",
            "Title": "American Politician",
            "Name": "Dan Donovan"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/paul-hoffman.webp",
            "Text": "We should wage war not to win war, but to win peace.",
            "Title": "American Celebrity",
            "Name": "Paul Hoffman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/martin-omalley.webp",
            "Text": "We have to raise the minimum wage.",
            "Title": "American Politician",
            "Name": "Martin O'Malley"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/karen-handel.webp",
            "Text": "I do not support a livable wage.",
            "Title": "American Politician",
            "Name": "Karen Handel"
        }
    ]
}