{
    "currentWord": {
        "wordRoot": "waste",
        "id": 1716,
        "phonemic": "weɪst|weɪst\r",
        "bigId": "9460e188-71df-4920-8872-30edc9c84b90",
        "wordForms": [
            "wastes",
            "wasting",
            "wasted",
            "waste"
        ]
    },
    "senses": [
        {
            "id": "9460e188-71df-4920-8872-30edc9c84b90",
            "de": "Useless or worthless material, substances, or by-products",
            "ty": "noun",
            "ex": "Industries should effectively manage their waste",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "waste management",
                "waste disposal",
                "waste bin"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9460e188-71df-4920-8872-30edc9c84b90.webp",
            "Tips": [
                {
                    "title": "Environmental concern",
                    "description": "Waste is often linked with pollution and the need for recycling.",
                    "example": "Reducing waste helps protect the environment.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/F48myevhh13mQz0HCabYELhn3M.webp"
                },
                {
                    "title": "Negative connotation",
                    "description": "Waste implies something is not being used properly or is left over without a purpose.",
                    "example": "Food waste is a serious issue.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/KuHsokKd44fLvG0QSIPq7BWYuFA.webp"
                }
            ]
        },
        {
            "id": "9a101e46-1fd8-46e9-9a90-9ac49c76b592",
            "de": "Use or expend carelessly, extravagantly, or to no purpose",
            "ty": "verb",
            "ex": "We can't afford to waste electricity",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "waste time",
                "waste money",
                "waste resources"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/9a101e46-1fd8-46e9-9a90-9ac49c76b592.webp",
            "Tips": [
                {
                    "title": "Carelessness implied",
                    "description": "Using 'waste' as a verb can suggest carelessness or lack of consideration.",
                    "example": "Don't waste water while brushing your teeth.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Opportunity loss",
                    "description": "To waste also means to lose an opportunity by not using it wisely or effectively.",
                    "example": "Wasting your talents on trivial tasks is unwise.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "4e3b5061-cb08-4a82-835d-d5f5e344d115",
            "de": "An act or instance of using or expending something carelessly, extravagantly, or to no purpose",
            "ty": "noun",
            "ex": "It's a waste of time to argue",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "waste of time",
                "waste of resources",
                "waste of money"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4e3b5061-cb08-4a82-835d-d5f5e344d115.webp",
            "Tips": [
                {
                    "title": "Expressing regret",
                    "description": "This noun form often expresses regret over lost time, money, or effort.",
                    "example": "Missing the event was a complete waste.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "982dee15-f7f9-4c10-965e-1942518f30c0",
            "de": "Uninhabited or uncultivated land",
            "ty": "noun",
            "ex": "A vast track of waste land",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "waste ground",
                "waste land",
                "waste site"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/982dee15-f7f9-4c10-965e-1942518f30c0.webp",
            "Tips": [
                {
                    "title": "Unused space",
                    "description": "Describes land that is not being used, often desolate and barren.",
                    "example": "The building was surrounded by waste land.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Not necessarily dirty",
                    "description": "Waste land does not mean polluted, just unused or barren.",
                    "example": "They planned to turn the waste into a garden.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "30e6121e-f7cd-4e6f-bcf1-715b47169cef",
            "de": "Cause to feel shocked or stunned",
            "ty": "verb",
            "ex": "The tough loss wasted the whole team",
            "use": "",
            "co": "Colloquial",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "waste effort",
                "waste energy",
                "waste potential"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/30e6121e-f7cd-4e6f-bcf1-715b47169cef.webp",
            "Tips": [
                {
                    "title": "Emotional impact",
                    "description": "This usage can imply that something deeply affects a person's morale.",
                    "example": "The constant criticism really wasted his enthusiasm.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Debris": {
            "wordRoot": "Debris",
            "wordDefinition": "Debris refers to pieces of materials or objects that are scattered around after a disaster or an accident, such as broken bricks, fallen trees, and damaged furniture.\n\nDebris is the aftermath of a destructive event, while waste is the byproduct of regular human activities.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c7b54760-44e3-465b-9bfd-b90a3455060a.webp"
        },
        "Excess": {
            "wordRoot": "Excess",
            "wordDefinition": "Excess means having too much of something beyond what is needed or required. For example, if you eat too much food, it is considered excess.\n\nExcess is applicable when there is more than necessary, but the item or resource is still valuable and useful.\n\nExcess means having more than necessary, but the item or resource is still valuable and useful. Waste means using something unnecessarily or carelessly, resulting in it being unusable or thrown away.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4f745ff4-7371-4fe1-9280-5e3facaa768c.webp"
        },
        "Garbage": {
            "wordRoot": "Garbage",
            "wordDefinition": "Garbage refers to organic and biodegradable waste, such as food scraps and yard trimmings, while waste refers to all other forms of waste, including non-biodegradable substances like plastics and metals.\n\nGarbage is typically collected separately and composted while waste is often recycled or disposed of in a landfill. Both words can be used interchangeably to refer to the disposal of unwanted materials, but garbage is usually associated with organic waste while waste is a more general term.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/930d0fdd-92fe-4c44-9a20-da3e36d84741.webp"
        },
        "Litter": {
            "wordRoot": "Litter",
            "wordDefinition": "Litter refers to small pieces of garbage or waste that are scattered around, like candy wrappers or cigarette butts.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d8c2dc07-44c0-4a32-865d-ea12bc54aeed.webp"
        },
        "Refuse": {
            "wordRoot": "Refuse",
            "wordDefinition": "Refuse refers to things that are discarded or rejected because they are unwanted, unsatisfactory, or have no use.\n\nIt can also refer to the act of refusing to do something or accept something.\n\nIn other words, refuse is something that is already considered waste and is thrown away, while waste is something that could potentially be used or recycled but is not being used effectively.\n\nRefuse is applicable when something is completely useless or unwanted, while waste is applicable when something is being used inefficiently or inappropriately.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2af82455-c596-40d9-b90d-3d34df01fac7.webp"
        },
        "Remainder": {
            "wordRoot": "Remainder",
            "wordDefinition": "Remainder refers to what is left over after subtracting a certain amount or portion from a whole. For example, if you have 10 apples and you give away 3, the remainder is 7 apples.\n\nIn essence, the difference between the two words is that remainder refers to what is left over after something has been taken away, while waste refers to something that is no longer useful or necessary.\n\nThe term remainder is more applicable when dealing with numbers or quantities, while waste applies more broadly to a range of things that may be wasted or left unused.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/8ebf1acf-8526-4111-9472-916ad942943e.webp"
        },
        "Rubbish": {
            "wordRoot": "Rubbish",
            "wordDefinition": "Rubbish refers to things that are no longer needed or wanted, but still have some use.\n\nRubbish is used when referring to things that still have some value, while waste is used when referring to things that have no value and must be thrown away.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/89853a6f-ae1b-4199-90a3-c2ffb2ea2515.webp"
        },
        "Scrap": {
            "wordRoot": "Scrap",
            "wordDefinition": "Scrap refers to material that has value or can be repurposed, such as metal or paper. Waste refers to material that has no use and is typically thrown away, such as garbage or sewage.\n\nScrap is applicable when there is potential to reuse or recycle the material, while waste is applicable when something is no longer useful and needs to be disposed of.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/253da739-f1d6-42f3-9f4a-34029cf159b7.webp"
        }
    },
    "videos": [
        {
            "Text": " that I should go to college, I should become a professional person, that I had great potential and I was wasting my talent to do that.\" He said, \"It was humiliating. It was in front of the whole class and I felt dreadful. But it's what I wanted, and as soon as I left school, I applied to the fire service and I was accepted.",
            "Title": "Bring on the learning...",
            "VideoId": "r9LelXa3U_I",
            "Controls": "start=602"
        },
        {
            "Text": " not wasting a single kiloliter of fuel. It also helps us to think symmetrically so they can make shorter trips in either direction while setting the professor up for a long unsupported stretch in the middle. Here's his solution. All three planes take off at noon flying west,",
            "Title": "Can you solve the...",
            "VideoId": "dzrwnwOx0fw",
            "Controls": "start=113"
        },
        {
            "Text": " It also makes vitamin D and substances that help digestion. But one of its most vital products is bile. Like an eco-friendly treatment plant, the liver uses cells called hepatocytes to convert toxic waste products into this bitter greenish liquid.",
            "Title": "What does the liver do?...",
            "VideoId": "wbh3SjzydnQ",
            "Controls": "start=134"
        },
        {
            "Text": " and damaged infrastructure from pressure and waste water injection. Links between fracking and increased seismic activity leave unresolved questions about long-term pressure imbalances that might be happening deep beneath our feet.",
            "Title": "How does fracking work?...",
            "VideoId": "Tudal_4x4F0",
            "Controls": "start=233"
        },
        {
            "Text": " they're the bowels of one of the world's largest and most polluted cities where disease runs rampant and the stench is sickening human excrement toxic waste rotting cadavers all flowing right beneath the sidewalk the sewers of",
            "Title": "Sewer Diving PIPE National...",
            "VideoId": "TlRjbV-rT-E",
            "Controls": "start=0"
        },
        {
            "Text": " when released as toxic waste water in rivers and oceans. Technologies are now so advanced in some countries that the entire process of growing and producing fabric barely touches a human hand. But only up until this point.",
            "Title": "The life cycle of a...",
            "VideoId": "BiSYoeqb_VY",
            "Controls": "start=146"
        },
        {
            "Text": " A defence system of soldier ants ready to act at any sign of danger. A digestive system processing piles of food deep inside. Even a coordinated system for dealing with all the waste.",
            "Title": "Army Ants Rampage...",
            "VideoId": "JsfiUR0ZzLw",
            "Controls": "start=30"
        },
        {
            "Text": " Nothing is wasted. Even a wing has some nutritional value. The rest of the workers take him into the nest. He has their support, at least for the time being. He's on probation.",
            "Title": "Queen Ant Mating Season...",
            "VideoId": "MHoRiFq3ekw",
            "Controls": "start=111"
        },
        {
            "Text": " and educated and please encourage the young people you know to start living their dreams as goalie as possible right now why should any of us waste a moment thank you so much",
            "Title": "A message from the next...",
            "VideoId": "-QIi_MPo0b0",
            "Controls": "start=409"
        },
        {
            "Text": " nothing is wasted even a wing has some nutritional value the rest of the workers take him into the nest he has their support at least for the time being he's on probation",
            "Title": "Best Of Ants PIPE BBC Earth",
            "VideoId": "qu0HN9rYtIw",
            "Controls": "start=268"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/drew-barrymore.webp",
            "Text": "You can't live your life blaming your failures on your parents and what they did or didn't do for you. You're dealt the cards that you're dealt. I realised it was a waste of time to be angry at my parents and feel sorry for myself.",
            "Title": "American Actress",
            "Name": "Drew Barrymore"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/robert-baden-powell.webp",
            "Text": "Try and leave this world a little better than you found it, and when your turn comes to die, you can die happy in feeling that at any rate, you have not wasted your time but have done your best.",
            "Title": "English Soldier",
            "Name": "Robert Baden-Powell"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/kurt-cobain.webp",
            "Text": "Drugs are a waste of time. They destroy your memory and your self-respect and everything that goes along with with your self-esteem. They're no good at all.",
            "Title": "American Singer",
            "Name": "Kurt Cobain"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/william-butler-yeats.webp",
            "Text": "I balanced all, brought all to mind, the years to come seemed waste of breath, a waste of breath the years behind, in balance with this life, this death.",
            "Title": "Irish Poet",
            "Name": "William Butler Yeats"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/john-ruskin.webp",
            "Text": "Life being very short, and the quiet hours of it few, we ought to waste none of them in reading valueless books.",
            "Title": "English Writer",
            "Name": "John Ruskin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/charles-darwin.webp",
            "Text": "A man who dares to waste one hour of time has not discovered the value of life.",
            "Title": "English Scientist",
            "Name": "Charles Darwin"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/bruce-lee.webp",
            "Text": "If you love life, don't waste time, for time is what life is made up of.",
            "Title": "American Actor",
            "Name": "Bruce Lee"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/benjamin-disraeli.webp",
            "Text": "There is no waste of time in life like that of making explanations.",
            "Title": "British Statesman",
            "Name": "Benjamin Disraeli"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/aesop.webp",
            "Text": "No act of kindness, no matter how small, is ever wasted.",
            "Title": "Greek Author",
            "Name": "Aesop"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/douglas-adams.webp",
            "Text": "Life is wasted on the living.",
            "Title": "English Writer",
            "Name": "Douglas Adams"
        }
    ]
}