{
    "currentWord": {
        "wordRoot": "wise",
        "id": 6570,
        "phonemic": "waɪz|waɪz\r",
        "bigId": "546f8f79-19d2-4302-8bc3-17d7164aacce",
        "wordForms": [
            "wiser",
            "wisest",
            "wises",
            "wising",
            "wised",
            "wisely",
            "unwise",
            "wise"
        ]
    },
    "senses": [
        {
            "id": "546f8f79-19d2-4302-8bc3-17d7164aacce",
            "de": "Having or showing good judgement",
            "ty": "adjective",
            "ex": "He is wise enough not to do such a foolish act.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/546f8f79-19d2-4302-8bc3-17d7164aacce.webp",
            "Tips": [
                {
                    "title": "Good Judgement",
                    "description": "Applies when someone must decide between options and chooses the best one.",
                    "example": "She was wise to invest her savings early.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/tRaLmuy5bqpzzXFC8ceZiPLxYPE.webp"
                },
                {
                    "title": "Not Foolish",
                    "description": "'Wise' suggests someone won't do things that are obviously wrong or silly.",
                    "example": "It is wise to check the weather before hiking.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/dRx4M9pCdF2Iq7XP1iN94UxbZY.webp"
                }
            ]
        },
        {
            "id": "c1411929-715f-4bd2-8672-e467972dd6d5",
            "de": "Having knowledge, understanding, or experience",
            "ty": "adjective",
            "ex": "He is wise in the ways of the world.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/c1411929-715f-4bd2-8672-e467972dd6d5.webp",
            "Tips": [
                {
                    "title": "Life Experience",
                    "description": "Refers to a deep understanding gained by personal experiences over time.",
                    "example": "Grandma is wise; she gives great advice.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Knowledge Depth",
                    "description": "Use 'wise' for someone who has a profound grasp of a particular area.",
                    "example": "Having traveled widely, he’s wise about different cultures.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "33ff1be4-847a-4e63-b5b4-6592e4f0d8da",
            "de": "Used in combination with other words to mean 'in the manner of' or 'in terms of' something",
            "do": "General",
            "ty": "adjective",
            "ex": "I sorted the books size-wise.",
            "use": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/33ff1be4-847a-4e63-b5b4-6592e4f0d8da.webp",
            "Tips": [
                {
                    "title": "Combining Form",
                    "description": "Connects with other words to discuss aspects of something, like 'size-wise'.",
                    "example": "Can we discuss this budget-wise?\r",
                    "imageUrl": ""
                },
                {
                    "title": "Manner or Aspect",
                    "description": "Highlights how something is done or a particular aspect of it.",
                    "example": "Health-wise, the patient has improved significantly.",
                    "imageUrl": ""
                }
            ],
            "sy": "",
            "op": ""
        },
        {
            "id": "610a1f66-5473-4cea-8d41-b1f23e81c767",
            "de": "Way, manner, extent",
            "ty": "noun",
            "ex": "They were poor, and often lived hand to mouth, money-wise.",
            "use": "",
            "co": "Colloquial",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/610a1f66-5473-4cea-8d41-b1f23e81c767.webp",
            "Tips": [
                {
                    "title": "Colloquial Usage",
                    "description": "'Wise' as a noun is informal, often used in specific contexts or fixed phrases.",
                    "example": "We should compare the costs efficiency-wise.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Qualifying Extent",
                    "description": "As a noun, it can imply 'in terms of' to qualify statements about degree or extent.",
                    "example": "That decision was unwise money-wise.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Modern Use",
                    "description": "Its use as a noun is modern and may not be as recognized by older generations.",
                    "example": "We need to think career-wise when choosing a major.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        },
        {
            "id": "8384be66-80b3-4ff3-a3fe-ced5743bb1bd",
            "de": "In order to; so as to",
            "ty": "adverb",
            "ex": "They arranged their schedule time-wise to accommodate all activities.",
            "use": "",
            "co": "Colloquial",
            "sy": "",
            "re": "",
            "tp": "",
            "cl": [
                ""
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/8384be66-80b3-4ff3-a3fe-ced5743bb1bd.webp",
            "Tips": [
                {
                    "title": "Purpose Indication",
                    "description": "As an adverb, 'wise' can introduce the purpose or reason for an action.",
                    "example": "She organized her tasks priority-wise.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Preference Clarification",
                    "description": "Can shed light on someone's preferences or intentions within a context.",
                    "example": "I planned my holiday budget-wise to save money.",
                    "imageUrl": ""
                }
            ],
            "op": ""
        }
    ],
    "comparisons": {
        "Astute": {
            "wordRoot": "Astute",
            "wordDefinition": "Astute and wise are both words that describe people who possess good judgment and decision-making skills.\n\nHowever, astute is more commonly used to describe someone who is quick and perceptive in their observations, often in regards to business, politics, or financial matters.\n\nAstute is applicable in situations that require quick thinking or keen observation, while wise is more applicable in situations that require careful consideration or reflection.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c325ad34-66eb-47de-aaa2-720278385ac7.webp"
        },
        "Discriminate": {
            "wordRoot": "Discriminate",
            "wordDefinition": "Discriminate means to treat people unfairly because of their race, gender, religion or other factors.\n\nIt is not a good thing to do and can lead to discrimination, which is wrong and hurtful.\n\nBoth words are used in different situations. Discriminate is used when someone is treating someone unfairly, while wise is used when someone is making smart decisions.\n\nDiscriminate is not a good thing, while wise is a positive quality.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/74a5705c-9ccb-4a35-9f00-b4a692a9b4a2.webp"
        },
        "Experience": {
            "wordRoot": "Experience",
            "wordDefinition": "Experience refers to the things you have done or been through in your life. It's something that you gain or acquire over time through your actions or encounters.\n\nFor example, traveling to different countries, working at a job, or learning a new skill are all experiences you may have.\n\nWise refers to having a deep understanding and knowledge of a particular subject or situation. It comes from learning and reflecting on your experiences and applying that knowledge to future situations.\n\nSo, while experience can help make someone wise, they are not necessarily the same thing.\n\nExperience describes what a person has gone through or done, while wise describes someone who has gained knowledge and insight from their experiences.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e81d6d88-3fbb-4358-a81c-8fcfe99e40d0.webp"
        },
        "Insight": {
            "wordRoot": "Insight",
            "wordDefinition": "Insight refers to the ability to understand something deeply or intuitively, often gained through experience or observation.\n\nInsight is about understanding, while wise is about decision-making and judgment.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/4e43e66e-a7ee-46c4-a2a1-0e14cc1bfb7c.webp"
        },
        "Intelligent": {
            "wordRoot": "Intelligent",
            "wordDefinition": "Intelligent refers to having a high level of mental capability or being able to learn quickly and think logically. It is applicable more to academic or intellectual pursuits, such as solving complex math problems.\n\nIntelligent refers to being smart, while wise refers to being able to make good decisions based on experience and understanding.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/65ea95ca-94e9-49e1-9202-aa20573b8774.webp"
        },
        "Knowledgeable": {
            "wordRoot": "Knowledgeable",
            "wordDefinition": "Knowledgeable refers to having a lot of knowledge or information about a particular subject. It implies that someone has studied or researched enough to know a lot about a topic.\n\nFor example, a person who reads a lot of books about medicine might be knowledgeable about health.\n\nBoth terms can be applicable in many situations. Someone who is knowledgeable might be a good teacher or researcher, while someone who is wise might be a good leader or counselor.\n\nHowever, being knowledgeable doesn't necessarily mean you are wise, and being wise doesn't necessarily mean you are knowledgeable.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/dee10825-9ebe-457c-b719-933617027a35.webp"
        },
        "Perceptive": {
            "wordRoot": "Perceptive",
            "wordDefinition": "Perceptive means having or showing an understanding of something through insight or intuition. It refers to a person's ability to be sensitive to things that are not obvious, and to see things in a different way than most people do.\n\nPerceptive is applicable when one needs to understand something that is not immediately apparent, like discerning someone's mood or motivation.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/c210666a-5441-40c4-b865-c46a30eeffea.webp"
        },
        "Prudent": {
            "wordRoot": "Prudent",
            "wordDefinition": "Prudent refers to being careful and cautious in making decisions or taking actions in order to avoid potential problems or risks.\n\nPrudent is more related to being careful in avoiding risks, while wise is more related to making sound decisions based on knowledge and experience.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/d86781bc-bc74-4772-aed7-3f298b484fbd.webp"
        },
        "Sage": {
            "wordRoot": "Sage",
            "wordDefinition": "Sage refers to someone who has a lot of knowledge and experience, especially in the field of philosophy or spirituality.\n\nA sage is usually seen as a wise person who imparts their knowledge to others. Sage is applicable in situations where someone's knowledge and experience in a particular field is highly respected.\n\nA sage is someone who has deep knowledge and experience in a specific area and is respected for that, whereas a wise person is someone who has good judgment and intelligence and can give practical advice.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a7454869-7382-47d7-a90d-968b4d039de9.webp"
        }
    },
    "videos": [
        {
            "Text": " That fear of being seen as an awful idiot is a threat reaction from a primitive part of your brain that's very hard to control. It's the fight or flight response, a self-protective process seen in a range of animals, most of which don't give speeches. But we have a wise partner in the study of freaking out.",
            "Title": "The science of stage...",
            "VideoId": "K93fMnFKwfI",
            "Controls": "start=49"
        },
        {
            "Text": " guarantee you if something truly important happens you will hear about it in time from your friends and don't be shy about discussing your news diet people will be fascinated my advice to you go deep instead of broaden your search for knowledge you will be more healthy more wealthy and more wise thank",
            "Title": "Four reasons you should...",
            "VideoId": "-miTTiaqFlI",
            "Controls": "start=273"
        },
        {
            "Text": " Geographic fellow and this is cook wise in winemaking the concept of terroir of how the earth of soil the air and the sunshine add to the quality characteristics of each individual one is very important we're here in the iron horse vendor it's discussing the idea of",
            "Title": "Wine From Water PIPE...",
            "VideoId": "zBL0H7D6FKk",
            "Controls": "start=15"
        },
        {
            "Text": " She wrote, \"When one reads of a witch being ducked, of a woman possessed by devils, of a wise woman selling herbs, or even a very remarkable man who had a mother, then I think we're on the track of a lost novelist, a suppressed poet,",
            "Title": "Why should you read...",
            "VideoId": "DcMLkce_BLg",
            "Controls": "start=46"
        },
        {
            "Text": " Call to Adventure. The hero receives a mysterious message. An invitation, a challenge? Assistance The hero needs some help, probably from someone older, wiser. Departure The hero crosses the threshold from his normal, safe home,",
            "Title": "What makes a hero? -...",
            "VideoId": "Hhk4N9A0oCA",
            "Controls": "start=65"
        },
        {
            "Text": " pointing towards enlightenment. That's similar to Tamino, who in passing his trials restores balance to the kingdom while growing stronger, wiser, and more complete.",
            "Title": "The secrets of Mozart’s...",
            "VideoId": "8iKd-P4Bcac",
            "Controls": "start=313"
        },
        {
            "Text": " for a single wolf killing such a large prey is dangerous storm is older and wiser once he's wounded the Buffalo he pulls back and waits for the animal to",
            "Title": "Wolf Pack Hunts Buffalo...",
            "VideoId": "6NPe4QReznM",
            "Controls": "start=222"
        },
        {
            "Text": " fletchers bend the arrow, carpenters bend a log of wood, wise people fashion themselves.\" And that's the idea I want to leave you with,",
            "Title": "Julian Baggini: Is there...",
            "VideoId": "Q80MfH7xPPE",
            "Controls": "start=681"
        },
        {
            "Text": " Simba wisely retreats from the skirmish and re-marks his territory.",
            "Title": "Simba Under Attack PIPE ...",
            "VideoId": "R16ZL-E5OO0",
            "Controls": "start=159"
        },
        {
            "Text": " puffins must choose their moment wisely",
            "Title": "Puffin Hunts Fish To...",
            "VideoId": "EIUJfXk3_3w",
            "Controls": "start=318"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/martin-luther.webp",
            "Text": "If you young fellows were wise, the devil couldn't do anything to you, but since you aren't wise, you need us who are old.",
            "Title": "German Leader",
            "Name": "Martin Luther"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/winston-churchill.webp",
            "Text": "When you are winning a war almost everything that happens can be claimed to be right and wise.",
            "Title": "British Statesman",
            "Name": "Winston Churchill"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/johann-wolfgang-von-goethe.webp",
            "Text": "Who is the wisest man? He who neither knows or wishes for anything else than what happens.",
            "Title": "German Writer",
            "Name": "Johann Wolfgang von Goethe"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/socrates.webp",
            "Text": "I am the wisest man alive, for I know one thing, and that is that I know nothing.",
            "Title": "Greek Philosopher",
            "Name": "Socrates"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/abraham-lincoln.webp",
            "Text": "I do not think much of a man who is not wiser today than he was yesterday.",
            "Title": "American President",
            "Name": "Abraham Lincoln"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/buddha.webp",
            "Text": "Even death is not to be feared by one who has lived wisely.",
            "Title": "Leader",
            "Name": "Buddha"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/confucius.webp",
            "Text": "Only the wisest and stupidest of men never change.",
            "Title": "Chinese Philosopher",
            "Name": "Confucius"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/william-shakespeare.webp",
            "Text": "It is a wise father that knows his own child.",
            "Title": "English Playwright",
            "Name": "William Shakespeare"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/theodore-roosevelt.webp",
            "Text": "Nine-tenths of wisdom is being wise in time.",
            "Title": "American President",
            "Name": "Theodore Roosevelt"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/plato.webp",
            "Text": "The wisest have the most authority.",
            "Title": "Greek Philosopher",
            "Name": "Plato"
        }
    ]
}