{
    "currentWord": {
        "wordRoot": "withhold",
        "id": 5570,
        "phonemic": "wɪθˈhəʊld|wɪðˈhəʊld\r",
        "bigId": "b17e2093-33a1-4c91-a7e3-458ebaacf668",
        "wordForms": [
            "withholds",
            "withholding",
            "withheld",
            "withhold"
        ]
    },
    "senses": [
        {
            "id": "b17e2093-33a1-4c91-a7e3-458ebaacf668",
            "de": "To refrain from giving or revealing something",
            "ty": "verb",
            "ex": "I didn't mean to withhold the truth from you.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "withhold information",
                " withhold consent",
                " withhold payments"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/b17e2093-33a1-4c91-a7e3-458ebaacf668.webp",
            "Tips": [
                {
                    "title": "Selective Sharing",
                    "description": "Used when someone chooses not to share specific information deliberately.",
                    "example": "He decided to withhold the client list from the meeting.\r",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/SD3XFDS8RObVHlURlomudkoFlg.webp"
                },
                {
                    "title": "Strategic Silence",
                    "description": "Often implies a strategic or purposeful reason for not revealing something.",
                    "example": "She chose to withhold her plans until the time was right.",
                    "imageUrl": "https://word-images.cdn-wordup.com/tips/xYzWkhE2BP2rYbEiEplUmIb7Y.webp"
                }
            ]
        },
        {
            "id": "4c43770a-442e-4579-ba83-b5fa2493443d",
            "de": "To stop oneself from doing or expressing something",
            "ty": "verb",
            "ex": "With all the evidence, I couldn't withhold my criticism.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "withhold criticism",
                " withhold judgement",
                " withhold opinion"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/4c43770a-442e-4579-ba83-b5fa2493443d.webp",
            "Tips": [
                {
                    "title": "Emotional Control",
                    "description": "Indicates control over expressions of feelings or thoughts.",
                    "example": "Despite being angry, he withheld his response in the meeting.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Judgement Consideration",
                    "description": "Shows careful consideration before expressing opinions or judgements.",
                    "example": "She withheld judgement until all facts were presented.",
                    "imageUrl": ""
                }
            ]
        },
        {
            "id": "db0e1e40-8f3e-45b7-b736-7f84add509e9",
            "de": "To deduct or retain a portion of money",
            "do": "financial",
            "ty": "verb",
            "ex": "I withhold taxes from my paycheck for the IRS.",
            "use": "",
            "sy": "",
            "op": "",
            "re": "",
            "tp": "",
            "cl": [
                "withhold taxes",
                " withhold rent",
                " withhold wages"
            ],
            "ImageSrc": "https://word-images.cdn-wordup.com/senses/db0e1e40-8f3e-45b7-b736-7f84add509e9.webp",
            "Tips": [
                {
                    "title": "Paycheck Deductions",
                    "description": "Refers to money taken out of a salary before a person receives it.",
                    "example": "A certain amount was withheld from his paycheck for insurance coverage.\r",
                    "imageUrl": ""
                },
                {
                    "title": "Legal Requirement",
                    "description": "Often relates to mandatory deductions like taxes or child support.",
                    "example": "The company must withhold a percentage of your pay for social security.",
                    "imageUrl": ""
                }
            ]
        }
    ],
    "comparisons": {
        "Conceal": {
            "wordRoot": "Conceal",
            "wordDefinition": "The words conceal and withhold both mean to keep something hidden or secret.\n\nHowever, conceal usually means to hide something physical or tangible, whereas withhold generally means to keep information or something intangible back.\n\nFor example, if you put a gift in a closet so that someone won't find it, you are concealing the gift. If you don't tell your friend a secret you were told, you are withholding information.\n\nConceal is used when you are hiding a physical object, while withhold is used when you are keeping information or something abstract to yourself.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/a14e576d-140b-4b2a-80a4-d1f68cb8d601.webp"
        },
        "Hold back": {
            "wordRoot": "Hold back",
            "wordDefinition": "The words hold back and withhold both mean to keep something from someone or something, but they are used in slightly different ways.\n\nHold back is often used when you are talking about holding back emotions or physical objects. For example, you might hold back tears when you are sad, or hold back a dog on a leash to keep it from running away.\n\nWithhold is typically used when talking about keeping something from someone else, often something that they expect or are entitled to.\n\nFor example, a bank might withhold someone's money if they have not met certain requirements or if there is suspicion of fraudulent activity.\n\n- Hold back is used when holding back emotions or physical objects\n\n- Withhold is used when keeping something from someone else that they are entitled to or expecting.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/2f18c4ed-af74-42ae-9d52-a7f281335646.webp"
        },
        "Keep back": {
            "wordRoot": "Keep back",
            "wordDefinition": "The phrase keep back means to hold something or someone in a specific place or stop them from moving forward. For example, the police might keep back a crowd trying to get too close to a crime scene.\n\nWithhold means to hold back or not give something that is due or expected. For example, a company might withhold an employee's salary if they don't complete their work properly.\n\nSo while both phrases involve holding back, keep back is more physical and often used to control crowds or objects, and withhold is more abstract and often used in situations where something is being denied or cut off.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/b24cc7a4-8cbe-4a15-93a7-028d644f2087.webp"
        },
        "Refrain": {
            "wordRoot": "Refrain",
            "wordDefinition": "Refrain means to hold back from doing something or to avoid doing it altogether. For example, if someone has a bad habit of interrupting others, they might try to refrain from interrupting.\n\nSo, in short, refrain is used when you want to stop yourself from doing something, while withhold is used when you want to stop something from being given or shared with someone else.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/cf98b61a-30f7-47bc-89c3-8ff2574dafcf.webp"
        },
        "Restrain": {
            "wordRoot": "Restrain",
            "wordDefinition": "Restrain means to hold back or stop someone from doing something.\n\nRestrain is used when talking about stopping a person from doing something, while withhold is used when talking about holding back information or something else that is not a person.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/119c5755-832e-4afa-9d29-bf4739a10eaa.webp"
        },
        "Retain": {
            "wordRoot": "Retain",
            "wordDefinition": "Retain means to keep or hold on to something without letting it go. It is applicable when you want to keep something for future use or possession.\n\nFor example, you may retain your old clothes to wear them again someday. You may withhold your earnings from a business partner if they did not fulfill their part of the agreement.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/e3bd99be-8acc-44ec-884f-04ae6f2f96f2.webp"
        },
        "Stop": {
            "wordRoot": "Stop",
            "wordDefinition": "Stop means to end or cease an action or activity completely.\n\nFor example, if someone is running towards a busy street, shouting \"stop!\" would immediately make them halt completely.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/7e5c6ef8-b805-4ba2-a8da-1a9947f1c29c.webp"
        },
        "Suppress": {
            "wordRoot": "Suppress",
            "wordDefinition": "Suppress means to prevent something from being seen or heard.\n\nFor example, if a person feels angry but suppresses their anger, they may appear calm on the outside even though they are upset on the inside.\n\nSuppress describes hiding or controlling something, while withhold describes not giving something that is due or expected.",
            "wordImage": "https://word-images.cdn-wordup.com/senses/992c8984-1127-4970-ab11-042b8600d046.webp"
        }
    },
    "videos": [
        {
            "Text": " And yet, they always manage to get the result that they want. So how does this work? How can we explain this strange phenomenon? Well, it turns out that what happens is the negative data goes missing in action; it's withheld from doctors and patients. And this is the most important aspect of the whole story. It's at the top of the pyramid of evidence.",
            "Title": "Ben Goldacre: Battling...",
            "VideoId": "h4MhbkWJzKk",
            "Controls": "start=588"
        },
        {
            "Text": " what they considered vital research. They had yet to confirm their theories about racial difference, and they believed they would never have another opportunity to observe the long-term effects of untreated syphilis. The study’s leadership decided to withhold knowledge of new treatments from their subjects.",
            "Title": "Ugly History: The U.S....",
            "VideoId": "ZV7RzS8QRXE",
            "Controls": "start=161"
        },
        {
            "Text": " I want to know-- did you mean that as a threat? In other words, that if-- if I or other members of the council are going to be criticizing you or the department, are you saying that you will withhold support of these services to fight crime in our districts?",
            "Title": "More Questions Than...",
            "VideoId": "lcGM1ecV4q0",
            "Controls": "start=117"
        },
        {
            "Text": " department are you saying that you will will withhold support of these services to fight crime in our districts that is the most insulting thing I have heard on this council floor and all the time and I've been here a lot longer than",
            "Title": "LA92 Panel - Live PIPE...",
            "VideoId": "dWGUgjgOW_Y",
            "Controls": "start=2838"
        },
        {
            "Text": " The judge grants her request. The scribe records the new contract in cuneiform into a wet clay tablet, and the matter is settled. She's protected her income and spared her brother’s life by withholding the true extent of his crimes.",
            "Title": "A day in the life of an...",
            "VideoId": "ZsiHrK9DvvQ",
            "Controls": "start=236"
        },
        {
            "Text": " And we need to continue to cultivate bravery. Whistle-blowers are brave. Often, they underestimated the impact whistle-blowing had on their family, but what they continue to comment on is how hard it is to withhold the truth.",
            "Title": "How whistle-blowers...",
            "VideoId": "51k3UASQE5E",
            "Controls": "start=539"
        },
        {
            "Text": " want to withhold the information and those who want to get information by using tactical deception the ravens are anticipating and trying to predict what another bird is doing a level of strategy rarely seen in animals",
            "Title": "The Raven: Stealing,...",
            "VideoId": "Sng1oV_uDzM",
            "Controls": "start=175"
        },
        {
            "Text": " so extreme. Is anyone paying attention to some of the things these guys do? They borrow money. They're not supposed to, but they figure out a way. They make you pay more in withholding just to help their cash flow out.",
            "Title": "How state budgets are...",
            "VideoId": "jiUKpX09zo4",
            "Controls": "start=261"
        },
        {
            "Text": " societies like this it's very common in many parts of the world for ancestors to be the source of all of these blessings so that if the ancestors are upset then maybe they will actually withhold the bounties of nature",
            "Title": "Stonehenge Monument PIPE...",
            "VideoId": "LQG6IWNUAms",
            "Controls": "start=191"
        },
        {
            "Text": " emphasized the value of privacy. Because cultivating a private life is precious. It's sacred. Its value is inherent in what you don't share. What you withhold. And for whom.",
            "Title": "Bryce Dallas Howard: How...",
            "VideoId": "G-lWWxJPfFo",
            "Controls": "start=375"
        }
    ],
    "quotes": [
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/alexandra-kleeman.webp",
            "Text": "Sometimes I want to withhold judgement on whether something is good or bad, but I do feel like identifying with TV characters - connecting to them emotionally more than you connect to literal, physical people in your life - causes problems. They just don't have the same existence or boundaries as you do. They resemble us, but they are not us.",
            "Title": "American Author",
            "Name": "Alexandra Kleeman"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/iyanla-vanzant.webp",
            "Text": "In order to feel loved, be respected and stay connected, we humans have a tendency to lie. We lie about who we are, what we want, what we need, what we have done or will do. Perhaps 'lie' is too strong a word. Let me say that what we do is withhold the truth.",
            "Title": "American Author",
            "Name": "Iyanla Vanzant"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/sean-combs.webp",
            "Text": "I would never withhold information about the murder of my man Biggie, or anybody else. It's just silly and ridiculous. The accusations are just flying out. All I've been trying to do all my life is to make great music.",
            "Title": "American Musician",
            "Name": "Sean Combs"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/matt-apuzzo.webp",
            "Text": "When I write that I've known about something for a long time, that's not a boast. That's a confession. It's me acknowledging that I have withheld something important from the public.",
            "Title": "American Journalist",
            "Name": "Matt Apuzzo"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/amitava-kumar.webp",
            "Text": "Inequality reigns in horrifying ways, and not everyone can even read, but the world of media and advertising withholds very little from the imagination of the dispossessed.",
            "Title": "Indian Writer",
            "Name": "Amitava Kumar"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/idina-menzel.webp",
            "Text": "We are never doing anyone any favors by withholding our gifts from the world. It's scary to be fierce, but you can't compromise that for fear of losing those around you.",
            "Title": "American Actress",
            "Name": "Idina Menzel"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/richard-thaler.webp",
            "Text": "If you're not putting enough away for emergencies or retirement, making commitments in advance, such as signing up for payroll withholding, can help.",
            "Title": "American Economist",
            "Name": "Richard Thaler"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/eldridge-cleaver.webp",
            "Text": "Respect commands itself and can neither be given nor withheld when it is due.",
            "Title": "American Activist",
            "Name": "Eldridge Cleaver"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/henry-williamson.webp",
            "Text": "All the experience of the greatest city in the world could not withhold me.",
            "Title": "English Author",
            "Name": "Henry Williamson"
        },
        {
            "ImageSrc": "https://author.cdn-wordup.com/img-webp/nancy-pelosi.webp",
            "Text": "I think that much of the truth has been withheld from the American people.",
            "Title": "American Politician",
            "Name": "Nancy Pelosi"
        }
    ]
}